<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: La r&#233;solution de l&apos;&apos;actif {0} indique des d&#233;pendances de contenu partag&#233; non valides au contenu d&apos;&apos;application : {1}
  </MsgText>
  <Explanation>
    Les bundles d&apos;application ne peuvent pas mettre &#224; disposition de package ni de service pour les bundles partag&#233;s. De plus, les bundles ne peuvent pas &#234;tre d&#233;ploy&#233;s &#224; la fois sous forme de bundles partag&#233;s et de bundles d&apos;application. Les d&#233;ploiements requ&#233;rant des bundles partag&#233;s qui d&#233;pendent de bundles d&apos;application ne sont pas valides.
  </Explanation>
  <UserResponse>
    D&#233;terminez si tous les bundles partag&#233;s non valides sont requis par l&apos;application. Si tel est le cas, assurez-vous qu&apos;ils ne d&#233;pendent pas d&apos;un contenu d&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: Impossible de lire le manifeste de bundle du fichier JAR {0} dans le fichier EBA {1}.
  </MsgText>
  <Explanation>
    Une exception d&apos;entr&#233;es/sorties s&apos;est produite lors de la localisation d&apos;un fichier JAR dans un fichier EBA. Le fichier est peut-&#234;tre endommag&#233; ou illisible.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le fichier dispose des autorisations appropri&#233;es et qu&apos;il est dans le bon format.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Une erreur interne s&apos;&apos;est produite. Le service {0} de mise &#224; disposition n&apos;&apos;est pas disponible.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: L&apos;&apos;application OSGi d&#233;ploy&#233;e dans l&apos;&apos;unit&#233; de composition {0} de l&apos;&apos;application de niveau m&#233;tier {1} n&apos;&apos;a pas d&#233;marr&#233;.
  </MsgText>
  <Explanation>
    Une exception est survenue lors de l&apos;op&#233;ration de d&#233;marrage.
  </Explanation>
  <UserResponse>
    Consultez les journaux du serveur ant&#233;rieurs &#224; cette exception pour un diagnostic plus pr&#233;cis du probl&#232;me.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: Le fichier d&apos;&apos;archive de bundle d&apos;&apos;entreprise (EBA) {1} contient le r&#233;pertoire {0}, qui n&apos;&apos;est pas pris en charge.
  </MsgText>
  <Explanation>
    Le fichier EBA sp&#233;cifi&#233; contient un r&#233;pertoire appel&#233; byValue ou byReference. Ces noms de r&#233;pertoire ne sont pas pris en charge dans le r&#233;pertoire principal d&apos;un fichier EBA.
  </Explanation>
  <UserResponse>
    Supprimez ou renommez le r&#233;pertoire en question.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: Le r&#244;le {0} sp&#233;cifi&#233; n&apos;&apos;existe pas.
  </MsgText>
  <Explanation>
    Tentative de mapper des utilisateurs ou des groupes &#224; un r&#244;le de s&#233;curit&#233; qui n&apos;existe pas.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;existence du r&#244;le de s&#233;curit&#233; en question ou cr&#233;ez ce r&#244;le dans l&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: Le manifeste de d&#233;ploiement &#224; importer n&apos;&apos;est pas valide pour l&apos;&apos;actif {0} car il ne satisfait pas les exigences &#233;nonc&#233;es dans le manifeste de l&apos;&apos;application.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement DEPLOYMENT.MF n&apos;est pas compatible avec le manifeste d&apos;application APPLICATION.MF de l&apos;actif.
  </Explanation>
  <UserResponse>
    Le nouveau manifeste de d&#233;ploiement doit remplir les conditions suivantes :
   1. Les en-t&#234;tes Application-SymbolicName et Application-Version du fichier DEPLOYMENT.MF doivent correspondre aux en-t&#234;tes correspondants du fichier APPLICATION.MF.
   2. Les bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te Deployed-Content du fichier DEPLOYMENT.MF doivent correspondre &#224; ceux r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content du fichier APPLICATION.MF.
   3. La version du bundle r&#233;pertori&#233; dans l&apos;en-t&#234;te Deployed-Content du fichier DEPLOYMENT.MF doit &#234;tre comprise dans la plage des versions du bundle correspondant dans le fichier APPLICATION.MF.
   4. Les bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te Deployed-Use-Bundle du fichier DEPLOYMENT.MF doivent &#233;galement &#234;tre r&#233;pertori&#233;s dans l&apos;en-t&#234;te Use-Bundle du fichier APPLICATION.MF.
   5. La version du bundle figurant dans l&apos;en-t&#234;te Deployed-Use-Bundle du fichier DEPLOYMENT.MF doit &#234;tre comprise dans la plage des versions du bundle correspondant figurant dans l&apos;en-t&#234;te Use-Bundle du fichier APPLICATION.MF.
 N&apos;&#233;ditez pas manuellement le manifeste de d&#233;ploiement. Si n&#233;cessaire, supprimez le manifeste de d&#233;ploiement du fichier EBA. Ainsi, un nouveau fichier manifeste de d&#233;ploiement sera g&#233;n&#233;r&#233; &#224; l&apos;importation du fichier EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: Les versions des bundles s&#233;lectionn&#233;s ne peuvent &#234;tre r&#233;solues ou elles ne sont pas compatibles.
  </MsgText>
  <Explanation>
    Le syst&#232;me ne parvient pas &#224; r&#233;soudre les versions des bundles s&#233;lectionn&#233;s. Les bundles ont peut-&#234;tre des d&#233;pendances qui sont manquantes, ou il sont incompatibles, ou tout simplement ils n&apos;existent pas.
  </Explanation>
  <UserResponse>
    Modifiez l&apos;ensemble s&#233;lectionn&#233; de bundles et refaites une tentative. La console d&apos;administration vous permet de visualiser ou de pr&#233;visualiser l&apos;&#233;tat de l&apos;actif.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: L&apos;&apos;utilisateur {0} n&apos;&apos;est pas un utilisateur mapp&#233; ou n&apos;&apos;est pas membre d&apos;&apos;un groupe mapp&#233; au r&#244;le {1}.
  </MsgText>
  <Explanation>
    Tout utilisateur sp&#233;cifi&#233; doit &#234;tre mapp&#233; au r&#244;le de s&#233;curit&#233; ou &#234;tre membre d&apos;un groupe mapp&#233; au r&#244;le de s&#233;curit&#233;. L&apos;utilisateur sp&#233;cifi&#233; ne respecte pas ces exigences.
  </Explanation>
  <UserResponse>
    Configurez les mappages r&#244;le de s&#233;curit&#233;/utilisateur ou groupe pour que l&apos;utilisateur sp&#233;cifi&#233; puisse agir avec le r&#244;le sp&#233;cifi&#233; ou indiquez un autre utilisateur disposant d&#233;j&#224; des droits requis.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: L&apos;&apos;application {0} contient une ou plusieurs archives de bundle composite (CBA) dans son en-t&#234;te {1}. Ce cas n&apos;&apos;est pas pris en charge dans le module de fonctions des applications OSGi de WebSphere Application Server version 7.
  </MsgText>
  <Explanation>
    Les archives de bundle composite (CBA) sont prises en charge dans l&apos;en-t&#234;te Application-Content pour WebSphere Application Server versions 8 et ult&#233;rieures.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise. Si l&apos;application doit s&apos;ex&#233;cuter dans le module de fonctions des applications OSGi de WebSphere Application Server version 7, r&#233;&#233;crivez l&apos;application pour que l&apos;en-t&#234;te Application-Content ne comporte pas d&apos;archive de bundle composite (CBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: Une exception d&apos;&apos;entr&#233;e-sortie s&apos;&apos;est produite lors de la lecture du fichier manifeste d&apos;&apos;application de l&apos;&apos;archive de bundles d&apos;&apos;entreprise (EBA) {0}. Le fichier n&apos;&apos;est peut-&#234;tre pas valide. Ou alors il est endommag&#233; ou illisible.
  </MsgText>
  <Explanation>
    Une exception d&apos;entr&#233;es/sorties s&apos;est produite lors de la lecture d&apos;un fichier manifeste d&apos;application EBA. Le fichier n&apos;est peut-&#234;tre pas valide. Ou alors il est endommag&#233; ou illisible.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le fichier manifeste de l&apos;application, APPLICATION.MF, respecte la sp&#233;cification relative aux fichiers manifestes.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Une erreur interne s&apos;&apos;est produite. L&apos;&apos;URI du fichier de configuration du plug-in n&apos;&apos;est pas dans le format attendu {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Une erreur interne s&apos;&apos;est produite. Un r&#233;sultat erron&#233; a &#233;t&#233; retourn&#233; lors de la mise &#224; disposition du fichier EBA {0} : la version maximum {1} &#233;tait cens&#233;e &#234;tre identique &#224; la version minimum {2}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: L&apos;&apos;application {0} n&apos;&apos;a pas pu &#234;tre mise &#224; disposition pour tous les noeuds de la cellule. L&apos;&apos;application ne peut &#234;tre d&#233;ploy&#233;e que sur les noeuds de version 7 qui ex&#233;cutent le module de fonctions des applications OSGi. Erreur de r&#233;solution : {1}.
  </MsgText>
  <Explanation>
    L&apos;application import&#233;e a &#233;t&#233; mise &#224; disposition dans le module de fonctions des applications OSGi de WebSphere Application Server version 7 mais n&apos;a pas pu &#234;tre mise &#224; disposition sur WebSphere Application Server version 8.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise. Toutefois, cet avertissement indique que l&apos;application peut contenir une exigence de version tr&#232;s stricte. Vous pouvez utiliser les informations mentionn&#233;es dans l&apos;erreur de r&#233;solution pour modifier l&apos;application afin qu&apos;elle puisse &#234;tre d&#233;ploy&#233;e sur les noeuds de version 8.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: Un membre de cluster ne peut pas &#234;tre cr&#233;&#233; sur le noeud {0} car l&apos;&apos;application ou les applications OSGi {1} d&#233;finissent des r&#244;les d&apos;&apos;ex&#233;cution.
  </MsgText>
  <Explanation>
    Le nouveau membre de cluster ne peut pas prendre en charge des applications OSGi qui d&#233;finissent des r&#244;les d&apos;ex&#233;cution alors que tous les membres de cluster doivent pouvoir ex&#233;cuter les m&#234;mes applications.
  </Explanation>
  <UserResponse>
    S&#233;lectionnez un noeud de version 8 pour h&#233;berger le membre de cluster ou modifiez la configuration de l&apos;application ou des applications pour qu&apos;elles ne d&#233;finissent plus de r&#244;les d&apos;ex&#233;cution.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: Le manifeste de d&#233;ploiement de l&apos;&apos;application {0} de version {1} r&#233;pertorie le contenu dont le nom symbolique et la version sont identiques &#224; ceux de l&apos;&apos;application.
  </MsgText>
  <Explanation>
    Les applications, les bundles et les bundles composites partagent tous le m&#234;me espace de nom ; par cons&#233;quent, ils doivent &#234;tre associ&#233;s &#224; des identificateurs uniques dans l&apos;espace de nom. Lors de la validation du d&#233;ploiement de l&apos;application, l&apos;environnement d&apos;ex&#233;cution a d&#233;tect&#233; une r&#233;f&#233;rence &#224; un bundle dont le nom symbolique et la version sont identiques &#224; ceux de l&apos;application.
  </Explanation>
  <UserResponse>
    Corrigez le nom symbolique du bundle, du bundle composite ou de l&apos;application pour qu&apos;il n&apos;y ait plus de conflit dans l&apos;espace de nom.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: Impossible de r&#233;soudre l&apos;&apos;actif {0}. Impossible de satisfaire au d&#233;ploiement l&apos;&apos;attribut {1} dans une importation du package {2}.
  </MsgText>
  <Explanation>
    Pour les bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content d&apos;APPLICATION.MF, toutes les importations de packages doivent comporter des attributs pouvant &#234;tre satisfaits au d&#233;ploiement.
  </Explanation>
  <UserResponse>
    Changez le paquetage ou la configuration de l&apos;application de sorte que tous les bundles list&#233;s dans l&apos;en-t&#234;te Application-Content aient des importations de packages pouvant &#234;tre satisfaites au d&#233;ploiement.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Une erreur interne s&apos;&apos;est produite. Impossible de localiser les donn&#233;es de configuration n&#233;cessaires au d&#233;veloppement de {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Une exception s&apos;&apos;est produite pendant la mod&#233;lisation du bundle {0}: {1}
  </MsgText>
  <Explanation>
    L&apos;exception indiqu&#233;e s&apos;est produite lors de la mod&#233;lisation du bundle sp&#233;cifi&#233;.
  </Explanation>
  <UserResponse>
    Examinez l&apos;exception. Etudiez les d&#233;tails du probl&#232;me et corrigez celui-ci.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Une erreur interne s&apos;&apos;est produite. Impossible d&apos;&apos;obtenir le flot d&apos;&apos;entr&#233;e pour l&apos;&apos;entr&#233;e zip web.xml dans le fichier War {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: Aucun alias d&apos;&apos;authentification de programme d&apos;&apos;&#233;coute MDB correspondant au nom {0} n&apos;&apos;a &#233;t&#233; trouv&#233; sur la cible {1} pour la ressource utilis&#233;e par le bean {2} dans le bundle {3} de version {4}.
  </MsgText>
  <Explanation>
    L&apos;alias d&apos;authentification sp&#233;cifi&#233; n&apos;existe pas ou n&apos;est pas visible par cette application.
  </Explanation>
  <UserResponse>
    Configurez l&apos;alias d&apos;authentification requis ou, s&apos;il est d&#233;j&#224; configur&#233;, assurez-vous qu&apos;il est dans la port&#233;e correcte pour l&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: Impossible de r&#233;soudre l&apos;&apos;actif {0}. L&apos;&apos;actif requiert le bundle {1} qui ne figure pas dans l&apos;&apos;en-t&#234;te Application-Content du manifeste d&apos;&apos;application APPLICATION.MF. Ce bundle utilise le service {2} provenant du bundle {3} qui, lui, figure dans l&apos;&apos;en-t&#234;te Application-Content.
  </MsgText>
  <Explanation>
    L&apos;application n&apos;est pas correctement configur&#233;e. Un bundle partag&#233; ne peut utiliser de service &#224; partir d&apos;un bundle isol&#233;. Les bundles qui sont r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content sont isol&#233;s et ne peuvent exporter de services aux autres applications que via le m&#233;canisme Application-ExportService.
  </Explanation>
  <UserResponse>
    Changez le paquetage ou la configuration de l&apos;application de sorte que les bundles qui sont soit list&#233;s dans l&apos;en-t&#234;te Use-Bundle, soit ajout&#233;s par le solveur ne requi&#232;rent pas de services fournis par les bundles figurant dans l&apos;en-t&#234;te Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: L&apos;&apos;actif {0} requiert des t&#233;l&#233;chargements externes en vue de son d&#233;ploiement dans une unit&#233; de composition.
  </MsgText>
  <Explanation>
    L&apos;actif nouveau ou mis &#224; jour requiert le t&#233;l&#233;chargement d&apos;un ou de plusieurs bundles &#224; partir d&apos;un r&#233;f&#233;rentiel pour pouvoir &#234;tre ajout&#233; &#224; une unit&#233; de composition ou mis &#224; jour dans une unit&#233; de composition.
  </Explanation>
  <UserResponse>
    Pour d&#233;marrer le processus de t&#233;l&#233;chargement des bundles, sauvegardez vos modifications dans la configuration principale. Vous pouvez voir o&#249; en est le t&#233;l&#233;chargement dans le panneau de d&#233;tails de l&apos;actif sur la console d&apos;administration. Une fois le t&#233;l&#233;chargement des bundles termin&#233;, tentez &#224; nouveau d&apos;ajouter ou de mettre &#224; jour l&apos;actif dans une unit&#233; de composition.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: La conversion en fichier WAB du fichier WAR {0} pr&#233;sent dans le fichier EBA {1} n&apos;&apos;a pas r&#233;ussi.
  </MsgText>
  <Explanation>
    Les fichiers WAR pr&#233;sents dans une archive EBA doivent &#234;tre convertis en bundles d&apos;applications Web (WAB) avant de pouvoir &#234;tre d&#233;ploy&#233;s. La conversion a &#233;chou&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; du fichier WAR.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Une erreur interne s&apos;est produite. Le service RepositoryAdminSupport n&apos;est pas disponible depuis le registre des services OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: L&apos;&apos;alias d&apos;&apos;authentification  {0} n&apos;&apos;existe pas dans le domaine de s&#233;curit&#233; {2} de la cible {1}.
  </MsgText>
  <Explanation>
    Il doit exister un alias d&apos;authentification dans le domaine de s&#233;curit&#233; global ou dans celui de la cible lorsque des r&#233;f&#233;rences &#224; des ressources Blueprint sont li&#233;es.
  </Explanation>
  <UserResponse>
    S&#233;lectionnez un alias d&apos;authentification qui existe dans le domaine de s&#233;curit&#233; global ou dans celui de la cible, ou cr&#233;ez-en un qui convienne.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: Un membre de cluster ne peut pas &#234;tre cr&#233;&#233; sur le noeud {0} car l&apos;&apos;application ou les applications OSGi {1} contiennent des archives de bundle composite (CBA) dans l&apos;&apos;en-t&#234;te Application-Content.
  </MsgText>
  <Explanation>
    Le nouveau membre de cluster ne peut pas prendre en charge des applications OSGi si leur en-t&#234;te Application-Content contient des archives de bundle composite (CBA) alors que tous les membres de cluster doivent pouvoir ex&#233;cuter les m&#234;mes applications.
  </Explanation>
  <UserResponse>
    S&#233;lectionnez un noeud de version 8 pour h&#233;berger le membre de cluster ou modifiez l&apos;application ou les applications pour que leur en-t&#234;te Application-Content ne comporte plus d&apos;archive de bundle composite (CBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: L&apos;&apos;unit&#233; de composition {0} ne correspond pas &#224; une application OSGi.
  </MsgText>
  <Explanation>
    L&apos;op&#233;ration appel&#233;e agit sur une unit&#233; de composition d&apos;une application OSGi. L&apos;unit&#233; de composition s&#233;lectionn&#233;e ne contient pas d&apos;application OSGi.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que l&apos;unit&#233; de composition s&#233;lectionn&#233;e est soutenue par un actif dont le type est &quot;EBA,version=1.0&quot;.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Une erreur interne s&apos;&apos;est produite. Impossible d&apos;&apos;extraire de l&apos;&apos;actif binaire {0} le manifeste de d&#233;ploiement.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Une erreur interne s&apos;est produite. Le service ModelledResourceManager n&apos;est pas disponible depuis le registre des services OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Une erreur interne s&apos;&apos;est produite. Le bundle CBA {0} de version {1} ne peut pas &#234;tre mod&#233;lis&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: Le fichier descripteur de l&apos;&apos;application Java EE est introuvable dans le fichier EBA {0}. Sans ce fichier descripteur, les racines de contexte des fichiers WAR sont d&#233;finies sur leurs valeurs par d&#233;faut.
  </MsgText>
  <Explanation>
    Le syst&#232;me a trait&#233; un fichier d&apos;archive Web (WAR) sans le fichier descripteur d&apos;application qui lui est associ&#233; (application.xml), lequel d&#233;finit les racines de contexte. Les racines de contexte du fichier WAR migr&#233; prendront leurs valeurs par d&#233;faut.
  </Explanation>
  <UserResponse>
    Si un fichier descripteur d&apos;application est requis, v&#233;rifiez que ce fichier est bien fourni et qu&apos;il est correctement empaquet&#233; dans le fichier EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Impossible de traiter le fichier manifeste de d&#233;ploiement fourni par l&apos;&apos;application &#224; partir de l&apos;&apos;emplacement {0}.
  </MsgText>
  <Explanation>
    L&apos;importation d&apos;un fichier EBA contenant un fichier manifeste de d&#233;ploiement a &#233;t&#233; tent&#233;e. Le traitement de ce fichier a &#233;chou&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le serveur d&apos;applications dispose des droits d&apos;acc&#232;s au fichier et que le fichier n&apos;est pas endommag&#233;. N&apos;&#233;ditez pas manuellement le manifeste de d&#233;ploiement. Si n&#233;cessaire, supprimez le manifeste de d&#233;ploiement du fichier EBA. Ainsi, un nouveau fichier manifeste de d&#233;ploiement est g&#233;n&#233;r&#233; &#224; l&apos;importation du fichier EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Une erreur interne s&apos;&apos;est produite. Le service {0} n&apos;&apos;est pas disponible &#224; partir du registre des services OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: Impossible de cr&#233;er le r&#233;pertoire {0}.
  </MsgText>
  <Explanation>
    Le r&#233;pertoire sp&#233;cifi&#233; ne peut pas &#234;tre cr&#233;&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;espace de stockage. V&#233;rifiez &#233;galement que le produit dispose bien des autorisations n&#233;cessaires pour cr&#233;er le r&#233;pertoire.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Une erreur interne s&apos;&apos;est produite. Le module {0} &#233;tait d&apos;&apos;un type inattendu.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: L&apos;&apos;installation du fichier EBA {0} a g&#233;n&#233;r&#233; des erreurs.
  </MsgText>
  <Explanation>
    La validation et l&apos;installation du fichier EBA (archive de bundle d&apos;entreprise) se sont termin&#233;es avec des erreurs.
  </Explanation>
  <UserResponse>
    Pour plus d&apos;informations, reportez-vous aux messages d&apos;erreur dans le fichier SystemOut.log.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Aucune liaison par d&#233;faut n&apos;&apos;a pu &#234;tre cr&#233;&#233;e pour la r&#233;f&#233;rence EJB {0} dans le bundle {1} de version {2} avec l&apos;&apos;interface {3}, car aucun EJB correspondant n&apos;&apos;existe dans l&apos;&apos;application.
  </MsgText>
  <Explanation>
    Des liaisons par d&#233;faut doivent &#234;tre cr&#233;&#233;es pour les r&#233;f&#233;rences EJB non li&#233;es. Aucun EJB auquel cette r&#233;f&#233;rence puisse &#234;tre li&#233;e n&apos;a &#233;t&#233; trouv&#233;.
  </Explanation>
  <UserResponse>
    Liez la r&#233;f&#233;rence &#224; un emplacement JNDI connu ou corrigez l&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Une erreur interne s&apos;&apos;est produite. Impossible de trouver l&apos;&apos;objet d&apos;&apos;actif de configuration pour l&apos;&apos;actif {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: Impossible de trouver la r&#233;f&#233;rence de ressource dont le nom JNDI est {0} et le type est {1} sur la cible {2} pour la r&#233;f&#233;rence de ressource EJB {3} d&#233;finie dans le bundle {4} de version {5}.
  </MsgText>
  <Explanation>
    Une archive EBA qui inclut des r&#233;f&#233;rences de ressources dans un module EJB sp&#233;cifie pour une r&#233;f&#233;rence de ressource un nom JNDI qui n&apos;existe pas dans l&apos;espace de noms JNDI.
  </Explanation>
  <UserResponse>
    Si la r&#233;f&#233;rence doit se trouver dans l&apos;espace de noms JNDI, liez un objet au nom ou corrigez la r&#233;f&#233;rence et mettez &#224; jour l&apos;archive EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: L&apos;&apos;application OSGi d&#233;ploy&#233;e dans l&apos;&apos;unit&#233; de composition {0} de l&apos;&apos;application de niveau m&#233;tier {1} ne s&apos;&apos;est pas arr&#234;t&#233;e.
  </MsgText>
  <Explanation>
    Une exception est survenue lors de l&apos;op&#233;ration d&apos;arr&#234;t.
  </Explanation>
  <UserResponse>
    Consultez les journaux du serveur ant&#233;rieurs &#224; cette exception pour un diagnostic plus pr&#233;cis du probl&#232;me.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: Le r&#244;le {0} n&apos;&apos;est pas valide.
  </MsgText>
  <Explanation>
    Le r&#244;le sp&#233;cifi&#233; n&apos;a pas &#233;t&#233; configur&#233;.
  </Explanation>
  <UserResponse>
    Configurez le r&#244;le sp&#233;cifi&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: Le membre de cluster {0} n&apos;&apos;est pas augment&#233; avec les fonctions {2} requises par l&apos;&apos;application OSGi {1}.
  </MsgText>
  <Explanation>
    Pour qu&apos;une application OSGi puisse &#234;tre install&#233;e sur un cluster, chaque membre de cluster doit disposer de toutes les fonctions requises de l&apos;application. Si vous ajoutez un nouveau membre de cluster, ce dernier doit &#233;galement disposer de toutes les fonctions requises par les applications OSGi qui sont install&#233;es sur le cluster.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le membre de cluster propos&#233; dispose de toutes les fonctions requises pour les applications OSGi r&#233;pertori&#233;es dans le message d&apos;erreur.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: Impossible de cr&#233;er le r&#233;pertoire {0}.
  </MsgText>
  <Explanation>
    Le r&#233;pertoire sp&#233;cifi&#233; ne peut pas &#234;tre cr&#233;&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;espace de stockage. V&#233;rifiez &#233;galement que le produit dispose bien des autorisations n&#233;cessaires pour cr&#233;er le r&#233;pertoire.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: Le contenu du manifeste de d&#233;ploiement n&apos;&apos;est pas correct. Les bundles suivants sont redondants : {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement &#224; importer comporte des bundles qui ne sont pas n&#233;cessaires &#224; la r&#233;solution de l&apos;actif EBA.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le nouveau manifeste de d&#233;ploiement, DEPLOYMENT.MF, ne comprend pas les bundles &#233;num&#233;r&#233;s dans le message de l&apos;exception. N&apos;&#233;ditez pas manuellement le manifeste de d&#233;ploiement. Si n&#233;cessaire, supprimez le manifeste de d&#233;ploiement du fichier EBA. Ainsi, un nouveau fichier manifeste de d&#233;ploiement sera g&#233;n&#233;r&#233; &#224; l&apos;importation du fichier EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: Le groupe {0} sp&#233;cifi&#233; n&apos;&apos;est pas valide.
  </MsgText>
  <Explanation>
    Tentative de mapper un r&#244;le de s&#233;curit&#233; avec un groupe non valide.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;existence du groupe sp&#233;cifi&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Une erreur interne s&apos;est produite. Le service admin n&apos;a pas &#233;t&#233; enregistr&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Une extension de l&apos;&apos;unit&#233; de composition {0} requiert des t&#233;l&#233;chargements externes.
  </MsgText>
  <Explanation>
    Vous avez cr&#233;&#233; ou mis &#224; jour une archive de bundle composite (CBA) en vue de son utilisation en tant qu&apos;extension d&apos;une unit&#233; de composition. Pour que vous puissiez ajouter l&apos;extension &#224; l&apos;unit&#233; de composition, il est n&#233;cessaire de t&#233;l&#233;charger un ou plusieurs bundles &#224; partir d&apos;un r&#233;f&#233;rentiel.
  </Explanation>
  <UserResponse>
    Pour d&#233;marrer le t&#233;l&#233;chargement, sauvegardez les modifications apport&#233;es &#224; la configuration principale.  Vous pouvez afficher l&apos;&#233;tat du t&#233;l&#233;chargement du bundle &#224; partir du panneau des d&#233;tails de l&apos;unit&#233; de composition dans la console d&apos;administration. Attendez la fin du t&#233;l&#233;chargement du bundle puis ajoutez l&apos;extension &#224; l&apos;unit&#233; de composition.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: La fonction {0} n&apos;&apos;est d&#233;ploy&#233;e pour l&apos;&apos;actif {1} sur aucun des serveurs ou des clusters.
  </MsgText>
  <Explanation>
    La fonctionnalit&#233; requise est introuvable sur tous les serveurs.
  </Explanation>
  <UserResponse>
    Installez la fonctionnalit&#233; requise sur au moins l&apos;un des serveurs.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Une erreur interne s&apos;&apos;est produite. Il manque dans le fichier EBA  {0} les bundles suivants : {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: Impossible d&apos;&apos;ajouter l&apos;&apos;actif {0} &#224; cette application de niveau m&#233;tier car il a d&#233;j&#224; &#233;t&#233; ajout&#233; &#224; l&apos;&apos;application de niveau m&#233;tier : {1}
  </MsgText>
  <Explanation>
    Une archive EBA ne peut se trouver que dans une seule application BLA.
  </Explanation>
  <UserResponse>
    Cr&#233;ez une nouvelle application qui aura le m&#234;me contenu tout en ayant un autre nom symbolique. Importez la nouvelle application en tant qu&apos;actif EBA, puis ajoutez-la &#224; cette BLA.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: La mise &#224; disposition de l&apos;&apos;application {0} a g&#233;n&#233;r&#233; des r&#233;sultats diff&#233;rents pour WebSphere Application Server version 8 et le module de fonctions des applications OSGi de WebSphere Application Server version 7. Les r&#233;sultats de la version 8 seront utilis&#233;s.
  </MsgText>
  <Explanation>
    L&apos;application import&#233;e a &#233;t&#233; mise &#224; disposition sur WebSphere Application Server version 8 et le module de fonctions des applications OSGi de WebSphere Application Server version 7. Toutefois, des r&#233;sultats diff&#233;rents ont &#233;t&#233; obtenus pour les deux op&#233;rations de mise &#224; disposition. Vous ne pouvez pas ex&#233;cuter une m&#234;me application avec des d&#233;ploiements diff&#233;rents.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1} a &#233;t&#233; affect&#233; au r&#233;pertoire {0}.
  </MsgText>
  <Explanation>
    Un actif d&apos;archive de bundle d&apos;entreprise (EBA) est ajout&#233; &#224; une unit&#233; de composition. Un r&#233;pertoire a &#233;t&#233; affect&#233; &#224; l&apos;application Web en vue de la configuration de l&apos;application Web contenue dans le fichier EBA.
  </Explanation>
  <UserResponse>
    Aucune
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Une erreur interne s&apos;&apos;est produite. Impossible de lire le manifeste d&apos;&apos;application ou de d&#233;ploiement du fichier EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Une erreur interne s&apos;&apos;est produite. L&apos;&apos;&#233;tape {0} est introuvable.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: L&apos;&apos;actif {0} contient un fichier JAR {1} qui n&apos;&apos;est pas un bundle et qui ne sera pas converti. Si d&apos;&apos;autres parties de l&apos;&apos;application d&#233;pendent de ce fichier, l&apos;&apos;ex&#233;cution de l&apos;&apos;application &#233;chouera.
  </MsgText>
  <Explanation>
    La conversion des fichiers JAR d&apos;utilitaires et d&apos;EJB n&apos;est pas prise en charge.
  </Explanation>
  <UserResponse>
    V&#233;rifiez qu&apos;aucun bundle et qu&apos;aucun bundle WAB ne d&#233;pendent des classes du fichier JAR. Pour &#233;viter le message d&apos;avertissement, retirez le fichier JAR de l&apos;archive EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Une erreur interne s&apos;&apos;est produite. Impossible de lire le manifeste d&apos;&apos;application ou de d&#233;ploiement du fichier EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: L&apos;&apos;interface EJB {0} de l&apos;&apos;EJB {1} dans le bundle {2} de version {3} ne peut pas &#234;tre li&#233;e &#224; l&apos;&apos;emplacement {4}. Les interfaces EJB accessibles localement doivent &#234;tre li&#233;es dans l&apos;&apos;espace de nom ejblocal:.
  </MsgText>
  <Explanation>
    Les vues &quot;Locale&quot;, &quot;Sans interface&quot; et &quot;Home locale&quot; d&apos;un EJB ne peuvent &#234;tre li&#233;es que dans un espace JNDI accessible localement. Cela signifie que leur nom de liaison doit commencer par &quot;ejblocal:&quot;.
  </Explanation>
  <UserResponse>
    Ajustez les noms de liaison des vues des EJB accessibles localement de sorte qu&apos;ils utilisent le pr&#233;fixe d&apos;espace de nom ejblocal:.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: CompUnitStatusStep indique que l&apos;&apos;unit&#233; de composition {0} doit &#234;tre mise &#224; niveau vers la version de d&#233;ploiement la plus r&#233;cente disponible &#224; partir de l&apos;&apos;actif {1}. Toutefois, l&apos;&apos;unit&#233; de composition {0} est d&#233;j&#224; &#224; jour.
  </MsgText>
  <Explanation>
    Pour que l&apos;actif d&#233;ploy&#233; dans une unit&#233; de composition puisse &#234;tre mis &#224; niveau, une version &#224; jour de l&apos;actif doit &#234;tre disponible et le t&#233;l&#233;chargement de tous les bundles requis par l&apos;actif mis &#224; jour doit &#234;tre termin&#233;.
  </Explanation>
  <UserResponse>
    D&#233;terminez si une version plus r&#233;cente de l&apos;actif est disponible et v&#233;rifiez que tous les t&#233;l&#233;chargements de bundle sont termin&#233;s pour l&apos;actif.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Une erreur interne s&apos;&apos;est produite. Impossible d&apos;&apos;obtenir l&apos;&apos;unit&#233; de composition pour l&apos;&apos;actif {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: Un membre de cluster ne peut pas &#234;tre cr&#233;&#233; sur le noeud {0} car l&apos;&apos;application ou les applications OSGi {1} ont &#233;t&#233; &#233;tendues.
  </MsgText>
  <Explanation>
    Le nouveau membre de cluster ne peut pas prendre en charge les extensions d&apos;application OSGi alors que tous les membres de cluster doivent pouvoir ex&#233;cuter les m&#234;mes applications.
  </Explanation>
  <UserResponse>
    S&#233;lectionnez un noeud de version 8 pour h&#233;berger le membre de cluster ou supprimez l&apos;extension ou les extensions de l&apos;application ou des applications pour qu&apos;elles puissent &#234;tre ex&#233;cut&#233;es sur le noeud s&#233;lectionn&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: Le bundle {0} dans l&apos;&apos;unit&#233; de composition {1} n&apos;&apos;a pas pu &#234;tre mis &#224; jour car une extension est en conflit avec le m&#234;me nom symbolique.
  </MsgText>
  <Explanation>
    Il n&apos;est pas possible de mettre &#224; jour un bundle CBA &#224; la version demand&#233;e car il existe d&#233;j&#224; une extension avec le m&#234;me nom symbolique dans cette version.
  </Explanation>
  <UserResponse>
    Supprimez l&apos;extension ou modifiez la version de bundle que vous tentez de mettre &#224; jour.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: Aucune sp&#233;cification d&apos;&apos;activation MDB correspondant au nom JNDI {0} n&apos;&apos;a &#233;t&#233; trouv&#233;e sur la cible {1} pour la ressource utilis&#233;e par le bean {2} dans le bundle {3} de version {4}.
  </MsgText>
  <Explanation>
    Le nom JNDI sp&#233;cifi&#233; comme r&#233;f&#233;rence de la sp&#233;cification d&apos;activation de liaison de programme d&apos;&#233;coute MDB n&apos;existe pas.
  </Explanation>
  <UserResponse>
    Si la r&#233;f&#233;rence doit se trouver dans l&apos;espace de noms JNDI, liez un objet au nom ou corrigez la r&#233;f&#233;rence et mettez &#224; jour l&apos;archive EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Une erreur interne s&apos;&apos;est produite. Le contenu de l&apos;&apos;actif {0} n&apos;&apos;a pas pu &#234;tre interrog&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: L&apos;&apos;application {0} inclut un bundle composite {1} dans son contenu d&apos;&apos;application. Ce cas n&apos;&apos;est pas pris en charge.
  </MsgText>
  <Explanation>
    Vous ne pouvez pas utiliser l&apos;en-t&#234;te Application-Content pour inclure directement des archives de bundle composite dans un fichier EBA.
  </Explanation>
  <UserResponse>
    Supprimez le bundle composite du contenu d&apos;application. Vous pouvez inclure les bundles individuels dans l&apos;en-t&#234;te Application-Content ou installer le bundle composite dans un r&#233;f&#233;rentiel de bundles pour le partage.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Une erreur interne s&apos;&apos;est produite. Un fichier avec le bon nom existe bien dans le cache mais il ne contient pas le bundle attendu {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: Impossible de trouver la r&#233;f&#233;rence de destination de message ou la r&#233;f&#233;rence d&apos;&apos;environnement de ressource dont le nom JNDI est {0} et le type est {1} sur la cible {2} pour la r&#233;f&#233;rence de destination de message ou d&apos;&apos;environnement de ressource EJB {3} d&#233;finie dans le bundle {4} de version {5}.
  </MsgText>
  <Explanation>
    Une archive EBA qui inclut des r&#233;f&#233;rences de destination de message ou d&apos;environnement de ressource dans un module EJB sp&#233;cifie, pour l&apos;une de ces r&#233;f&#233;rences, un nom JNDI qui n&apos;existe pas dans l&apos;espace de noms JNDI.
  </Explanation>
  <UserResponse>
    Si la r&#233;f&#233;rence doit se trouver dans l&apos;espace de noms JNDI, liez un objet au nom ou corrigez la r&#233;f&#233;rence et mettez &#224; jour l&apos;archive EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: L&apos;&apos;application OSGi {0} n&apos;&apos;est pas valide car son nom symbolique contient deux points cons&#233;cutifs.
  </MsgText>
  <Explanation>
    Le nom symbolique d&apos;une application OSGi ne peut pas contenir la cha&#238;ne &quot;..&quot;, c&apos;est-&#224;-dire deux points cons&#233;cutifs.
  </Explanation>
  <UserResponse>
    Changez le nom symbolique de l&apos;application OSGi.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: Impossible de lire le fichier EBA {0}.
  </MsgText>
  <Explanation>
    Une exception d&apos;entr&#233;es/sorties s&apos;est produite lors de la lecture d&apos;un fichier EBA. Le fichier est peut-&#234;tre endommag&#233; ou illisible.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le fichier dispose des autorisations appropri&#233;es et qu&apos;il est dans le bon format.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Une erreur interne s&apos;est produite. Le bean g&#233;r&#233; SecurityAdmin n&apos;a pas &#233;t&#233; enregistr&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: Des r&#233;f&#233;rences de service dans le contenu de l&apos;&apos;archive de bundle composite (CBA) {0} ne peuvent pas &#234;tre r&#233;solues. Si ces services sont mis &#224; disposition par des bundles qui ne sont pas inclus dans l&apos;&apos;archive de bundle composite (CBA), cette derni&#232;re doit les importer. Les d&#233;pendances de service suivantes n&apos;&apos;ont pas &#233;t&#233; r&#233;solues : {1}
  </MsgText>
  <Explanation>
    Si un bundle d&apos;une archive de bundle composite (CBA) utilise un service qui ne se trouve pas dans le bundle ou qui est export&#233; par un autre bundle au sein de l&apos;archive de bundle composite (CBA), l&apos;archive de bundle composite (CBA) doit importer le service.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste du composite, COMPOSITEBUNDLE.MF, pour que l&apos;archive de bundle composite (CBA) importe les services qui sont utilis&#233;s par les bundles de l&apos;archive de bundle composite et qui ne sont pas disponibles autrement au sein de l&apos;archive de bundle composite (CBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: Impossible d&apos;&apos;&#233;crire le fichier EBA migr&#233; {0}.
  </MsgText>
  <Explanation>
    Une exception d&apos;entr&#233;es/sorties s&apos;est produite lors de l&apos;&#233;criture d&apos;un fichier EBA migr&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le produit dispose des autorisations n&#233;cessaires pour pouvoir &#233;crire dans le r&#233;pertoire concern&#233;. V&#233;rifiez &#233;galement que le fichier cible n&apos;est pas verrouill&#233; et que l&apos;espace de stockage est suffisant.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: L&apos;&apos;application {0} n&apos;&apos;a pas pu &#234;tre mise &#224; disposition pour tous les noeuds de la cellule. Elle ne peut &#234;tre d&#233;ploy&#233;e que sur les noeuds de version 8. Erreur de r&#233;solution : {1}.
  </MsgText>
  <Explanation>
    L&apos;application import&#233;e a &#233;t&#233; mise &#224; disposition sur WebSphere Application Server version 8 mais n&apos;a pas pu &#234;tre mise &#224; disposition dans le module de fonctions des applications OSGi sur WebSphere Application Server version 7.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise. Toutefois, vous pouvez utiliser les informations mentionn&#233;es dans l&apos;erreur de r&#233;solution pour modifier l&apos;application afin qu&apos;elle puisse &#234;tre d&#233;ploy&#233;e dans le module de fonctions des applications OSGi de WebSphere Application Server version 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Utilisation de localhost comme nom d&apos;&apos;h&#244;te pour le transport pour le serveur {0}. {1}. L&apos;&apos;acheminement des demandes fonctionnera si le serveur Web et le serveur d&apos;&apos;applications sont sur le m&#234;me noeud.
  </MsgText>
  <Explanation>
    Le nom d&apos;h&#244;te du serveur d&apos;applications sp&#233;cifi&#233; dans le transport a &#233;t&#233; r&#233;solu en localhost.
  </Explanation>
  <UserResponse>
    Si le serveur Web et le serveur d&apos;applications se trouvent sur des noeuds diff&#233;rents, identifiez la raison pour laquelle le nom d&apos;h&#244;te du serveur d&apos;applications a &#233;t&#233; r&#233;solu en localhost.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: Le fichier EBA {0} ne peut pas &#234;tre install&#233;. L&apos;&apos;&#233;l&#233;ment Application-SymbolicName {1} du fichier EBA est d&#233;j&#224; utilis&#233; par l&apos;&apos;actif {2}.
  </MsgText>
  <Explanation>
    Vous tentez d&apos;installer un fichier EBA alors qu&apos;un actif existant porte le m&#234;me nom symbolique.
  </Explanation>
  <UserResponse>
    Changez le nom symbolique du fichier EBA que vous installez ou d&#233;sinstallez l&apos;actif existant.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: Un membre de cluster ne peut pas &#234;tre cr&#233;&#233; sur le noeud {0} car l&apos;&apos;application ou les applications OSGi {1} ne peuvent pas &#234;tre mises &#224; disposition sur ce noeud. Erreur de r&#233;solution : {2}.
  </MsgText>
  <Explanation>
    Le nouveau membre de cluster ne peut pas ex&#233;cuter les applications OSGi indiqu&#233;es alors que tous les membres de cluster doivent pouvoir ex&#233;cuter les m&#234;mes applications.
  </Explanation>
  <UserResponse>
    S&#233;lectionnez un autre noeud compatible pour h&#233;berger le membre de cluster ou modifiez les applications pour qu&apos;elles puissent &#234;tre ex&#233;cut&#233;es sur le noeud s&#233;lectionn&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: Impossible d&apos;&apos;analyser le fichier {0} pour le fichier EBA (archive de bundle d&apos;&apos;entreprise) {1}.
  </MsgText>
  <Explanation>
    Le fichier sp&#233;cifi&#233; n&apos;a pu &#234;tre analys&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez le format du fichier et que ce dernier n&apos;est pas endommag&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Une erreur interne s&apos;&apos;est produite. Impossible de lire le manifeste d&apos;&apos;application ou de d&#233;ploiement du fichier EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: Impossible de cr&#233;er le fichier : {0}
  </MsgText>
  <Explanation>
    Un incident est survenu lors de la cr&#233;ation du nom de chemin requis lors de l&apos;exportation de l&apos;actif.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le serveur d&apos;applications dispose des droits requis pour la cr&#233;ation de ce nom de chemin.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: La commande UpdateAppContentVersionStep dans WAS V7 a &#233;t&#233; remplac&#233;e par la commande UpdateAppContentVersions dans WAS V8.
  </MsgText>
  <Explanation>
    La commande WAS V7 UpdateAppContentVersionStep  a &#233;t&#233; remplac&#233;e par la commande  UpdateAppContentVersions dans WAS V8. Consultez le centre de documentation pour plus d&apos;informations.
  </Explanation>
  <UserResponse>
    Modifiez le script de sorte &#224; utiliser la commande UpdateAppContentVersions.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Une erreur interne s&apos;&apos;est produite. Le fichier EBA {0}, une fois r&#233;solu, ne comporte pas de contenu d&#233;ployable.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: Impossible de r&#233;soudre le fichier EBA. Exception : {0}.
  </MsgText>
  <Explanation>
    Le syst&#232;me n&apos;arrive pas &#224; r&#233;soudre les emplacements, dans les versions appropri&#233;es, des bundles d&apos;applications constitutifs du fichier EBA.
  </Explanation>
  <UserResponse>
    Consultez l&apos;exception pour plus d&apos;explications.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Une erreur interne s&apos;&apos;est produite. Impossible de r&#233;soudre le fichier EBA {0} car le service {1} n&apos;&apos;est pas disponible.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: L&apos;&apos;utilisateur {0} sp&#233;cifi&#233; n&apos;&apos;est pas valide.
  </MsgText>
  <Explanation>
    Tentative de mapper un r&#244;le de s&#233;curit&#233; avec un utilisateur non valide.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;existence de l&apos;utilisateur sp&#233;cifi&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Une erreur interne s&apos;&apos;est produite. Aucun MBean n&apos;&apos;a &#233;t&#233; trouv&#233; pour BundleCacheManager pour le profil {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: La liaison {0} pour la r&#233;f&#233;rence EJB {1} dans le bundle {2} de version {3} avec l&apos;&apos;interface {4} risque d&apos;&apos;entra&#238;ner un fonctionnement incorrect de l&apos;&apos;application apr&#232;s une mise &#224; jour.
  </MsgText>
  <Explanation>
    Les parties constituantes des r&#233;f&#233;rences de consultation java:global/nom_application/nom_module/nom_ejb ou java:app/nom_module/nom_ejb peuvent changer apr&#232;s la mise &#224; jour d&apos;une application OSGi. Les r&#233;f&#233;rences doivent &#234;tre modifi&#233;es en cons&#233;quences, ce qui rend cette approche peu pratique.
  </Explanation>
  <UserResponse>
    Utilisez les services OSGi pour configurer les d&#233;pendances EJB, ou alors d&#233;clarez une r&#233;f&#233;rence d&apos;EJB et mappez-la au nom JNDI de l&apos;EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Impossible de d&#233;velopper le fichier d&apos;&apos;archive de bundle d&apos;&apos;entreprise (EBA) {0} ; impossible de cr&#233;er le r&#233;pertoire {1}.
  </MsgText>
  <Explanation>
    Lors de la tentative de d&#233;veloppement du fichier EBA sp&#233;cifi&#233;, un r&#233;pertoire requis n&apos;a pas pu &#234;tre cr&#233;&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le serveur d&apos;applications dispose des droits requis pour la cr&#233;ation du r&#233;pertoire sp&#233;cifi&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: Impossible de r&#233;soudre l&apos;&apos;actif {0}. L&apos;&apos;actif requiert des versions incompatibles sur les packages suivants : {1}.
  </MsgText>
  <Explanation>
    Pour les bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content d&apos;APPLICATION.MF, toutes les importations d&apos;un m&#234;me package doivent requ&#233;rir des versions compatibles.
  </Explanation>
  <UserResponse>
    Changez le paquetage ou la configuration de l&apos;application de sorte que tous les bundles list&#233;s dans l&apos;en-t&#234;te Application-Content requi&#232;rent des versions de packages compatibles.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Les r&#244;les d&apos;ex&#233;cution ne peuvent pas &#234;tre configur&#233;s pour des noeuds avant WebSphere Application Server version 8. Toute configuration sera ignor&#233;e.
  </MsgText>
  <Explanation>
    Les r&#244;les d&apos;ex&#233;cution ne peuvent &#234;tre configur&#233;s que pour WebSphere Application Server versions 8 et ult&#233;rieures. Ils ne peuvent pas &#234;tre configur&#233;s pour une unit&#233; de composition qui est d&#233;ploy&#233;e sur des cibles du module de fonctions des applications OSGi de WebSphere Application Server version 7.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise. Si des r&#244;les d&apos;ex&#233;cution doivent &#234;tre configur&#233;s, supprimez tout mappage de cible pour les noeuds du module de fonctions des applications OSGi de WebSphere Application Server version 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: L&apos;ID utilisateur ou le mot de passe est incorrect.
  </MsgText>
  <Explanation>
    Un ID utilisateur ou un mot de passe incorrect a &#233;t&#233; sp&#233;cifi&#233;.
  </Explanation>
  <UserResponse>
    Renouvelez l&apos;op&#233;ration en utilisant l&apos;ID utilisateur et le mot de passe correct.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: L&apos;&apos;op&#233;ration de mise &#224; jour a &#233;chou&#233; pour l&apos;&apos;application OSGi d&#233;ploy&#233;e dans l&apos;&apos;unit&#233; de composition {0} de l&apos;&apos;application de niveau m&#233;tier {1}.
  </MsgText>
  <Explanation>
    Une exception est survenue lors de l&apos;op&#233;ration de mise &#224; jour.
  </Explanation>
  <UserResponse>
    Consultez les journaux du serveur ant&#233;rieurs &#224; cette exception pour un diagnostic plus pr&#233;cis du probl&#232;me.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Une erreur interne s&apos;&apos;est produite. L&apos;&apos;entr&#233;e Application-Content du manifeste d&apos;&apos;application dans le fichier EBA {0} &#233;tant vide, aucun bundle ne sera install&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: Impossible de lire le fichier descripteur de l&apos;&apos;application Java EE dans le fichier EBA {0}.
  </MsgText>
  <Explanation>
    Une exception d&apos;entr&#233;es/sorties s&apos;est produite lors de la lecture d&apos;un fichier descripteur d&apos;application Java EE dans un fichier EBA.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le fichier descripteur de l&apos;application n&apos;est pas endommag&#233;, qu&apos;il est lisible et qu&apos;il dispose des autorisations appropri&#233;es.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: Impossible de trouver la r&#233;f&#233;rence de ressource dont le nom JNDI est {0} et le type est {1} sur la cible {2} pour la r&#233;f&#233;rence de ressource de module Web {3} d&#233;finie dans le bundle {4} de version {5}.
  </MsgText>
  <Explanation>
    Une archive EBA qui inclut des r&#233;f&#233;rences de ressources dans une archive WAR sp&#233;cifie pour une r&#233;f&#233;rence de ressource un nom JNDI qui n&apos;existe pas dans l&apos;espace de noms JNDI.
  </Explanation>
  <UserResponse>
    Si la r&#233;f&#233;rence doit se trouver dans l&apos;espace de noms JNDI, liez un objet &#224; ce nom ou corrigez la r&#233;f&#233;rence et mettez &#224; jour l&apos;EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Aucune liaison par d&#233;faut n&apos;&apos;a pu &#234;tre cr&#233;&#233;e pour la r&#233;f&#233;rence EJB {0} dans le bundle {1} de version {2} avec l&apos;&apos;interface {3}, car il existe plusieurs liaisons possibles. La r&#233;f&#233;rence pourrait &#234;tre li&#233;e &#224; n&apos;&apos;importe lequel des EJB suivants : {4}.
  </MsgText>
  <Explanation>
    Des liaisons par d&#233;faut doivent &#234;tre cr&#233;&#233;es pour les r&#233;f&#233;rences EJB non li&#233;es. Plusieurs EJB auxquels cette r&#233;f&#233;rence pourrait &#234;tre li&#233;e ont &#233;t&#233; trouv&#233;s.
  </Explanation>
  <UserResponse>
    Liez la r&#233;f&#233;rence &#224; un EJB pr&#233;cis ou corrigez l&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: L&apos;&apos;alias d&apos;&apos;authentification {0} est configur&#233; de mani&#232;re erron&#233;e. Il n&apos;&apos;est pas autoris&#233; de lier &#224; des r&#233;f&#233;rences un alias d&apos;&apos;authentification de type Application.
  </MsgText>
  <Explanation>
    Les alias d&apos;authentification de type Application ne peuvent &#234;tre li&#233;s &#224; des r&#233;f&#233;rences de ressources Blueprint.
  </Explanation>
  <UserResponse>
    Supprimez l&apos;alias d&apos;authentification de la r&#233;f&#233;rence concern&#233;e.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: L&apos;&apos;h&#244;te virtuel {0} sp&#233;cifi&#233; pour le bundle {1} n&apos;&apos;existe pas.
  </MsgText>
  <Explanation>
    Tentative de mapper un bundle d&apos;applications Web (WAB) &#224; un h&#244;te virtuel qui n&apos;est pas valide.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;existence de l&apos;h&#244;te virtuel sp&#233;cifi&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: Le manifeste d&apos;&apos;application du fichier EBA {0} r&#233;pertorie dans son en-t&#234;te Application-Content des bundles qui figurent &#233;galement dans l&apos;&apos;en-t&#234;te Use-Bundle.
  </MsgText>
  <Explanation>
    Les noms de bundles qui sont r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content d&apos;APPLICATION.MF ne peuvent pas figurer &#233;galement dans l&apos;en-t&#234;te Use-Bundle, quelles que soient les versions des bundles.
  </Explanation>
  <UserResponse>
    Changez le paquetage de l&apos;archive EBA de mani&#232;re que les noms des bundles ne figurent que dans un seul des deux en-t&#234;tes.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: L&apos;&apos;archive de bundle composite (CBA) {0} n&apos;&apos;est pas valide. Des packages import&#233;s par des bundles dans l&apos;&apos;archive CBA sont absents de l&apos;&apos;en-t&#234;te Import-Package du fichier manifeste CBA. Les probl&#232;mes suivants ont &#233;t&#233; signal&#233;s : {1}
  </MsgText>
  <Explanation>
    Si un bundle d&apos;une archive de bundle composite (CBA) utilise un package qui ne se trouve pas dans le bundle ou qui est export&#233; par un autre bundle au sein de l&apos;archive de bundle composite (CBA), l&apos;archive de bundle composite (CBA) doit importer le package.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste du composite, COMPOSITEBUNDLE.MF, pour que l&apos;archive de bundle composite (CBA) importe les packages qui sont utilis&#233;s par les bundles de l&apos;archive de bundle composite et qui ne sont pas disponibles autrement au sein de l&apos;archive de bundle composite (CBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: L&apos;&apos;EJB {0} dans le bundle {1} de version {2} comporte plusieurs mappages pour l&apos;&apos;interface {3} dans son fichier de liaisons. Les mappages &#233;taient {4} et {5}.
  </MsgText>
  <Explanation>
    Le fichier de liaisons EJB inclus dans le bundle contient des informations de configuration de mappages ambigu&#235;s pour une interface EJB.
  </Explanation>
  <UserResponse>
    Corrigez le fichier de liaisons de sorte qu&apos;il ne reste qu&apos;un seul mappage configur&#233; par interface EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: Aucune unit&#233; de composition dont le nom est {0} n&apos;&apos;a &#233;t&#233; trouv&#233;e dans la cellule courante.
  </MsgText>
  <Explanation>
    Le nom indiqu&#233; ne correspond &#224; aucun nom d&apos;unit&#233; de composition existant.
  </Explanation>
  <UserResponse>
    V&#233;rifiez le nom de l&apos;unit&#233; de composition.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: Le fichier EBA {0} contient un fichier MANIFEST.MF avec l&apos;&apos;en-t&#234;te Extension-List. La conversion de cet en-t&#234;te n&apos;&apos;est pas prise en charge.
  </MsgText>
  <Explanation>
    Vous tentez de convertir un fichier EAR vers un fichier EBA  alors que le fichier EAR contient un fichier MANIFEST.MF avec l&apos;en-t&#234;te Extension-List et que la conversion de cet en-t&#234;te n&apos;est pas prise en charge. Un fichier EAR utilise l&apos;en-t&#234;te Extension-List pour identifier les fichiers JAR externes requis lorsque l&apos;application s&apos;ex&#233;cute.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que les fichiers JAR externes r&#233;pertori&#233;s dans l&apos;en-t&#234;te Extension-List sont disponibles sous forme de bundles dans le r&#233;f&#233;rentiel des bundles.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: Impossible de r&#233;soudre l&apos;&apos;actif {0}. L&apos;&apos;actif requiert le bundle {1} qui ne figure pas dans l&apos;&apos;en-t&#234;te Application-Content du manifeste d&apos;&apos;application APPLICATION.MF. Ce bundle importe le package {2} &#224; partir du bundle {3} qui, lui, figure dans l&apos;&apos;en-t&#234;te Application-Content.
  </MsgText>
  <Explanation>
    L&apos;application n&apos;est pas correctement configur&#233;e. Un bundle partag&#233; ne peut importer de packages &#224; partir d&apos;un bundle isol&#233;. Les bundles qui sont r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content sont isol&#233;s et ne peuvent fournir de packages qu&apos;aux autres bundles figurant dans cet en-t&#234;te.
  </Explanation>
  <UserResponse>
    Changez le paquetage ou la configuration de l&apos;application de sorte que les bundles qui sont soit list&#233;s dans l&apos;en-t&#234;te Use-Bundle, soit ajout&#233;s par le solveur ne requi&#232;rent pas de packages provenant des bundles figurant dans l&apos;en-t&#234;te Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable() : EJBMappingsStep n&apos;a pas &#233;t&#233; ex&#233;cut&#233;e alors qu&apos;elle aurait d&#251; l&apos;&#234;tre.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: L&apos;&apos;actif {0} ne peut pas &#234;tre d&#233;ploy&#233; &#224; la fois sur la cible {1} dans le domaine de s&#233;curit&#233; {2} et sur la cible {3} dans le domaine de s&#233;curit&#233; {4}.
  </MsgText>
  <Explanation>
    Pour qu&apos;un actif puisse &#234;tre d&#233;ploy&#233; sur plusieurs cibles, ces derni&#232;res doivent toutes appartenir au m&#234;me domaine de s&#233;curit&#233;.
  </Explanation>
  <UserResponse>
    Modifiez les cibles de d&#233;ploiement de mani&#232;re &#224; ce qu&apos;elles soient toutes dans le m&#234;me domaine de s&#233;curit&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: Le manifeste composite de Composite Bundle Archive (CBA) {0} contient un en-t&#234;te CompositeBundle-ExportService mais aucun service d&#233;fini dans le CBA ne correspond &#224; ce filtre.
  </MsgText>
  <Explanation>
    Le manifeste de bundle composite d&#233;finit un en-t&#234;te CompositeBundle-ExportService mais aucune d&#233;claration de service Blueprint ne correspond &#224; ce filtre.
  </Explanation>
  <UserResponse>
    Ajoutez les d&#233;clarations de service Blueprint manquantes au contenu de l&apos;archive de bundle composite (CBA) ou corrigez l&apos;en-t&#234;te CompositeBundle-ExportService du manifeste du composite, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: L&apos;&apos;EJB {0} dans le bundle {1} de version {2} a un nom de mappage simple d&#233;fini, mais son fichier de liaisons contient aussi des mappages sp&#233;cifiques.
  </MsgText>
  <Explanation>
    Le fichier de liaisons EJB inclus dans le bundle contient une configuration de mappages non valide pour un EJB.
  </Explanation>
  <UserResponse>
    Corrigez le fichier de liaisons de sorte qu&apos;il y ait soit un nom de mappage simple, soit une configuration de mappages sp&#233;cifiques, mais pas les deux.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Une erreur interne s&apos;&apos;est produite. Impossible de supprimer le r&#233;pertoire enfant de {0} pour permettre le changement de nom d&apos;&apos;un r&#233;pertoire.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Une erreur interne s&apos;&apos;est produite. Impossible de d&#233;velopper le fichier d&apos;&apos;archive de bundle d&apos;&apos;entreprise (EBA) ; aucun r&#233;pertoire de d&#233;veloppement sp&#233;cifi&#233; dans la configuration pour {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: La mise &#224; jour d&apos;un actif d&apos;application OSGi a &#233;t&#233; tent&#233;e. Ce cas n&apos;est pas pris en charge. La mise &#224; jour des actifs d&apos;application OSGi peut &#234;tre effectu&#233;e dans le panneau &quot;Mettre &#224; jour les versions des bundles pr&#233;sents dans cette application&quot; &#224; partir de la page de configuration des actifs d&apos;application OSGi.
  </MsgText>
  <Explanation>
    La mise &#224; jour des actifs d&apos;application OSGi avec un nouveau fichier binaire n&apos;est pas prise en charge.
  </Explanation>
  <UserResponse>
    Si vous devez effectuer d&apos;autres op&#233;rations en plus de la mise &#224; jour des versions de bundle dans l&apos;actif existant, d&#233;sinstallez l&apos;actif avant d&apos;importer son rempla&#231;ant. Vous pouvez aussi ajouter de nouveaux bundles &#224; une application existante en les empaquetant dans une archive de bundle composite (CBA) puis en ajoutant l&apos;archive CBA comme extension &#224; l&apos;unit&#233; de composition.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Aucun nom JNDI de sp&#233;cification d&apos;&apos;activation MDB n&apos;&apos;a &#233;t&#233; configur&#233; pour le bean {0} dans le bundle {1} de version {2}, sur la cible {3}.
  </MsgText>
  <Explanation>
    Le nom JNDI de la sp&#233;cification d&apos;activation de la liaison de programme d&apos;&#233;coute MDB n&apos;a pas &#233;t&#233; configur&#233;e.
  </Explanation>
  <UserResponse>
    Vous devez configurer une r&#233;f&#233;rence JNDI de sp&#233;cification d&apos;activation pour le MDB (bean g&#233;r&#233; par message).
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Impossible de renommer le fichier {0} en {1} dans le cadre du d&#233;veloppement du fichier d&apos;&apos;archive de bundle d&apos;&apos;entreprise (EBA) {2}.
  </MsgText>
  <Explanation>
    Pour que le fichier EBA sp&#233;cifi&#233; puisse &#234;tre d&#233;velopp&#233;, un fichier doit &#234;tre renomm&#233;. Ce changement de nom n&apos;a pas abouti.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le serveur d&apos;applications dispose des droits requis pour renommer le fichier.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: L&apos;&apos;archive de bundle composite (CBA) {0} n&apos;&apos;est pas valide. Les packages export&#233;s suivants qui sont r&#233;pertori&#233;s dans le manifeste du composite ne sont pas export&#233;s par les bundles de l&apos;&apos;archive de bundle composite (CBA) : {1}
  </MsgText>
  <Explanation>
    Une archive de bundle composite (CBA) ne peut exporter que des packages qui sont export&#233;s par les bundles qu&apos;elle contient.
  </Explanation>
  <UserResponse>
    Ajoutez les packages export&#233;s manquants aux bundles de l&apos;archive de bundle composite (CBA) ou supprimez les d&#233;tails des exportations non satisfaites du manifeste du composite, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: Impossible d&apos;&apos;ajouter l&apos;&apos;actif {0} car les bundles que requiert cet actif ne sont pas t&#233;l&#233;charg&#233;s. Pour d&#233;marrer le t&#233;l&#233;chargement des bundles, sauvegardez les modifications apport&#233;es &#224; la configuration principale apr&#232;s avoir import&#233; l&apos;&apos;actif.
  </MsgText>
  <Explanation>
    Vous avez tent&#233; d&apos;ajouter un actif qui requiert le t&#233;l&#233;chargement d&apos;un ou plusieurs bundles depuis un r&#233;f&#233;rentiel. Soit le t&#233;l&#233;chargement n&apos;a pas d&#233;marr&#233;, soit il n&apos;est pas encore termin&#233;.
  </Explanation>
  <UserResponse>
    Sauvegardez les modifications si vous ne l&apos;avez pas encore fait apr&#232;s avoir import&#233; l&apos;actif. Attendez la fin du t&#233;l&#233;chargement du bundle, puis essayez &#224; nouveau d&apos;ajouter l&apos;actif &#224; l&apos;application BLA de niveau m&#233;tier. Vous pouvez voir o&#249; en est le t&#233;l&#233;chargement dans le panneau de d&#233;tails de l&apos;actif sur la console d&apos;administration.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: Le contenu du manifeste de d&#233;ploiement n&apos;&apos;est pas correct. Les bundles suppl&#233;mentaires suivants sont requis : {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement &#224; importer ne comporte pas tous les bundles n&#233;cessaires &#224; la r&#233;solution de l&apos;actif EBA.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le nouveau manifeste de d&#233;ploiement, DEPLOYMENT.MF, comprend bien tous les bundles &#233;num&#233;r&#233;s dans le message de l&apos;exception. N&apos;&#233;ditez pas manuellement le manifeste de d&#233;ploiement. Si n&#233;cessaire, supprimez le manifeste de d&#233;ploiement du fichier EBA. Ainsi, un nouveau fichier manifeste de d&#233;ploiement est g&#233;n&#233;r&#233; &#224; l&apos;importation du fichier EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: Impossible de cr&#233;er le r&#233;pertoire {0}.
  </MsgText>
  <Explanation>
    Le r&#233;pertoire sp&#233;cifi&#233; ne peut pas &#234;tre cr&#233;&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;espace de stockage. V&#233;rifiez &#233;galement que le produit dispose bien des autorisations n&#233;cessaires pour cr&#233;er le r&#233;pertoire.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: Impossible d&apos;&apos;exporter l&apos;&apos;actif {0} car le bundle {1} qu&apos;&apos;il requiert n&apos;&apos;est pas enti&#232;rement t&#233;l&#233;charg&#233;.
  </MsgText>
  <Explanation>
    Vous avez tent&#233; d&apos;exporter un actif qui requiert le t&#233;l&#233;chargement d&apos;un ou de plusieurs bundles &#224; partir d&apos;un r&#233;f&#233;rentiel. Soit le t&#233;l&#233;chargement n&apos;a pas d&#233;marr&#233;, soit il n&apos;est pas encore termin&#233;.
  </Explanation>
  <UserResponse>
    Si vous n&apos;avez pas sauvegard&#233; vos modifications apr&#232;s l&apos;importation de l&apos;actif, sauvegardez-les maintenant. Attendez la fin du t&#233;l&#233;chargement du bundle puis essayez &#224; nouveau d&apos;exporter l&apos;actif.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Une erreur interne s&apos;est produite. Le service DeploymentManifestManager n&apos;est pas disponible depuis le registre des services OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: Impossible de r&#233;soudre le fichier EBA. Le manifeste de d&#233;ploiement inclus n&apos;&apos;est pas valide sur ce syst&#232;me. Exception : {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement r&#233;pertorie des versions sp&#233;cifiques des bundles requis. Le syst&#232;me ne peut pas r&#233;soudre ces versions de bundle. Lorsqu&apos;un manifeste de d&#233;ploiement est inclus dans un fichier EBA, le programme de r&#233;solution utilise uniquement les versions de bundle qui sont sp&#233;cifi&#233;es dans le manifeste. Il se peut que d&apos;autres versions de bundle valides soient disponibles sur le syst&#232;me mais elles ne sont pas utilis&#233;es car elles ne sont pas sp&#233;cifi&#233;es dans le manifeste de d&#233;ploiement.
  </Explanation>
  <UserResponse>
    Si votre application requiert l&apos;utilisation d&apos;un manifeste de d&#233;ploiement, par exemple pour garantir que la m&#234;me configuration de bundle est ex&#233;cut&#233;e dans diff&#233;rents environnements, utilisez les informations indiqu&#233;es dans l&apos;exception pour identifier les versions de bundle qui sont requises et les rendre disponibles sur le syst&#232;me. Si votre application ne requiert pas ce niveau suppl&#233;mentaire de contr&#244;le, supprimez le manifeste de d&#233;ploiement. N&apos;&#233;ditez pas manuellement le manifeste de d&#233;ploiement.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: La valeur d&#233;finie pour le manifeste d&apos;&apos;application version {0} n&apos;&apos;est pas prise en charge. La version prise en charge est {1}.
  </MsgText>
  <Explanation>
    La valeur sp&#233;cifi&#233;e pour l&apos;en-t&#234;te Application-ManifestVersion dans APPLICATION.MF est incorrecte.
  </Explanation>
  <UserResponse>
    Corrigez la valeur d&apos;Application-ManifestVersion dans APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Les exigences sp&#233;cifi&#233;es par le manifeste de d&#233;ploiement dans le fichier EBA ne peuvent pas &#234;tre satisfaites. L&apos;&apos;exception g&#233;n&#233;r&#233;e est {0}.
  </MsgText>
  <Explanation>
    L&apos;importation d&apos;un fichier EBA contenant un fichier manifeste de d&#233;ploiement a &#233;t&#233; tent&#233;e. Les exigences sp&#233;cifi&#233;es par ce fichier n&apos;ont pas pu &#234;tre satisfaites.
  </Explanation>
  <UserResponse>
    V&#233;rifiez le contenu du fichier manifeste de d&#233;ploiement et assurez-vous que le syst&#232;me sur lequel ce fichier EBA est d&#233;ploy&#233; est compatible. V&#233;rifiez que les r&#233;f&#233;rentiels de bundles internes ou externes requis sont configur&#233;s. N&apos;&#233;ditez pas manuellement le manifeste de d&#233;ploiement. Si n&#233;cessaire, supprimez le manifeste de d&#233;ploiement du fichier EBA. Ainsi, un nouveau fichier manifeste de d&#233;ploiement est g&#233;n&#233;r&#233; &#224; l&apos;importation du fichier EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: Le fichier EBA {0} sp&#233;cifie bien un Application-Content dans son manifeste d&apos;&apos;application, mais l&apos;&apos;entr&#233;e est vide.
  </MsgText>
  <Explanation>
    Un fichier EBA contient un en-t&#234;te Application-Content vide dans son manifeste d&apos;application application.mf. Si cette entr&#233;e est fournie, elle doit contenir au moins un bundle valide.
  </Explanation>
  <UserResponse>
    Modifiez l&apos;en-t&#234;te Application-Content dans le fichier application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: Aucune destination MDB correspondant au nom JNDI {0} n&apos;&apos;a &#233;t&#233; trouv&#233;e sur la cible {1} pour la ressource utilis&#233;e par le bean {2} dans le bundle {3} de version {4}.
  </MsgText>
  <Explanation>
    Le nom JNDI sp&#233;cifi&#233; comme r&#233;f&#233;rence de la destination de liaison de programme d&apos;&#233;coute MDB n&apos;existe pas.
  </Explanation>
  <UserResponse>
    Si la r&#233;f&#233;rence doit se trouver dans l&apos;espace de noms JNDI, liez un objet au nom ou corrigez la r&#233;f&#233;rence et mettez &#224; jour l&apos;archive EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: Le fichier EBA {0} ne sp&#233;cifie pas d&apos;&apos;Application-Content et il ne contient pas de bundles valides.
  </MsgText>
  <Explanation>
    Un fichier EBA doit contenir au moins un bundle OSGi ou un fichier WAR valides, ou il doit r&#233;pertorier au moins un bundle OSGi dans l&apos;en-t&#234;te Application-Content de son fichier manifeste d&apos;application.
  </Explanation>
  <UserResponse>
    Modifiez le fichier EBA pour qu&apos;il contienne au moins un bundle ou un fichier WAR valides (inclusion par valeur), ou qu&apos;il r&#233;pertorie au moins un bundle dans l&apos;en-t&#234;te Application-Content de son fichier application.mf (inclusion par r&#233;f&#233;rence).
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: Impossible de cr&#233;er le r&#233;pertoire : {0}
  </MsgText>
  <Explanation>
    Un incident est survenu lors de la cr&#233;ation du nom de chemin requis lors de l&apos;exportation de l&apos;actif.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le serveur d&apos;applications dispose des droits requis pour la cr&#233;ation de ce nom de chemin.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
