<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: Une erreur interne s&apos;est produite. Un filtre de services n&apos;a pas pu &#234;tre analys&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: Une erreur interne s&apos;&apos;est produite. L&apos;&apos;&#233;tat de l&apos;&apos;application OSGi {0} de version {1} ne permet pas de demander des ressources.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: Une erreur interne s&apos;est produite. Un filtre de services n&apos;a pas pu &#234;tre analys&#233;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: Plusieurs contextes de persistance dont le nom est {0} ont &#233;t&#233; trouv&#233;s par le bundle Web {1} de version {2}.
  </MsgText>
  <Explanation>
    Le conteneur JPA OSGi a trouv&#233; plusieurs contextes de persistance portant le m&#234;me nom. Il ne s&apos;agit pas d&apos;une configuration valide et des r&#233;sultats incoh&#233;rents risquent d&apos;&#234;tre g&#233;n&#233;r&#233;s.
  </Explanation>
  <UserResponse>
    Changez l&apos;application OSGi pour qu&apos;elle ne contienne plus de bundles d&#233;finissant plusieurs contextes de persistance associ&#233;s au m&#234;me nom.
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: Un bundle Web OSGi {0} de version {1} d&#233;finit une d&#233;pendance au contexte de persistance JPA g&#233;r&#233; {2} avec port&#233;e &#233;tendue. Les contextes de persistance avec port&#233;e &#233;tendue ne sont pas pris en charge par le conteneur JPA OSGi.
  </MsgText>
  <Explanation>
    Une application a d&#233;clar&#233; une d&#233;pendance &#224; un contexte de persistance JPA avec port&#233;e &#233;tendue alors que les contextes de persistance avec port&#233;e &#233;tendue ne sont pas pris en charge par le conteneur JPA OSGi.
  </Explanation>
  <UserResponse>
    Changez l&apos;application pour qu&apos;elle utilise des contextes de persistance g&#233;r&#233;s par application ou avec port&#233;e de transaction.
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: Une erreur interne s&apos;est produite. L&apos;environnement d&apos;ex&#233;cution des applications OSGi n&apos;a pas pu initialiser le support des contextes de persistance.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: Plusieurs unit&#233;s de persistance dont le nom est {0} ont &#233;t&#233; trouv&#233;es par le bundle Web {1} de version {2}.
  </MsgText>
  <Explanation>
    Le conteneur JPA OSGi a trouv&#233; plusieurs unit&#233;s de persistance portant le m&#234;me nom. Il ne s&apos;agit pas d&apos;une configuration valide et des r&#233;sultats incoh&#233;rents risquent d&apos;&#234;tre g&#233;n&#233;r&#233;s.
  </Explanation>
  <UserResponse>
    Changez l&apos;application OSGi pour qu&apos;elle ne contienne plus de bundles d&#233;finissant plusieurs unit&#233;s de persistance associ&#233;es au m&#234;me nom.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
