<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.tx/src/com/ibm/ws/eba/tx/nls/txMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAB1001E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAB1001E" varFormat="Java">
    CWSAB1001E=CWSAB1001E: Il existe une transaction active sur l&apos;unit&#233; d&apos;ex&#233;cution.
  </MsgText>
  <Explanation>
    Une strat&#233;gie de transaction de type Never a &#233;t&#233; sp&#233;cifi&#233;e mais il existait une transaction active sur l&apos;unit&#233; d&apos;ex&#233;cution.
  </Explanation>
  <UserResponse>
    Soit supprimez la transaction, soit utilisez une autre strat&#233;gie de transaction.
  </UserResponse>
</Message>
<Message ID="CWSAB1000E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAB1000E" varFormat="Java">
    CWSAB1000E=CWSAB1000E: Il n&apos;existe aucune transaction active sur l&apos;unit&#233; d&apos;ex&#233;cution.
  </MsgText>
  <Explanation>
    Une strat&#233;gie de transaction de type Mandatory a &#233;t&#233; sp&#233;cifi&#233;e mais il n&apos;existait aucune transaction active sur l&apos;unit&#233; d&apos;ex&#233;cution.
  </Explanation>
  <UserResponse>
    Soit fournissez une transaction, soit utilisez une autre strat&#233;gie de transaction.
  </UserResponse>
</Message>
<Message ID="CWSAB1002E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAB1002E" varFormat="Java">
    CWSAB1002E=CWSAB1002E: Impossible de s&#233;lectionner une strat&#233;gie de transaction en raison de la pr&#233;sence de m&#233;tadonn&#233;es de composant ambigu&#235;s. Impossible de choisir parmi les &#233;l&#233;ments {0} pour le composant {1}.
  </MsgText>
  <Explanation>
    Une strat&#233;gie de transaction doit &#234;tre s&#233;lectionn&#233;e pour le composant mais deux strat&#233;gies de transaction ou plus peuvent &#234;tre s&#233;lectionn&#233;es pour les m&#233;tadonn&#233;es de composant.
  </Explanation>
  <UserResponse>
    Corrigez les m&#233;tadonn&#233;es de composant ambigu&#235;s pour qu&apos;une strat&#233;gie de transaction seulement soit sp&#233;cifi&#233;e.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
