<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: Une erreur interne s&apos;&apos;est produite. Un manifeste de bundle composite doit contenir une entr&#233;e Bundle-SymbolicName et une seule. L&apos;&apos;entr&#233;e suivante a &#233;t&#233; trouv&#233;e : {0}.
  </MsgText>
  <Explanation>
    L&apos;environnement d&apos;ex&#233;cution a tent&#233; de traiter les m&#233;tadonn&#233;es pour un bundle composite mais n&apos;est pas parvenu &#224; d&#233;terminer le nom symbolique du bundle.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: Une erreur de syntaxe a &#233;t&#233; rencontr&#233;e lors de la tentative d&apos;&apos;interpr&#233;tation de la cha&#238;ne de filtrage Blueprint &apos;&apos;{0}&apos;&apos; pour l&apos;&apos;&#233;l&#233;ment dont l&apos;&apos;ID est {1} : {2}
  </MsgText>
  <Explanation>
    Une InvalidSyntaxException a &#233;t&#233; &#233;mise lors de la tentative d&apos;interpr&#233;tation de la cha&#238;ne de filtrage pour l&apos;&#233;l&#233;ment dont l&apos;ID est indiqu&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que la cha&#238;ne de filtrage pour l&apos;&#233;l&#233;ment indiqu&#233; est syntaxiquement correcte.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: Une erreur interne s&apos;&apos;est produite. Un manifeste de bundle doit contenir une entr&#233;e Bundle-SymbolicName et une seule. L&apos;&apos;entr&#233;e suivante a &#233;t&#233; trouv&#233;e : {0}.
  </MsgText>
  <Explanation>
    L&apos;environnement d&apos;ex&#233;cution a tent&#233; de traiter les m&#233;tadonn&#233;es d&apos;un bundle mais n&apos;est pas parvenu &#224; d&#233;terminer le nom symbolique du bundle.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: Une erreur interne s&apos;&apos;est produite. Un manifeste de fragment de bundle doit d&#233;finir une entr&#233;e Fragment-Host et une seule. L&apos;&apos;entr&#233;e suivante a &#233;t&#233; trouv&#233;e : {0}.
  </MsgText>
  <Explanation>
    L&apos;environnement d&apos;ex&#233;cution a tent&#233; de traiter les m&#233;tadonn&#233;es pour un fragment de bundle mais n&apos;est pas parvenu &#224; d&#233;terminer le bundle h&#244;te du fragment.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: Une erreur interne s&apos;&apos;est produite. Le bundle composite dont le nom symbolique est {0} et la version de manifeste est {1} n&apos;&apos;a pas pu &#234;tre trait&#233;.
  </MsgText>
  <Explanation>
    Un manifeste de bundle composite doit contenir une entr&#233;e Bundle-SymbolicName et une entr&#233;e CompositeBundle-ManifestVersion valides.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que tous les bundles composites contiennent une entr&#233;e Bundle-SymbolicName et une entr&#233;e CompositeBundle-ManifestVersion valides dans leur fichier manifeste.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: Une erreur interne s&apos;&apos;est produite. Un bundle dont le nom symbolique est {0} et la version de manifeste est {1} n&apos;&apos;a pas pu &#234;tre trait&#233;.
  </MsgText>
  <Explanation>
    Un manifeste de bundle doit contenir une entr&#233;e Bundle-SymbolicName et une entr&#233;e Bundle-ManifestVersion valides.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que tous les bundles contiennent une entr&#233;e Bundle-SymbolicName et une entr&#233;e Bundle-ManifestVersion valides dans leur fichier manifeste.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
