<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: Le param&#232;tre symbolicName n&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;il est obligatoire.
  </MsgText>
  <Explanation>
    La commande requiert que soit sp&#233;cifi&#233; le param&#232;tre symbolicName.
  </Explanation>
  <UserResponse>
    R&#233;&#233;mettez la commande en sp&#233;cifiant le nom symbolicName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: Impossible de trouver le manifeste de d&#233;ploiement &#224; l&apos;&apos;adresse {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement DEPLOYMENT.MF &#224; importer n&apos;existe pas.
  </Explanation>
  <UserResponse>
    V&#233;rifiez le chemin du manifeste de d&#233;ploiement.
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: Les bundles {0} n&apos;&apos;ont pas pu &#234;tre supprim&#233;s du r&#233;f&#233;rentiel interne des bundles. Tous les autres bundles {1} ont &#233;t&#233; supprim&#233;s.
  </MsgText>
  <Explanation>
    Certains bundles n&apos;ont pas pu &#234;tre supprim&#233;s du r&#233;f&#233;rentiel interne des bundles.
  </Explanation>
  <UserResponse>
    Arr&#234;tez toute application utilisant les bundles qui n&apos;ont pas pu &#234;tre supprim&#233;s puis essayez de les supprimer &#224; nouveau.
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: Le bundle {0} est d&#233;j&#224; arr&#234;t&#233;.
  </MsgText>
  <Explanation>
    Vous ne pouvez arr&#234;ter le bundle pour la bonne raison qu&apos;il est d&#233;j&#224; arr&#234;t&#233;.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: Impossible de supprimer le bundle {0} car les archives CBA suivantes ont une d&#233;pendance envers ce bundle : {1}.
  </MsgText>
  <Explanation>
    Il est impossible de supprimer un bundle du r&#233;f&#233;rentiel interne si une archive CBA d&#233;pend de ce bundle.
  </Explanation>
  <UserResponse>
    Pour supprimer le bundle, commencez par supprimer les archives CBA r&#233;pertori&#233;es, puis supprimez le bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: Impossible d&apos;obtenir les fonctionnalit&#233;s requises pour une fonction comme JPA2 Feature.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: Impossible de trouver un service dont l&apos;&apos;ID est {0}.
  </MsgText>
  <Explanation>
    L&apos;ID du service qui a &#233;t&#233; indiqu&#233; dans la commande ne correspond &#224; aucun service dans le registre.
  </Explanation>
  <UserResponse>
    Relancez la commande avec un ID valide.
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: Le bundle {1} de version {2}, d&#233;fini dans le fichier {0}, existe d&#233;j&#224; dans le r&#233;f&#233;rentiel.
  </MsgText>
  <Explanation>
    Impossible d&apos;ajouter le bundle au r&#233;f&#233;rentiel car le bundle existe d&#233;j&#224; dans ce r&#233;f&#233;rentiel.
  </Explanation>
  <UserResponse>
    V&#233;rifiez si le bundle pr&#233;sent dans le r&#233;f&#233;rentiel est le bon. Si ce n&apos;est pas le bon, retirez-le du r&#233;f&#233;rentiel avant d&apos;ajouter le bon bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: Le param&#232;tre cuName n&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;il est obligatoire.
  </MsgText>
  <Explanation>
    La commande requiert que soit sp&#233;cifi&#233; le param&#232;tre cuName.
  </Explanation>
  <UserResponse>
    R&#233;&#233;mettez la commande en sp&#233;cifiant le nom cuName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: Des r&#233;f&#233;rences de service dans le contenu de l&apos;&apos;archive de bundle composite (CBA) {0} ne peuvent pas &#234;tre r&#233;solues. Si ces services sont mis &#224; disposition par des bundles qui ne sont pas inclus dans l&apos;&apos;archive de bundle composite (CBA), cette derni&#232;re doit les importer. Les d&#233;pendances de service suivantes n&apos;&apos;ont pas &#233;t&#233; r&#233;solues : {1}
  </MsgText>
  <Explanation>
    Si un bundle d&apos;une archive de bundle composite (CBA) utilise un service qui ne se trouve pas dans le bundle ou qui est export&#233; par un autre bundle au sein de l&apos;archive de bundle composite (CBA), l&apos;archive de bundle composite (CBA) doit importer le service.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste du composite, COMPOSITEBUNDLE.MF, pour que l&apos;archive de bundle composite (CBA) importe les services qui sont utilis&#233;s par les bundles de l&apos;archive de bundle composite et qui ne sont pas disponibles autrement au sein de l&apos;archive de bundle composite (CBA).
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: Une erreur interne s&apos;&apos;est produite. Impossible de trouver le manifeste de d&#233;ploiement dans l&apos;&apos;actif EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: Une erreur interne s&apos;&apos;est produite. Les m&#233;tadonn&#233;es des bundles {0} n&apos;&apos;ont pas pu &#234;tre supprim&#233;es du r&#233;f&#233;rentiel interne des bundles. De plus, les bundles {1} n&apos;&apos;ont pas pu &#234;tre supprim&#233;s du r&#233;f&#233;rentiel. L&apos;&apos;exception est : {2}
  </MsgText>
  <Explanation>
    Certains bundles n&apos;ont pas pu &#234;tre supprim&#233;s du r&#233;f&#233;rentiel interne des bundles et pour d&apos;autres bundles, les m&#233;tadonn&#233;es n&apos;ont pas pu &#234;tre supprim&#233;es. Il se peut que l&apos;&#233;tat du syst&#232;me soit maintenant incoh&#233;rent.
  </Explanation>
  <UserResponse>
    Annulez les modifications dans l&apos;espace de travail courant et tentez de supprimer les bundles les uns apr&#232;s les autres.
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: Le d&#233;marrage de &quot;{0}&quot; a r&#233;ussi.
  </MsgText>
  <Explanation>
    Il s&apos;agit d&apos;un message d&apos;information.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: Impossible d&apos;obtenir de renseignement sur le ou les packages car vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </MsgText>
  <Explanation>
    Vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </Explanation>
  <UserResponse>
    Connectez-vous &#224; une structure &#224; l&apos;aide de la commande connect. Pour afficher la liste des structures disponibles, utilisez la commande list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: Une erreur interne s&apos;est produite. Impossible de trouver le service Launcher.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: Impossible de trouver de bundle dont l&apos;&apos;ID soit {0}.
  </MsgText>
  <Explanation>
    L&apos;ID du bundle qui a &#233;t&#233; indiqu&#233; dans la commande ne correspond &#224; aucun bundle de la structure.
  </Explanation>
  <UserResponse>
    Relancez la commande avec un ID valide.
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: Le fichier {0} sp&#233;cifi&#233; ne contient pas de manifeste de bundle valide.
  </MsgText>
  <Explanation>
    Le fichier sp&#233;cifi&#233; n&apos;est pas un bundle OSGi.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste de bundle du fichier indiqu&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: Une erreur interne s&apos;&apos;est produite. Un service d&apos;&apos;ex&#233;cution n&apos;&apos;est pas disponible &#224; partir du registre des services OSGi : {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: L&apos;&apos;actif {0} qui a &#233;t&#233; indiqu&#233; n&apos;&apos;est pas un actif EBA.
  </MsgText>
  <Explanation>
    L&apos;actif indiqu&#233; n&apos;est pas un actif EBA.
  </Explanation>
  <UserResponse>
    Faites en sorte d&apos;indiquer un actif EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: Une erreur interne s&apos;&apos;est produite. Les m&#233;tadonn&#233;es des bundles {0} n&apos;&apos;ont pas pu &#234;tre supprim&#233;es du r&#233;f&#233;rentiel interne des bundles. Il s&apos;&apos;agit de l&apos;&apos;exception {1}
  </MsgText>
  <Explanation>
    Les bundles n&apos;ont pas pu &#234;tre supprim&#233;s du r&#233;f&#233;rentiel interne des bundles. Il se peut que l&apos;&#233;tat du syst&#232;me soit maintenant incoh&#233;rent.
  </Explanation>
  <UserResponse>
    Annulez les modifications dans l&apos;espace de travail courant et tentez de supprimer les bundles les uns apr&#232;s les autres.
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: Le bundle {0} a d&#233;j&#224; d&#233;marr&#233;.
  </MsgText>
  <Explanation>
    Vous ne pouvez d&#233;marrer le bundle pour la bonne raison qu&apos;il a d&#233;j&#224; d&#233;marr&#233;.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: Le filtre de services n&apos;&apos;est pas valide : {0}.
  </MsgText>
  <Explanation>
    Le filtre de services indiqu&#233; n&apos;est pas valide.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; du filtre et relancez la commande.
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: Une erreur interne s&apos;est produite. Le service de g&#233;n&#233;rateur de r&#233;f&#233;rentiel n&apos;est pas disponible depuis le registre des services OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: Impossible d&apos;obtenir de renseignement sur le ou les services car vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </MsgText>
  <Explanation>
    Vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </Explanation>
  <UserResponse>
    Connectez-vous &#224; une structure &#224; l&apos;aide de la commande connect. Pour afficher la liste des structures disponibles, utilisez la commande list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: Le bundle {0} qui se trouve dans l&apos;&apos;archive de bundle composite {1} ne contient pas de manifeste de bundle valide.
  </MsgText>
  <Explanation>
    Le fichier sp&#233;cifi&#233; n&apos;est pas un bundle OSGi.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste de bundle du fichier indiqu&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: L&apos;&apos;archive de bundle composite (CBA) {0} n&apos;&apos;est pas valide.  Des packages import&#233;s par des bundles dans l&apos;&apos;archive CBA sont absents de l&apos;&apos;en-t&#234;te Import-Package du fichier manifeste CBA. Les probl&#232;mes suivants ont &#233;t&#233; signal&#233;s : {1}
  </MsgText>
  <Explanation>
    Si un bundle d&apos;une archive de bundle composite (CBA) utilise un package qui ne se trouve pas dans le bundle ou qui est export&#233; par un autre bundle au sein de l&apos;archive de bundle composite (CBA), l&apos;archive de bundle composite (CBA) doit importer le package.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste du composite, COMPOSITEBUNDLE.MF, pour que l&apos;archive de bundle composite (CBA) importe les packages qui sont utilis&#233;s par les bundles de l&apos;archive de bundle composite et qui ne sont pas disponibles autrement au sein de l&apos;archive de bundle composite (CBA).
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: La connexion n&apos;est plus disponible. V&#233;rifiez les connexions disponibles et reconnectez-vous si n&#233;cessaire.
  </MsgText>
  <Explanation>
    La structure &#224; laquelle vous &#233;tiez connect&#233;e n&apos;est plus disponible. La raison en est peut-&#234;tre l&apos;arr&#234;t d&apos;une application.
  </Explanation>
  <UserResponse>
    V&#233;rifiez si la structure est toujours disponible et reconnectez-vous si n&#233;cessaire.
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: La cha&#238;ne {0} ne respecte pas la syntaxe correcte, nomsymbolique;version.
  </MsgText>
  <Explanation>
    La cha&#238;ne indiqu&#233;e dans la liste des bundles &#224; supprimer n&apos;a pas pu &#234;tre trait&#233;e car elle ne respecte pas la syntaxe attendue.
  </Explanation>
  <UserResponse>
    Corrigez la syntaxe de la cha&#238;ne indiqu&#233;e.
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: Impossible d&apos;obtenir de renseignement sur le ou les en-t&#234;tes car vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </MsgText>
  <Explanation>
    Vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </Explanation>
  <UserResponse>
    Connectez-vous &#224; une structure &#224; l&apos;aide de la commande connect. Pour afficher la liste des structures disponibles, utilisez la commande list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: Impossible de trouver de package dont le nom soit {0}.
  </MsgText>
  <Explanation>
    Le nom du package qui a &#233;t&#233; indiqu&#233; dans la commande ne correspond &#224; aucun package de la structure.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; du nom du package et relancez la commande.
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: Le bundle {0} sp&#233;cifi&#233; de version {1} n&apos;&apos;existe pas dans le r&#233;f&#233;rentiel local.
  </MsgText>
  <Explanation>
    Impossible d&apos;afficher ou de supprimer le bundle car il n&apos;existe aucun bundle de ce nom.
  </Explanation>
  <UserResponse>
    Corrigez la version ou le nom symbolique du bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: Impossible d&apos;obtenir de renseignement sur le ou les bundles car vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </MsgText>
  <Explanation>
    Vous n&apos;&#234;tes pas connect&#233; &#224; une structure.
  </Explanation>
  <UserResponse>
    Connectez-vous &#224; une structure &#224; l&apos;aide de la commande connect. Pour afficher la liste des structures disponibles, utilisez la commande list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: Le r&#233;f&#233;rentiel de bundles {0} n&apos;&apos;existe pas.
  </MsgText>
  <Explanation>
    Une tentative a &#233;t&#233; effectu&#233;e pour modifier le r&#233;f&#233;rentiel de bundles, mais ce dernier n&apos;existe pas.
  </Explanation>
  <UserResponse>
    Cr&#233;ez le r&#233;f&#233;rentiel de bundles.
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: Le fichier sp&#233;cifi&#233; {0} ne peut pas &#234;tre analys&#233; en tant que fichier manifeste en raison de l&apos;&apos;exception {1}
  </MsgText>
  <Explanation>
    Le fichier sp&#233;cifi&#233; ne semble pas &#234;tre un fichier manifeste valide.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le fichier fourni est un fichier manifeste valide.
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: Impossible de trouver de package dont l&apos;&apos;adresse soit {0}.
  </MsgText>
  <Explanation>
    L&apos;adresse du package qui a &#233;t&#233; indiqu&#233;e dans la commande ne correspond &#224; aucune adresse de package dans la structure.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; de l&apos;adresse du package et relancez la commande.
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      OSGi Application Console
 
 Commandes d&apos;affichage : ces commandes ne fonctionnent que si l&apos;on est connect&#233; &#224; une structure
 
     ss()                - R&#233;capitule les bundles install&#233;s.
     bundles()           - Donne des renseignements complets sur les bundles install&#233;s.
     packages()          - Renseigne sur les packages import&#233;s/export&#233;s.
     services()          - Renseigne sur les services enregistr&#233;s.
 
     bundle(&lt;bundleID&gt;)  - Renseigne sur le bundle sp&#233;cifi&#233;.
     headers(&lt;bundleID&gt;) - Renseigne sur les en-t&#234;tes associ&#233;s au bundle sp&#233;cifi&#233;.
     packages(&lt;bundle ID&gt;) - Renseigne sur les packages de ce bundle qui ont &#233;t&#233; export&#233;s.
     packages(&lt;package Name&gt;) - Renseigne sur le package sp&#233;cifi&#233;.
     services(&lt;service ID&gt;) - Renseigne sur le service sp&#233;cifi&#233;.
     services(&lt;OSGI Filter&gt;) - Renseigne sur les services correspondant au filtre.
 
     refresh() - Actualise le cache interne de la console des applications OSGi avec les derni&#232;res informations concernant l&apos;&#233;tat de la structure.
 
 Commandes sur les structures :
 
     list() - Affiche la liste des structures disponibles auxquelles vous pouvez vous connecter.
     connect(&lt;Framework id&gt;) - Connecte &#224; la structure sp&#233;cifi&#233;e.
     connect(&lt;Bundle Name&gt;, &lt;Bundle Version&gt;, &lt;Node Name&gt;, &lt;Server Name&gt;) - Connecte &#224; la structure sp&#233;cifi&#233;e.
 
 Contr&#244;le de bundles :
 
     start(&lt;bundleID&gt;) - D&#233;marre le bundle demand&#233;.
     stop(&lt;bundleID&gt;   - Arr&#234;te le bundle demand&#233;.
  </MsgText>
  <Explanation>
    Aucune.
  </Explanation>
  <UserResponse>
    Aucune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: Le fichier {0} sp&#233;cifi&#233; n&apos;&apos;est ni un JAR ni une archive composite de bundles.
  </MsgText>
  <Explanation>
    Le nom du fichier sp&#233;cifi&#233; ne se termine ni par une extension .jar ni par une extension .cba.
  </Explanation>
  <UserResponse>
    Corrigez le nom du fichier indiqu&#233;. Ce fichier doit &#234;tre un fichier JAR ou une archive CBA valides.
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: Impossible de trouver de package dont l&apos;&apos;ID soit {0}.
  </MsgText>
  <Explanation>
    L&apos;ID du package qui a &#233;t&#233; indiqu&#233; dans la commande ne correspond &#224; aucun package de la structure.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; de l&apos;ID et relancez la commande.
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: L&apos;&apos;en-t&#234;te CompositeBundle-Content de l&apos;&apos;archive CBA {0} ne doit contenir que des bundles avec une version exacte. Les entr&#233;es suivantes ne sont pas valides : {1}.
  </MsgText>
  <Explanation>
    Une entr&#233;e CompositeBundle-Content doit utiliser un format du type &apos;bundle.name;version=&quot;[1.0.0,1.0.0]&quot;&apos;.
  </Explanation>
  <UserResponse>
    Les entr&#233;es de l&apos;en-t&#234;te CompositeBundle-Content du manifeste de bundle doivent sp&#233;cifier une version exacte et utiliser un bon format.
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: Impossible d&apos;&apos;installer l&apos;&apos;archive CBA {0} car les packages d&apos;&apos;exportation suivants sont diff&#233;rents de ceux contenus par l&apos;&apos;archive CBA : {1}
  </MsgText>
  <Explanation>
    Une archive CBA ne peut exporter que les packages export&#233;s par les bundles qu&apos;elle contient. Par ailleurs, les attributs et les directives doivent &#233;galement correspondre.
  </Explanation>
  <UserResponse>
    Corrigez le manifeste du composite, COMPOSITEBUNDLE.MF, pour que les packages qu&apos;il exporte soient les m&#234;mes que ceux que les bundles contenus dans l&apos;archive CBA exportent.
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: La fonctionnalit&#233; d&apos;&apos;extension d&apos;&apos;application n&apos;&apos;est pas disponible pour cette unit&#233; de composition car cette derni&#232;re est d&#233;ploy&#233;e sur les cibles suivantes, qui ne prennent pas en charge les extensions d&apos;&apos;application : {0}
  </MsgText>
  <Explanation>
    Les cibles sur lesquelles l&apos;unit&#233; de composition est d&#233;ploy&#233;e ne prennent pas toutes en charge la fonctionnalit&#233; d&apos;extension d&apos;application.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que l&apos;unit&#233; de composition &#224; laquelle vous voulez ajouter des extensions est d&#233;ploy&#233;e sur des cibles qui prennent en charge la fonctionnalit&#233; d&apos;extension d&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: Le bundle {0} ne parvient pas &#224; s&apos;&apos;arr&#234;ter. Il est actuellement en l&apos;&apos;&#233;tat {1}.
  </MsgText>
  <Explanation>
    Le bundle ne parvient pas &#224; s&apos;arr&#234;ter.
  </Explanation>
  <UserResponse>
    Vous trouverez dans les messages d&apos;erreur des explications d&#233;taill&#233;es des raisons qui emp&#234;chent ce bundle de s&apos;arr&#234;ter.
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: Le param&#232;tre  {0} n&apos;&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;&apos;il est obligatoire pour la commande {1}.
  </MsgText>
  <Explanation>
    Cette commande requiert le param&#232;tre sp&#233;cifi&#233;.
  </Explanation>
  <UserResponse>
    Relancez la commande en sp&#233;cifiant le param&#232;tre obligatoire.
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: Structures valides :
  </MsgText>
  <Explanation>
    Il s&apos;agit d&apos;un message d&apos;information.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: Les bundles suivants, requis par l&apos;&apos;archive CBA {0} sont introuvables dans le r&#233;f&#233;rentiel interne des bundles {1}.
  </MsgText>
  <Explanation>
    Il n&apos;est possible de d&#233;ployer une archive CBA que si toutes ses d&#233;pendances se trouvent dans le r&#233;f&#233;rentiel interne des bundles.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que les d&#233;pendances de l&apos;archive de bundle composite r&#233;pertori&#233;es se trouvent dans l&apos;archive de bundle composite ou sont install&#233;es dans le r&#233;f&#233;rentiel interne des bundles.
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: Un probl&#232;me de r&#233;solution est survenu lors de l&apos;&apos;ajout d&apos;&apos;une extension &#224; l&apos;&apos;unit&#233; de composition {0}. L&apos;&apos;exception est : {1}
  </MsgText>
  <Explanation>
    Le syst&#232;me ne peut pas r&#233;soudre l&apos;extension s&#233;lectionn&#233;e en conjonction avec le d&#233;ploiement courant de l&apos;actif. Il se peut que des d&#233;pendances manquent pour les bundles, que les bundles soient incompatibles ou qu&apos;ils n&apos;existent pas.
  </Explanation>
  <UserResponse>
    Examinez l&apos;erreur. Apportez toute modification n&#233;cessaire &#224; l&apos;actif et &#224; l&apos;extension puis appliquez &#224; nouveau l&apos;extension.
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: Le r&#233;f&#233;rentiel de bundles situ&#233; &#224; {0} est d&#233;j&#224; d&#233;fini sous le nom de {1}.
  </MsgText>
  <Explanation>
    Une tentative a &#233;t&#233; effectu&#233;e pour d&#233;finir un nouveau r&#233;f&#233;rentiel de bundles, mais un autre r&#233;f&#233;rentiel utilise d&#233;j&#224; l&apos;URL sp&#233;cifi&#233;e.
  </Explanation>
  <UserResponse>
    Sp&#233;cifiez une autre URL.
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: Une erreur interne s&apos;&apos;est produite. Une tentative a &#233;t&#233; effectu&#233;e pour g&#233;n&#233;rer un objet AriesApplicationModel &#224; partir d&apos;&apos;une URL autre que &apos;&apos;file&apos;&apos; {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: Impossible de trouver l&apos;&apos;actif EBA {0}.
  </MsgText>
  <Explanation>
    Vous avez import&#233; dans un actif un manifeste de d&#233;ploiement, mais l&apos;actif EBA n&apos;existe pas.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que l&apos;actif EBA est bien install&#233;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: Arr&#234;t en cours du bundle {0}.
  </MsgText>
  <Explanation>
    Il s&apos;agit d&apos;un message d&apos;information.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: Un probl&#232;me de r&#233;solution est survenu lors de la suppression d&apos;&apos;une extension de l&apos;&apos;unit&#233; de composition {0}. L&apos;&apos;exception est : {1}
  </MsgText>
  <Explanation>
    Le syst&#232;me ne peut pas r&#233;soudre l&apos;extension s&#233;lectionn&#233;e en conjonction avec le d&#233;ploiement courant de l&apos;actif. Il se peut que des d&#233;pendances manquent pour les bundles, que les bundles soient incompatibles ou qu&apos;ils n&apos;existent pas.
  </Explanation>
  <UserResponse>
    Consultez l&apos;erreur. Apportez toute modification n&#233;cessaire &#224; l&apos;actif puis supprimez l&apos;extension et tout autre extension interd&#233;pendante formant un ensemble.
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: Le manifeste de d&#233;ploiement &#224; importer n&apos;&apos;est pas valide pour l&apos;&apos;actif {0} car il ne remplit pas les conditions requises dans le manifeste d&apos;&apos;application.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement DEPLOYMENT.MF n&apos;est pas compatible avec le manifeste d&apos;application APPLICATION.MF de l&apos;actif.
  </Explanation>
  <UserResponse>
    Le nouveau manifeste de d&#233;ploiement doit remplir les conditions suivantes :
   1. Les en-t&#234;tes Application-SymbolicName et Application-Version du fichier DEPLOYMENT.MF doivent correspondre aux en-t&#234;tes correspondants du fichier APPLICATION.MF.
   2. Les bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te Deployed-Content du fichier DEPLOYMENT.MF doivent correspondre &#224; ceux r&#233;pertori&#233;s dans l&apos;en-t&#234;te Application-Content du fichier APPLICATION.MF.
   3. La version du bundle r&#233;pertori&#233; dans l&apos;en-t&#234;te Deployed-Content du fichier DEPLOYMENT.MF doit &#234;tre comprise dans la plage des versions du bundle correspondant dans le fichier APPLICATION.MF.
   4. Les bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te Deployed-Use-Bundle du fichier DEPLOYMENT.MF doivent &#233;galement &#234;tre r&#233;pertori&#233;s dans l&apos;en-t&#234;te Use-Bundle du fichier APPLICATION.MF.
   5. La version du bundle r&#233;pertori&#233; dans l&apos;en-t&#234;te Deployed-Use-Bundle du fichier DEPLOYMENT.MF doit &#234;tre comprise dans la plage des versions du bundle correspondant r&#233;pertori&#233; dans l&apos;en-t&#234;te Use-Bundle du fichier APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: L&apos;&apos;archive CBA {0} a une d&#233;pendance de d&#233;ploiement envers une autre archive CBA {1}.
  </MsgText>
  <Explanation>
    L&apos;imbrication d&apos;archives CBA n&apos;est pas prise en charge.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que l&apos;archive CBA ne d&#233;pend que des bundles r&#233;pertori&#233;s dans l&apos;en-t&#234;te CompositeBundle-Content du manifeste de l&apos;archive CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: Impossible de se connecter &#224; une structure dont le nom {0}, le nom du noeud {1} et celui du serveur {2}.
  </MsgText>
  <Explanation>
    Aucune structure ayant les attributs sp&#233;cifi&#233;s n&apos;a pu &#234;tre trouv&#233;e.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; des attributs de la structure et relancez la commande.
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: Il existe d&#233;j&#224; un r&#233;f&#233;rentiel de bundles du nom de {0}.
  </MsgText>
  <Explanation>
    Une tentative a &#233;t&#233; effectu&#233;e pour d&#233;finir un nouveau r&#233;f&#233;rentiel de bundles, mais le nom qui a &#233;t&#233; sp&#233;cifi&#233; pour ce r&#233;f&#233;rentiel est d&#233;j&#224; en cours d&apos;utilisation.
  </Explanation>
  <UserResponse>
    Sp&#233;cifiez un autre nom.
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: Il n&apos;&apos;est pas possible de mod&#233;liser l&apos;&apos;application Aries {0} car certains de ses composants obligatoires sont toujours en cours de t&#233;l&#233;chargement.
  </MsgText>
  <Explanation>
    Un ou plusieurs bundles requis par l&apos;application sont en cours de t&#233;l&#233;chargement. L&apos;application ne pourra &#234;tre mod&#233;lis&#233;e que lorsque tous les t&#233;l&#233;chargements seront termin&#233;s.
  </Explanation>
  <UserResponse>
    Attendez que les bundles requis soient tous t&#233;l&#233;charg&#233;s, puis refaites une tentative.
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: Impossible d&apos;&apos;ajouter l&apos;&apos;extension ou les extensions car l&apos;&apos;unit&#233; de composition est d&#233;ploy&#233;e sur les cibles suivantes, qui ne prennent pas en charge les extensions d&apos;&apos;application : {0}
  </MsgText>
  <Explanation>
    Les cibles sur lesquelles l&apos;unit&#233; de composition est d&#233;ploy&#233;e ne prennent pas toutes en charge la fonctionnalit&#233; d&apos;extension d&apos;application.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que l&apos;unit&#233; de composition &#224; laquelle vous voulez ajouter des extensions est d&#233;ploy&#233;e sur des cibles qui prennent en charge la fonctionnalit&#233; d&apos;extension d&apos;application.
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: Impossible de cr&#233;er la structure de r&#233;pertoires {0}.
  </MsgText>
  <Explanation>
    Le r&#233;pertoire ne peut pas &#234;tre cr&#233;&#233;.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;espace de stockage. V&#233;rifiez &#233;galement que le produit dispose bien des autorisations n&#233;cessaires pour cr&#233;er le r&#233;pertoire.
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: Le nom symbolique {0} et la version {1} ne correspondent &#224; aucune extension existante.
  </MsgText>
  <Explanation>
    Aucune extension dans l&apos;unit&#233; de composition ne correspond au nom symbolique et &#224; la version sp&#233;cifi&#233;s.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: Le bundle {0} ne parvient pas &#224; d&#233;marrer. Il est actuellement en l&apos;&apos;&#233;tat {1}.
  </MsgText>
  <Explanation>
    Le bundle ne parvient pas &#224; d&#233;marrer.
  </Explanation>
  <UserResponse>
    Vous trouverez dans les messages d&apos;erreur des explications d&#233;taill&#233;es des raisons qui emp&#234;chent ce bundle de d&#233;marrer.
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: Impossible de r&#233;soudre le manifeste de d&#233;ploiement &#224; importer. Les conditions requises non satisfaites sont {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement DEPLOYMENT.MF &#224; importer a une condition requise qu&apos;il est impossible de satisfaire.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le nouveau manifeste de d&#233;ploiement est complet et qu&apos;il comprend bien les bundles n&#233;cessaires &#224; la r&#233;solution de l&apos;actif EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: Un probl&#232;me s&apos;&apos;est produit lors du traitement du manifeste de l&apos;&apos;archive composite de bundles {0}.
  </MsgText>
  <Explanation>
    Soit le manifeste n&apos;est pas pr&#233;sent, soit son nom ou son format ne sont pas corrects.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la pr&#233;sence du manifeste ainsi que son format et son nom.
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: Impossible de se connecter &#224; une structure dont l&apos;&apos;ID est {0}.
  </MsgText>
  <Explanation>
    Une structure avec l&apos;ID sp&#233;cifi&#233; est introuvable.
  </Explanation>
  <UserResponse>
    V&#233;rifiez la validit&#233; de l&apos;ID et relancez la commande.
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: L&apos;&apos;archive de bundle composite (CBA) {0} exporte des services qui ne sont pas mis &#224; disposition par les bundles qu&apos;&apos;elle contient. Ces services ne pourront pas &#234;tre utilis&#233;s par les bundles hors de l&apos;&apos;archive de bundle composite (CBA). Les probl&#232;mes suivants ont &#233;t&#233; signal&#233;s : {1}
  </MsgText>
  <Explanation>
    Une archive de bundle composite (CBA) ne peut pas exporter des services pour lesquels il n&apos;existe pas de d&#233;claration Blueprint ou l&apos;en-t&#234;te Bundle-ExportService: dans l&apos;un des bundles de l&apos;archive de bundle composite (CBA).
  </Explanation>
  <UserResponse>
    Ajoutez les d&#233;clarations de service Blueprint manquantes au contenu de l&apos;archive de bundle composite (CBA) ou supprimez les d&#233;tails des exportations non satisfaites du manifeste du composite, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: Le param&#232;tre name n&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;il est obligatoire.
  </MsgText>
  <Explanation>
    La commande requiert que soit sp&#233;cifi&#233; le param&#232;tre name.
  </Explanation>
  <UserResponse>
    R&#233;&#233;mettez la commande en sp&#233;cifiant le nom.
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: Le param&#232;tre URL n&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;il est obligatoire.
  </MsgText>
  <Explanation>
    Le param&#232;tre URL doit obligatoirement &#234;tre indiqu&#233; pour la commande addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    R&#233;&#233;mettez la commande et sp&#233;cifiez l&apos;URL du r&#233;f&#233;rentiel externe de bundles.
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: Impossible de cr&#233;er la structure de r&#233;pertoires {0}.
  </MsgText>
  <Explanation>
    Vous avez tent&#233; d&apos;exporter un manifeste de d&#233;ploiement vers un r&#233;pertoire qui n&apos;existe pas et il est impossible de cr&#233;er la structure de r&#233;pertoires.
  </Explanation>
  <UserResponse>
    V&#233;rifiez l&apos;espace de stockage. V&#233;rifiez &#233;galement que le produit dispose bien des autorisations n&#233;cessaires pour cr&#233;er le r&#233;pertoire.
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: Le nom symbolique {0} et la version {1} ne correspondent &#224; aucune extension disponible dans l&apos;&apos;un des r&#233;f&#233;rentiels de bundles propos&#233;s.
  </MsgText>
  <Explanation>
    Il n&apos;existe pas de bundle composite associ&#233; au nom symbolique et &#224; la version sp&#233;cifi&#233;s dans les r&#233;f&#233;rentiels disponibles dans l&apos;environnement.
  </Explanation>
  <UserResponse>
    Ajoutez le bundle composite &#224; un r&#233;f&#233;rentiel disponible ou s&#233;lectionnez un autre bundle composite &#224; ajouter en tant qu&apos;extension.
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: D&#233;marrage en cours du bundle {0}.
  </MsgText>
  <Explanation>
    Il s&apos;agit d&apos;un message d&apos;information.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: Une erreur interne s&apos;est produite. La r&#233;solution ne g&#233;n&#232;re pas de liste de bundles &#224; installer.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: La connexion &#224; la structure {0} a r&#233;ussi.
  </MsgText>
  <Explanation>
    Il s&apos;agit d&apos;un message d&apos;information.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: Une erreur interne s&apos;&apos;est produite lors de l&apos;&apos;extraction du bundle {0} &#224; partir de l&apos;&apos;archive composite {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: Le param&#232;tre name n&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;il est obligatoire.
  </MsgText>
  <Explanation>
    Le param&#232;tre name doit obligatoirement &#234;tre indiqu&#233; pour la commande addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    R&#233;&#233;mettez la commande et sp&#233;cifiez le nom du r&#233;f&#233;rentiel externe de bundles.
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: L&apos;&apos;extension dont le nom symbolique est {0} et la version est {1} a d&#233;j&#224; &#233;t&#233; ajout&#233;e &#224; l&apos;&apos;unit&#233; de composition.
  </MsgText>
  <Explanation>
    Cette extension est d&#233;j&#224; incluse dans l&apos;unit&#233; de composition.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: Le contenu du manifeste de d&#233;ploiement n&apos;&apos;est pas correct. Les bundles suivants sont redondants : {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement DEPLOYMENT.MF &#224; importer comporte pas des bundles qui ne sont pas n&#233;cessaires &#224; la r&#233;solution de l&apos;actif EBA.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le nouveau manifeste de d&#233;ploiement ne comprend pas les bundles &#233;num&#233;r&#233;s dans le message.
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: Connexion en cours &#224; la structure {0} sur le noeud {1} et le serveur {2}.
  </MsgText>
  <Explanation>
    Vous &#234;tes en train de vous connecter &#224; la structure.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: Une erreur interne s&apos;est produite. Une tentative a &#233;t&#233; effectu&#233;e pour g&#233;n&#233;rer un objet AriesApplicationModel &#224; partir d&apos;un manifeste de d&#233;ploiement null.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: Le param&#232;tre version n&apos;a pas &#233;t&#233; sp&#233;cifi&#233; alors qu&apos;il est obligatoire.
  </MsgText>
  <Explanation>
    La commande requiert que soit sp&#233;cifi&#233; le param&#232;tre version.
  </Explanation>
  <UserResponse>
    R&#233;&#233;mettez la commande en sp&#233;cifiant la version.
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: Le contenu du manifeste de d&#233;ploiement n&apos;&apos;est pas correct. Les bundles suppl&#233;mentaires suivants sont requis : {0}.
  </MsgText>
  <Explanation>
    Le manifeste de d&#233;ploiement DEPLOYMENT.MF &#224; importer ne comporte pas tous les bundles n&#233;cessaires &#224; la r&#233;solution de l&apos;actif EBA.
  </Explanation>
  <UserResponse>
    V&#233;rifiez que le nouveau manifeste de d&#233;ploiement comprend bien tous les bundles &#233;num&#233;r&#233;s dans le message.
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: L&apos;&apos;arr&#234;t de &quot;{0}&quot; a r&#233;ussi.
  </MsgText>
  <Explanation>
    Il s&apos;agit d&apos;un message d&apos;information.
  </Explanation>
  <UserResponse>
    Aucune action n&apos;est requise.
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: Une erreur interne s&apos;est produite. Une tentative a &#233;t&#233; effectu&#233;e pour g&#233;n&#233;rer un objet AriesApplicationModel &#224; partir d&apos;un manifeste d&apos;application null.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
