<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: Ocorreu um erro interno. Um filtro de servi&#231;o n&#227;o p&#244;de ser analisado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: Ocorreu um erro interno. O aplicativo OSGi {0} na vers&#227;o {1} n&#227;o est&#225; em um estado v&#225;lido para solicitar recursos.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: Ocorreu um erro interno. Um filtro de servi&#231;o n&#227;o p&#244;de ser analisado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: Diversos contextos de persist&#234;ncia com o nome {0} foram localizados pelo pacote configur&#225;vel da Web {1} na vers&#227;o {2}.
  </MsgText>
  <Explanation>
    O cont&#234;iner OSGi JPA localizou diversos contextos de persist&#234;ncia com o mesmo nome. Essa n&#227;o &#233; uma configura&#231;&#227;o v&#225;lida e pode conduzir a resultados inconsistentes.
  </Explanation>
  <UserResponse>
    Altere o aplicativo OSGi para que n&#227;o contenha mais os pacotes configur&#225;veis que definem diversos contextos de persist&#234;ncia com o mesmo nome.
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: Um pacote configur&#225;vel da Web OSGi {0} na vers&#227;o {1} define uma depend&#234;ncia no contexto de persist&#234;ncia JPA gerenciado {2} com escopo estendido. Os contextos de persist&#234;ncia de escopo estendido n&#227;o s&#227;o suportados pelo cont&#234;iner OSGi JPA.
  </MsgText>
  <Explanation>
    Um aplicativo declarou uma depend&#234;ncia em um contexto de persist&#234;ncia JPA de escopo estendido, mas os contextos de persist&#234;ncia de escopo estendido n&#227;o s&#227;o suportados no cont&#234;iner OSGi JPA.
  </Explanation>
  <UserResponse>
    Altere o aplicativo para fazer uso dos contextos de persist&#234;ncia de escopo de transa&#231;&#227;o ou gerenciados pelo aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: Ocorreu um erro interno. O ambiente de tempo de execu&#231;&#227;o de Aplicativos OSGi n&#227;o p&#244;de inicializar o suporte ao contexto de persist&#234;ncia.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: Diversas unidades de persist&#234;ncia com o nome {0} foram localizadas pelo pacote configur&#225;vel da Web {1} na vers&#227;o {2}.
  </MsgText>
  <Explanation>
    O cont&#234;iner OSGi JPA localizou diversas unidades de persist&#234;ncia com o mesmo nome. Essa n&#227;o &#233; uma configura&#231;&#227;o v&#225;lida e pode conduzir a resultados inconsistentes.
  </Explanation>
  <UserResponse>
    Altere o aplicativo OSGi para que n&#227;o contenha mais os pacotes configur&#225;veis que definem diversas unidades de persist&#234;ncia com o mesmo nome.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
