<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: Ocorreu um erro interno. Um manifesto do pacote configur&#225;vel composto deve conter exatamente uma entrada Bundle-SymbolicName. Foi localizada a seguinte entrada: {0}.
  </MsgText>
  <Explanation>
    O ambiente de tempo de execu&#231;&#227;o tentou processar os metadados para um pacote configur&#225;vel composto e n&#227;o p&#244;de determinar o nome simb&#243;lico do pacote configur&#225;vel.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: Ocorreu um erro de sintaxe durante uma tentativa de analisar a sequ&#234;ncia de filtros de projeto &apos;&apos;{0}&apos;&apos; para o elemento com id {1}: {2}
  </MsgText>
  <Explanation>
    Uma InvalidSyntaxException foi emitida durante uma tentativa de analisar a sequ&#234;ncia de filtros para o elemento com o ID especificado.
  </Explanation>
  <UserResponse>
    Verifique se a sequ&#234;ncia de filtros para o ID especificado est&#225; sintaticamente correta.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: Ocorreu um erro interno. Um manifesto do pacote configur&#225;vel deve conter exatamente uma entrada Bundle-SymbolicName. Foi localizada a seguinte entrada: {0}.
  </MsgText>
  <Explanation>
    O tempo de execu&#231;&#227;o tentou processar os metadados para um pacote configur&#225;vel e n&#227;o p&#244;de determinar o nome simb&#243;lico do pacote configur&#225;vel.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: Ocorreu um erro interno. Um manifesto de fragmento do pacote configur&#225;vel deve definir exatamente uma entrada Fragment-Host. Foi localizada a seguinte entrada: {0}.
  </MsgText>
  <Explanation>
    O ambiente de tempo de execu&#231;&#227;o tentou processar os metadados para um fragmento de pacote configur&#225;vel e n&#227;o p&#244;de determinar o pacote configur&#225;vel de host do fragmento.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: Ocorreu um erro interno. Um pacote configur&#225;vel composto com o nome simb&#243;lico {0} e vers&#227;o de manifesto {1} n&#227;o p&#244;de ser processado.
  </MsgText>
  <Explanation>
    Um manifesto do pacote configur&#225;vel composto deve conter uma entrada v&#225;lida Bundle-SymbolicName e CompositeBundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    Verifique se todos os pacotes configur&#225;veis compostos cont&#234;m uma entrada Bundle-SymbolicName e CompositeBundle-ManifestVersion v&#225;lida em seus arquivos de manifesto.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: Ocorreu um erro interno. Um pacote configur&#225;vel com o nome simb&#243;lico {0} e vers&#227;o de manifesto {1} n&#227;o p&#244;de ser processado.
  </MsgText>
  <Explanation>
    Um manifesto do pacote configur&#225;vel deve conter uma entrada v&#225;lida Bundle-SymbolicName e Bundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    Verifique se todos os pacotes configur&#225;veis cont&#234;m uma entrada Bundle-SymbolicName e Bundle-ManifestVersion v&#225;lida em seus arquivos de manifesto.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
