<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: O par&#226;metro symbolicName n&#227;o foi especificado e &#233; necess&#225;rio.
  </MsgText>
  <Explanation>
    O comando requer que o par&#226;metro symbolicName seja especificado.
  </Explanation>
  <UserResponse>
    Emita novamente o comando especificando o symbolicName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: N&#227;o &#233; poss&#237;vel localizar o manifesto de implementa&#231;&#227;o do local {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, a ser importado n&#227;o existe.
  </Explanation>
  <UserResponse>
    Verifique se o caminho do manifesto de implementa&#231;&#227;o est&#225; correto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: N&#227;o foi poss&#237;vel remover os pacotes configur&#225;veis {0} do reposit&#243;rio interno de pacotes configur&#225;veis. Todos os outros pacotes configur&#225;veis {1} foram removidos com &#234;xito.
  </MsgText>
  <Explanation>
    N&#227;o foi poss&#237;vel excluir alguns pacotes configur&#225;veis do reposit&#243;rio interno de pacotes configur&#225;veis.
  </Explanation>
  <UserResponse>
    Pare todos os aplicativos que possam estar usando os pacotes configur&#225;veis que n&#227;o puderam ser exclu&#237;dos e, em seguida, tente remov&#234;-los novamente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: O pacote configur&#225;vel {0} j&#225; est&#225; interrompido.
  </MsgText>
  <Explanation>
    N&#227;o &#233; poss&#237;vel parar o bundle porque ele j&#225; est&#225; interrompido.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: N&#227;o &#233; poss&#237;vel excluir o pacote configur&#225;vel {0} porque os seguintes Archives de Pacotes Configur&#225;veis Compostos t&#234;m uma depend&#234;ncia no pacote configur&#225;vel: {1}.
  </MsgText>
  <Explanation>
    Um bundle n&#227;o poder&#225; ser exclu&#237;do do bundle repository interno se um Composite Bundle Archive depender desse bundle.
  </Explanation>
  <UserResponse>
    Para excluir o bundle, primeiro exclua os Composite Bundle Archives listados e, em seguida,exclua esse bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: N&#227;o &#233; poss&#237;vel obter os recursos necess&#225;rios para recursos do tipo JPA2.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: N&#227;o &#233; poss&#237;vel localizar o servi&#231;o com ID {0}.
  </MsgText>
  <Explanation>
    O ID do servi&#231;o fornecido para o comando n&#227;o corresponde a um servi&#231;o no registro.
  </Explanation>
  <UserResponse>
    Tente o comando novamente com um ID do servi&#231;o v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: O pacote configur&#225;vel {1} com vers&#227;o {2}, definido no arquivo {0}, j&#225; existe no reposit&#243;rio.
  </MsgText>
  <Explanation>
    O bundle n&#227;o pode ser inclu&#237;do no reposit&#243;rio porque o bundle j&#225; existe no reposit&#243;rio.
  </Explanation>
  <UserResponse>
    Verifique se o bundle no reposit&#243;rio &#233; o correto. Se o bundle no reposit&#243;rio n&#227;o for o correto, remova-o do reposit&#243;rio antes de incluir o bundle correto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: O par&#226;metro cuName n&#227;o foi especificado e &#233; necess&#225;rio.
  </MsgText>
  <Explanation>
    O comando requer que o par&#226;metro cuName seja especificado.
  </Explanation>
  <UserResponse>
    Emita novamente o comando especificando o cuName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: As refer&#234;ncias de servi&#231;o no conte&#250;do do Composite Bundle Archive (CBA) {0} n&#227;o podem ser resolvidas. Se estes servi&#231;os forem fornecidos por pacotes configur&#225;veis que n&#227;o est&#227;o inclu&#237;dos no CBA, o CBA dever&#225; import&#225;-los. As seguintes depend&#234;ncias de servi&#231;o n&#227;o foram resolvidas: {1}
  </MsgText>
  <Explanation>
    Se um pacote configur&#225;vel em um Composite Bundle Archive (CBA) usar um servi&#231;o que n&#227;o est&#225; contido no pacote configur&#225;vel, ou exportado por um outro pacote configur&#225;vel no CBA, o CBA dever&#225; importar o servi&#231;o.
  </Explanation>
  <UserResponse>
    Corrija o manifesto composto, COMPOSITEBUNDLE.MF, para que o CBA importe qualquer servi&#231;o que seja usado por pacotes configur&#225;veis no CBA e n&#227;o esteja de outra forma dispon&#237;vel no CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel localizar o manifesto de implementa&#231;&#227;o no recurso EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: Ocorreu um erro interno. N&#227;o foi poss&#237;vel remover do reposit&#243;rio interno de pacotes configur&#225;veis os metadados dos pacotes configur&#225;veis {0}. Al&#233;m disso, os pacotes configur&#225;veis {1} n&#227;o puderam ser exclu&#237;dos do reposit&#243;rio. A exce&#231;&#227;o era {2}
  </MsgText>
  <Explanation>
    N&#227;o foi poss&#237;vel excluir alguns pacotes configur&#225;veis do reposit&#243;rio interno de pacotes configur&#225;veis e, em outros, os metadados n&#227;o puderam ser removidos. Agora o sistema pode estar em um estado inconsistente.
  </Explanation>
  <UserResponse>
    Descarte as altera&#231;&#245;es na &#225;rea de trabalho atual e tente remover os pacotes configur&#225;veis um por vez.
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: O pacote configur&#225;vel {0} foi iniciado com &#234;xito.
  </MsgText>
  <Explanation>
    Essa mensagem &#233; apenas informativa.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: N&#227;o &#233; poss&#237;vel obter informa&#231;&#245;es porque voc&#234; n&#227;o est&#225; conectado a uma estrutura.
  </MsgText>
  <Explanation>
    Voc&#234; n&#227;o est&#225; conectado atualmente com uma estrutura.
  </Explanation>
  <UserResponse>
    Use o comando de conex&#227;o para conectar-se com uma estrutura. Para obter uma lista de estruturas dispon&#237;veis, use o comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel localizar o servi&#231;o do Launcher.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: N&#227;o &#233; poss&#237;vel localizar o pacote configur&#225;vel de ID {0}.
  </MsgText>
  <Explanation>
    O ID do bundle fornecido n&#227;o corresponde a um bundle na estrutura.
  </Explanation>
  <UserResponse>
    Tente o comando novamente com um ID do bundle v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: O arquivo {0} especificado n&#227;o cont&#233;m nenhum manifesto de pacote configur&#225;vel v&#225;lido.
  </MsgText>
  <Explanation>
    O arquivo especificado n&#227;o &#233; um bundle do OSGi.
  </Explanation>
  <UserResponse>
    Verifique e corrija o manifesto do bundle do arquivo fornecido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: Ocorreu um erro interno. Um servi&#231;o de tempo de execu&#231;&#227;o n&#227;o est&#225; dispon&#237;vel no registro de servi&#231;o OSGi: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: O recurso {0} fornecido n&#227;o &#233; um recurso EBA.
  </MsgText>
  <Explanation>
    O recurso fornecido n&#227;o &#233; um recurso do enterprise bundle archive (EBA).
  </Explanation>
  <UserResponse>
    Certifique-se de que o recurso fornecido seja um recurso EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: Ocorreu um erro interno. N&#227;o foi poss&#237;vel remover do reposit&#243;rio interno de pacotes configur&#225;veis os metadados dos pacotes configur&#225;veis {0}. A exce&#231;&#227;o era {1}
  </MsgText>
  <Explanation>
    N&#227;o foi poss&#237;vel remover os pacotes configur&#225;veis  do reposit&#243;rio interno de pacotes configur&#225;veis. Agora o sistema pode estar em um estado inconsistente.
  </Explanation>
  <UserResponse>
    Descarte as altera&#231;&#245;es na &#225;rea de trabalho atual e tente remover os pacotes configur&#225;veis um por vez.
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: O pacote configur&#225;vel {0} j&#225; est&#225; iniciado.
  </MsgText>
  <Explanation>
    N&#227;o &#233; poss&#237;vel iniciar o bundle porque ele j&#225; est&#225; iniciado.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: O filtro de servi&#231;o n&#227;o &#233; v&#225;lido: {0}.
  </MsgText>
  <Explanation>
    O filtro de servi&#231;o fornecido n&#227;o &#233; v&#225;lido.
  </Explanation>
  <UserResponse>
    Verifique se o filtro de servi&#231;o &#233; v&#225;lido e tente novamente o comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: Ocorreu um erro interno. O servi&#231;o do gerador de reposit&#243;rio n&#227;o est&#225; dispon&#237;vel no service registry do OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: N&#227;o &#233; poss&#237;vel obter informa&#231;&#245;es do servi&#231;o porque voc&#234; n&#227;o est&#225; conectado a uma estrutura.
  </MsgText>
  <Explanation>
    Voc&#234; n&#227;o est&#225; conectado atualmente com uma estrutura.
  </Explanation>
  <UserResponse>
    Use o comando de conex&#227;o para conectar-se com uma estrutura. Para obter uma lista de estruturas dispon&#237;veis, use o comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: O pacote configur&#225;vel {0} contido no archive do pacote configur&#225;vel composto {1} n&#227;o cont&#233;m um manifesto do pacote configur&#225;vel v&#225;lido.
  </MsgText>
  <Explanation>
    O arquivo especificado n&#227;o &#233; um bundle do OSGi.
  </Explanation>
  <UserResponse>
    Verifique e corrija o manifesto do bundle do arquivo fornecido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: O Composite Bundle Archive (CBA) {0} n&#227;o &#233; v&#225;lido. Os pacotes importados por pacotes configur&#225;veis no CBA est&#227;o ausentes no cabe&#231;alho Import-Package do arquivo de manifesto do CBA. Os seguintes problemas foram relatados: {1}
  </MsgText>
  <Explanation>
    Se um pacote configur&#225;vel em um Composite Bundle Archive (CBA) usar um pacote que n&#227;o est&#225; contido no pacote configur&#225;vel, ou exportado por um outro pacote configur&#225;vel dentro do CBA, o CBA dever&#225; importar o pacote.
  </Explanation>
  <UserResponse>
    Corrija o manifesto composto, COMPOSITEBUNDLE.MF, para que o CBA importe qualquer pacote que seja usado por pacotes configur&#225;veis no CBA e n&#227;o esteja de outra forma dispon&#237;vel no CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: A conex&#227;o n&#227;o est&#225; mais dispon&#237;vel. Verifique as conex&#245;es dispon&#237;veis e reconete-se, se necess&#225;rio.
  </MsgText>
  <Explanation>
    A estrutura com a qual voc&#234; estava conectado n&#227;o est&#225; mais dispon&#237;vel. Isso pode ter ocorrido porque um aplicativo foi parado.
  </Explanation>
  <UserResponse>
    Verifique se a estrutura ainda est&#225; dispon&#237;vel e reconete-se, se necess&#225;rio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: A sequ&#234;ncia {0} n&#227;o corresponde &#224; sintaxe correta de symbolicname;version.
  </MsgText>
  <Explanation>
    N&#227;o foi poss&#237;vel processar a sequ&#234;ncia fornecida na lista de pacotes configur&#225;veis a serem removidos porque ela n&#227;o correspondia &#224; sintaxe esperada.
  </Explanation>
  <UserResponse>
    Corrija a sintaxe da sequ&#234;ncia fornecida.
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: N&#227;o &#233; poss&#237;vel obter informa&#231;&#245;es do cabe&#231;alho porque voc&#234; n&#227;o est&#225; conectado a uma estrutura.
  </MsgText>
  <Explanation>
    Voc&#234; n&#227;o est&#225; conectado atualmente com uma estrutura.
  </Explanation>
  <UserResponse>
    Use o comando de conex&#227;o para conectar-se com uma estrutura. Para obter uma lista de estruturas dispon&#237;veis, use o comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: N&#227;o &#233; poss&#237;vel localizar o pacote de nome {0}.
  </MsgText>
  <Explanation>
    O nome do pacote fornecido para o comando n&#227;o corresponde a um pacote na estrutura.
  </Explanation>
  <UserResponse>
    Verifique se o nome do pacote &#233; v&#225;lido e tente novamente o comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: O pacote configur&#225;vel {0} especificado com vers&#227;o {1} n&#227;o existe no reposit&#243;rio local de pacotes configur&#225;veis .
  </MsgText>
  <Explanation>
    O bundle n&#227;o pode ser mostrado ou exclu&#237;do porque n&#227;o existe nenhum bundle com esse nome.
  </Explanation>
  <UserResponse>
    Verifique e corrija a vers&#227;o ou o nome simb&#243;lico do bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: N&#227;o &#233; poss&#237;vel obter informa&#231;&#245;es do pacote configur&#225;vel porque voc&#234; n&#227;o est&#225; conectado a uma estrutura.
  </MsgText>
  <Explanation>
    Voc&#234; n&#227;o est&#225; conectado atualmente com uma estrutura.
  </Explanation>
  <UserResponse>
    Use o comando de conex&#227;o para conectar-se com uma estrutura. Para obter uma lista de estruturas dispon&#237;veis, use o comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: O reposit&#243;rio de pacotes configur&#225;veis {0} n&#227;o existe.
  </MsgText>
  <Explanation>
    Foi feita uma tentativa de modificar o bundle repository, mas ele n&#227;o existe.
  </Explanation>
  <UserResponse>
    Crie o bundle repository.
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: O arquivo especificado {0} n&#227;o pode ser analisado como um arquivo de manifesto devido &#224; exce&#231;&#227;o {1}
  </MsgText>
  <Explanation>
    O arquivo especificado n&#227;o aparece para ser um arquivo de manifesto v&#225;lido.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo fornecido &#233; um arquivo de manifesto v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: N&#227;o &#233; poss&#237;vel localizar o pacote com o local {0}.
  </MsgText>
  <Explanation>
    O local do pacote fornecido para o comando n&#227;o corresponde a um local do pacote na estrutura.
  </Explanation>
  <UserResponse>
    Verifique se o local do pacote &#233; v&#225;lido e tente novamente o comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      Console do aplicativo OSGi
 
 Comandos de exibi&#231;&#227;o: estes comandos funcionam somente quando conectados a uma estrutura
 
     ss()                - Este comando fornece informa&#231;&#245;es resumidas sobre os pacotes configurados instalados.
     bundles()           - Esse comando fornece informa&#231;&#245;es abrangentes sobre os pacotes configur&#225;veis instalados.
     packages()          - Esse comando fornece informa&#231;&#245;es sobre os pacotes importados/exportados.
     services()          - Esse comando fornece informa&#231;&#245;es sobre os Services registrados.
 
     bundle(&lt;bundleID&gt;)  - Esse comando fornece informa&#231;&#245;es sobre o bundle especificado
     headers(&lt;bundleID&gt;) - Esse comando fornece informa&#231;&#245;es sobre os cabe&#231;alhos associados ao bundle especificado
     packages(&lt;bundle ID&gt;) - Esse comando fornece informa&#231;&#245;es sobre os pacotes exportados para esse bundle.
     packages(&lt;package Name&gt;) - Esse comando fornece informa&#231;&#245;es sobre o pacote especificado.
     services(&lt;service ID&gt;) - Esse comando fornece informa&#231;&#245;es sobre o servi&#231;o especificado.
     services(&lt;OSGI Filter&gt;) - Esse comando fornece informa&#231;&#245;es sobre os servi&#231;os que correspondem ao filtro.
 
     refresh() - Esse comando atualiza o cache do OSGi application console interno com as informa&#231;&#245;es mais recentes sobre o estado da estrutura.
 
 Comandos da estrutura:
 
     list() - Esse comando lista as estruturas dispon&#237;veis com as quais &#233; poss&#237;vel se conectar.
     connect(&lt;Framework id&gt;) - Este comando estabelece a conex&#227;o &#224; estrutura especificada.
     connect(&lt;Bundle Name&gt;, &lt;Bundle Version&gt;, &lt;Node Name&gt;, &lt;Server Name&gt;) - Esse comando conecta-se &#224; estrutura especificada.
 
 Bundles de Controle:
 
     start(&lt;bundleID&gt;) - Esse comando inicia o bundle solicitado.
     stop(&lt;bundleID&gt;   - Esse comando para o bundle solicitado.
  </MsgText>
  <Explanation>
    Nenhuma.
  </Explanation>
  <UserResponse>
    Nenhuma.
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: O arquivo {0} especificado n&#227;o &#233; um JAR nem um Archive de Pacotes Configur&#225;veis Compostos.
  </MsgText>
  <Explanation>
    O nome do arquivo especificado n&#227;o termina com uma extens&#227;o .jar ou .cba.
  </Explanation>
  <UserResponse>
    Verifique e corrija o nome do arquivo fornecido. O arquivo fornecido deve ser um JAR ou um Composite Bundle Archive (CBA) v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: N&#227;o &#233; poss&#237;vel localizar o pacote de ID {0}.
  </MsgText>
  <Explanation>
    O package ID fornecido para o comando n&#227;o corresponde a um pacote na estrutura.
  </Explanation>
  <UserResponse>
    Verifique se o package ID &#233; v&#225;lido e tente novamente o comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: O cabe&#231;alho CompositeBundle-Content no Archive de Pacotes Configur&#225;veis Compostos {0} deve conter apenas pacotes configur&#225;veis com uma vers&#227;o exata. As seguintes entradas n&#227;o s&#227;o v&#225;lidas: {1}.
  </MsgText>
  <Explanation>
    Uma entrada do CompositeBundle-Content deve usar um formato semelhante a &apos;bundle.name;version=&quot;[1.0.0,1.0.0]&quot;&apos;.
  </Explanation>
  <UserResponse>
    Certifique-se de que as entradas no cabe&#231;alho CompositeBundle-Content no arquivo manifesto do bundle composto especifica uma vers&#227;o exata e use o formato correto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: N&#227;o &#233; poss&#237;vel instalar o Archive de Pacotes Configur&#225;veis Compostos {0} porque os seguintes pacotes de exporta&#231;&#227;o s&#227;o diferentes daqueles contidos no Archive de Pacotes Configur&#225;veis Compostos: {1}
  </MsgText>
  <Explanation>
    Um Composite Bundle Archive (CBA) pode exportar apenas os packages cujos pacotes configur&#225;veis que ele cont&#233;m tamb&#233;m s&#227;o exportados. Os atributos e diretivas tamb&#233;m devem corresponder.
  </Explanation>
  <UserResponse>
    Corrija o manifesto composto, COMPOSITEBUNDLE.MF, para que ele exporte os pacotes cujos pacotes configur&#225;veis que o CBA cont&#233;m tamb&#233;m s&#227;o exportados.
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: A funcionalidade da extens&#227;o do aplicativo n&#227;o est&#225; dispon&#237;vel para esta unidade de composi&#231;&#227;o porque a unidade de composi&#231;&#227;o &#233; implementada nos seguintes destinos, que n&#227;o suportam a extens&#227;o de aplicativo: {0}
  </MsgText>
  <Explanation>
    Nem todos os destinos nos quais a unidade de composi&#231;&#227;o &#233; implementada suportam a funcionalidade da extens&#227;o do aplicativo.
  </Explanation>
  <UserResponse>
    Certifique-se de que a unidade de composi&#231;&#227;o na qual deseja incluir as extens&#245;es esteja implementada nos destinos que suportam a funcionalidade de extens&#227;o do aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: N&#227;o &#233; poss&#237;vel parar o pacote configur&#225;vel {0}. Atualmente ele est&#225; no estado {1}.
  </MsgText>
  <Explanation>
    O bundle n&#227;o pode ser parado.
  </Explanation>
  <UserResponse>
    Consulte as mensagens de erro exibidas para obter mais informa&#231;&#245;es sobre o por que esse bundle n&#227;o pode parar.
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: O par&#226;metro {0} n&#227;o foi especificado e &#233; obrigat&#243;rio para o comando {1}.
  </MsgText>
  <Explanation>
    Esse comando requer o par&#226;metro especificado.
  </Explanation>
  <UserResponse>
    Tente o comando novamente e especifique o par&#226;metro necess&#225;rio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: As estruturas v&#225;lidas s&#227;o:
  </MsgText>
  <Explanation>
    Essa mensagem &#233; apenas informativa.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: Os seguintes pacotes configur&#225;veis que o Archive de Pacotes Configur&#225;veis Compostos {0} requer n&#227;o pode ser encontrado no reposit&#243;rio de pacotes configur&#225;veis interno: {1}.
  </MsgText>
  <Explanation>
    Um Composite Bundle Archive pode ser implementado apenas se todas as depend&#234;ncias puderem ser localizadas no bundle repository interno.
  </Explanation>
  <UserResponse>
    Certifique-se de que as depend&#234;ncias do Composite Bundle Archive listadas estejam no Composite Bundle Archive ou instaladas no reposit&#243;rio interno de pacotes configur&#225;veis.
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: Ocorreu um problema de resolu&#231;&#227;o ao incluir uma extens&#227;o na unidade de composi&#231;&#227;o {0}. A exce&#231;&#227;o &#233;: {1}
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode resolver a extens&#227;o selecionada em conjunto com a implementa&#231;&#227;o atual do recurso. Os pacotes configur&#225;veis podem ter depend&#234;ncias ausentes, ser incompat&#237;veis ou n&#227;o existir.
  </Explanation>
  <UserResponse>
    Inspecione o erro. Fa&#231;a todas as mudan&#231;as necess&#225;rias no recurso e na extens&#227;o e, em seguida, reaplique a extens&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: O reposit&#243;rio de pacotes configur&#225;veis em {0} j&#225; est&#225; definido com o nome {1}.
  </MsgText>
  <Explanation>
    Foi feita uma tentativa para definir um novo bundle repository, mas outro bundle repository j&#225; est&#225; usando a URL especificada.
  </Explanation>
  <UserResponse>
    Especifique uma URL diferente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: Ocorreu um erro interno. Tentativa de gerar um objeto AriesApplicationModel a partir de uma URL n&#227;o-arquivo {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: N&#227;o &#233; poss&#237;vel localizar o recurso EBA {0}.
  </MsgText>
  <Explanation>
    Voc&#234; importou um manifesto de implementa&#231;&#227;o em um recurso, mas o recurso enterprise bundle archive (EBA) n&#227;o existe.
  </Explanation>
  <UserResponse>
    Verifique se o recurso EBA est&#225; instalado.
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: Parando o pacote configur&#225;vel {0}.
  </MsgText>
  <Explanation>
    Essa mensagem &#233; apenas informativa.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: Ocorreu um problema de resolu&#231;&#227;o ao remover uma extens&#227;o da unidade de composi&#231;&#227;o {0}. A exce&#231;&#227;o &#233;: {1}
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode resolver a extens&#227;o selecionada em conjunto com a implementa&#231;&#227;o atual do recurso. Os pacotes configur&#225;veis podem ter depend&#234;ncias ausentes, ser incompat&#237;veis ou n&#227;o existir.
  </Explanation>
  <UserResponse>
    Inspecione o erro. Fa&#231;a todas as mudan&#231;as necess&#225;rias no recurso e, em seguida, remova, como um conjunto, a extens&#227;o e qualquer outra extens&#227;o interdependente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: O manifesto de implementa&#231;&#227;o a ser importado n&#227;o &#233; v&#225;lido para o recurso {0} porque ele n&#227;o satisfaz aos requisitos no manifesto do aplicativo.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, n&#227;o &#233; compat&#237;vel com o manifesto de aplicativo, APPLICATION.MF, do recurso.
  </Explanation>
  <UserResponse>
    Verifique o novo manifesto de implementa&#231;&#227;o para o seguinte:
   1. O Application-SymbolicName e o Application-Version no arquivo DEPLOYMENT.MF devem corresponder &#224;s entradas correspondentes no arquivo APPLICATION.MF.
 2. Os pacotes configur&#225;veis listados no cabe&#231;alho Deployed-Content no arquivo DEPLOYMENT.MF devem corresponder aos pacotes configur&#225;veis listados no cabe&#231;alho Application-Content no arquivo APPLICATION.MF.
 3. A vers&#227;o do pacote configur&#225;vel no cabe&#231;alho Deployed-Content no arquivo DEPLOYMENT.MF deve estar dentro do intervalo de vers&#227;o para o pacote configur&#225;vel correspondente no arquivo APPLICATION.MF.
 4. Os pacotes configur&#225;veis listados no cabe&#231;alho Deployed-Use-Bundle no arquivo DEPLOYMENT.MF tamb&#233;m devem estar listados no cabe&#231;alho Use-Bundle no arquivo APPLICATION.MF.
   5. A vers&#227;o do pacote configur&#225;vel no cabe&#231;alho Deployed-Use-Bundle no arquivo DEPLOYMENT.MF deve estar dentro do intervalo de vers&#227;o para o pacote configur&#225;vel correspondente no cabe&#231;alho Use-Bundle no arquivo APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: A implementa&#231;&#227;o do Archive de Pacotes Configur&#225;veis Compostos {0} tem depend&#234;ncia de outro Archive de Pacotes Configur&#225;veis Compostos, {1}.
  </MsgText>
  <Explanation>
    O aninhamento do Composite Bundle Archives n&#227;o &#233; suportado.
  </Explanation>
  <UserResponse>
    Verifique se o Composite Bundle Archive depende apenas de pacotes configur&#225;veis no cabe&#231;alho CompositeBundle-Content do manifesto do Composite Bundle Archive.
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: N&#227;o &#233; poss&#237;vel se conectar a uma estrutura de nome {0}, nome de n&#243; {1} e nome de servidor {2}.
  </MsgText>
  <Explanation>
    Uma estrutura com os atributos especificados n&#227;o p&#244;de ser localizada.
  </Explanation>
  <UserResponse>
    Verifique se os atributos da estrutura s&#227;o v&#225;lidos e tente novamente o comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: J&#225; existe um reposit&#243;rio de pacotes configur&#225;veis de nome {0}.
  </MsgText>
  <Explanation>
    Foi feita uma tentativa para definir um novo bundle repository, mas o nome especificado j&#225; est&#225; em uso.
  </Explanation>
  <UserResponse>
    Especifique um nome diferente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: N&#227;o &#233; poss&#237;vel modelar o aplicativo {0} da Aries porque alguns dos componentes necess&#225;rios ainda est&#227;o sendo transferidos por download.
  </MsgText>
  <Explanation>
    Um ou mais pacotes configur&#225;veis que o aplicativo requer est&#227;o sendo transferidos por download. O aplicativo n&#227;o pode ser modelado at&#233; que todos os downloads sejam conclu&#237;dos.
  </Explanation>
  <UserResponse>
    Aguarde at&#233; que todos os pacotes configur&#225;veis necess&#225;rios sejam transferidos por download e tente novamente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: N&#227;o &#233; poss&#237;vel incluir a(s) extens&#227;o(&#245;es) porque a unidade de composi&#231;&#227;o est&#225; implementada nos seguintes destinos, que n&#227;o suportam a extens&#227;o do aplicativo: {0}
  </MsgText>
  <Explanation>
    Nem todos os destinos nos quais a unidade de composi&#231;&#227;o &#233; implementada suportam a funcionalidade da extens&#227;o do aplicativo.
  </Explanation>
  <UserResponse>
    Certifique-se de que a unidade de composi&#231;&#227;o na qual deseja incluir as extens&#245;es esteja implementada nos destinos que suportam a funcionalidade de extens&#227;o do aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: N&#227;o &#233; poss&#237;vel criar a estrutura de diret&#243;rios {0}.
  </MsgText>
  <Explanation>
    O diret&#243;rio n&#227;o pode ser criado.
  </Explanation>
  <UserResponse>
    Verifique se o espa&#231;o de armazenamento existe e se o produto possui as permiss&#245;es necess&#225;rias para criar o diret&#243;rio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: O nome simb&#243;lico {0} e a vers&#227;o {1} n&#227;o correspondem a qualquer extens&#227;o existente.
  </MsgText>
  <Explanation>
    N&#227;o h&#225; extens&#245;es na unidade de composi&#231;&#227;o que correspondam ao nome simb&#243;lico e vers&#227;o especificados.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: N&#227;o &#233; poss&#237;vel iniciar o pacote configur&#225;vel {0}. Atualmente ele est&#225; no estado {1}.
  </MsgText>
  <Explanation>
    O bundle n&#227;o pode ser iniciado.
  </Explanation>
  <UserResponse>
    Consulte as mensagens de erro exibidas para obter mais informa&#231;&#245;es sobre o por que esse bundle n&#227;o pode iniciar.
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: N&#227;o &#233; poss&#237;vel resolver o manifesto de implementa&#231;&#227;o a ser importado. Os requisitos n&#227;o atendidos s&#227;o {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, a ser importado possui um requisito que n&#227;o pode ser atendido.
  </Explanation>
  <UserResponse>
    Verifique se o novo manifesto de implementa&#231;&#227;o est&#225; completo e se inclui os pacotes configur&#225;veis necess&#225;rios para resolver o recurso enterprise bundle archive (EBA).
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: Ocorreu um problema ao processar o manifesto do Archive de Pacotes Configur&#225;veis Compostos {0}.
  </MsgText>
  <Explanation>
    O manifesto n&#227;o est&#225; presente ou o nome ou o formato n&#227;o est&#227;o corretos.
  </Explanation>
  <UserResponse>
    Verifique se o manifesto est&#225; presente, formatado e nomeado corretamente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: N&#227;o &#233; poss&#237;vel se conectar a uma estrutura de ID {0}.
  </MsgText>
  <Explanation>
    Uma estrutura com o ID especificado n&#227;o p&#244;de ser localizada.
  </Explanation>
  <UserResponse>
    Verifique se o ID da estrutura &#233; v&#225;lido e tente novamente o comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: O Composite Bundle Archive (CBA) {0} exporta servi&#231;os que n&#227;o s&#227;o fornecidos por pacotes configur&#225;veis contidos no CBA. Estes servi&#231;os n&#227;o estar&#227;o dispon&#237;veis para uso por pacotes configur&#225;veis fora do CBA. Os seguintes problemas foram relatados: {1}
  </MsgText>
  <Explanation>
    Um CBA n&#227;o pode exportar servi&#231;os para os quais n&#227;o h&#225; declara&#231;&#227;o de Blueprint ou o cabe&#231;alho Bundle-ExportService: em um dos pacotes configur&#225;veis no CBA.
  </Explanation>
  <UserResponse>
    Inclua as declara&#231;&#245;es de servi&#231;o Blueprint ausentes no conte&#250;do do CBA ou remova os detalhes das exporta&#231;&#245;es insatisfeitas do manifesto composto, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: O par&#226;metro de nome obrigat&#243;rio n&#227;o foi especificado.
  </MsgText>
  <Explanation>
    O comando requer que o par&#226;metro de nome seja especificado.
  </Explanation>
  <UserResponse>
    Emita o comando que especifica o nome novamente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: O par&#226;metro URL obrigat&#243;rio n&#227;o foi especificado.
  </MsgText>
  <Explanation>
    O par&#226;metro de URL &#233; necess&#225;rio para o comando addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    Emita novamente o comando e especifique a URL do bundle repository externo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: N&#227;o &#233; poss&#237;vel criar a estrutura de diret&#243;rios {0}.
  </MsgText>
  <Explanation>
    Voc&#234; tentou exportar um manifesto de implementa&#231;&#227;o em um diret&#243;rio que n&#227;o existe e a estrutura de diret&#243;rio n&#227;o pode ser criada.
  </Explanation>
  <UserResponse>
    Verifique se o espa&#231;o de armazenamento existe e se o produto possui as permiss&#245;es necess&#225;rias para criar o diret&#243;rio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: O nome simb&#243;lico {0} e a vers&#227;o {1} n&#227;o corresponde a qualquer extens&#227;o dispon&#237;vel em qualquer reposit&#243;rio dispon&#237;vel de pacotes configur&#225;veis.
  </MsgText>
  <Explanation>
    N&#227;o h&#225; pacote configur&#225;vel composto com o nome simb&#243;lico especificado e a vers&#227;o em qualquer reposit&#243;rio dispon&#237;vel no ambiente.
  </Explanation>
  <UserResponse>
    Inclua o pacote configur&#225;vel composto em um reposit&#243;rio dispon&#237;vel ou selecione um pacote configur&#225;vel composto diferente para incluir como uma extens&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: Iniciando pacote configur&#225;vel {0}.
  </MsgText>
  <Explanation>
    Essa mensagem &#233; apenas informativa.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: Ocorreu um erro interno. O processo de resolu&#231;&#227;o n&#227;o gera uma lista de pacotes configur&#225;veis a serem instalados.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: Conectado com &#234;xito &#224; estrutura {0}.
  </MsgText>
  <Explanation>
    Essa mensagem &#233; apenas informativa.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: Ocorreu um erro interno ao extrair o pacote configur&#225;vel {0} do Archive de Pacotes Configur&#225;veis Compostos {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: O par&#226;metro de nome obrigat&#243;rio n&#227;o foi especificado.
  </MsgText>
  <Explanation>
    O par&#226;metro de nome &#233; necess&#225;rio para o comando addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    Emita novamente o comando e especifique o nome do bundle repository externo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: A extens&#227;o com o nome simb&#243;lico {0} e a vers&#227;o {1} j&#225; foi inclu&#237;da na unidade de composi&#231;&#227;o.
  </MsgText>
  <Explanation>
    Esta extens&#227;o j&#225; est&#225; inclu&#237;da na unidade de composi&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: O conte&#250;do do manifesto de implementa&#231;&#227;o n&#227;o est&#225; correto. Os seguintes pacotes configur&#225;veis s&#227;o redundantes: {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, a ser importado inclui pacotes configur&#225;veis que n&#227;o s&#227;o necess&#225;rios para resolver o recurso enterprise bundle archive (EBA).
  </Explanation>
  <UserResponse>
    Verifique se o novo manifesto de implementa&#231;&#227;o n&#227;o inclui os pacotes configur&#225;veis que est&#227;o listados na mensagem.
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: Conectando &#224; estrutura {0} no n&#243; {1} e servidor {2}.
  </MsgText>
  <Explanation>
    Voc&#234; est&#225; conectando-se atualmente com a estrutura.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: Ocorreu um erro interno. Tentativa de gerar um objeto AriesApplicationModel de um manifesto de implementa&#231;&#227;o null.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: O par&#226;metro version obrigat&#243;rio n&#227;o foi especificado.
  </MsgText>
  <Explanation>
    O comando requer que o par&#226;metro version seja especificado.
  </Explanation>
  <UserResponse>
    Emita novamente o comando especificando a vers&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: O conte&#250;do do manifesto de implementa&#231;&#227;o n&#227;o est&#225; correto. Os seguintes pacotes configur&#225;veis extras s&#227;o necess&#225;rios {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, a ser importado n&#227;o inclui todos os pacotes configur&#225;veis necess&#225;rios para resolver o recurso enterprise bundle archive (EBA).
  </Explanation>
  <UserResponse>
    Verifique se o novo manifesto de implementa&#231;&#227;o inclui todos os pacotes configur&#225;veis que est&#227;o listados na mensagem.
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: O pacote configur&#225;vel {0} foi interrompido com &#234;xito.
  </MsgText>
  <Explanation>
    Essa mensagem &#233; apenas informativa.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: Ocorreu um erro interno. Tentativa de gerar um objeto AriesApplicationModel a partir de um manifesto do aplicativo null.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
