<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bundle.download/src/com/ibm/ws/eba/bundle/download/messages/EBABundleDownloadMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAK0017E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0017E" varFormat="Java">
    BUNDLE_DOWNLOAD_0017E=CWSAK0017E: Foi feita uma solicita&#231;&#227;o para um novo download do pacote configur&#225;vel {0}, que &#233; um Pacote Configur&#225;vel UTE. Os pacotes configur&#225;veis UTE n&#227;o podem ser transferidos por download novamente.
  </MsgText>
  <Explanation>
    Os pacotes configur&#225;veis UTE n&#227;o podem ser transferidos por download novamente.
  </Explanation>
  <UserResponse>
    Investigue o porqu&#234; um pedido de novo download foi feito para este pacote configur&#225;vel UTE.
  </UserResponse>
</Message>
<Message ID="CWSAK0001E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0001E" varFormat="Java">
    BUNDLE_DOWNLOAD_0001E=CWSAK0001E: N&#227;o &#233; poss&#237;vel renomear o arquivo {0} para o arquivo {1}.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode renomear o arquivo do pacote configur&#225;vel transferido por download.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo &#233; v&#225;lido e se n&#227;o est&#225; bloqueado.
  </UserResponse>
</Message>
<Message ID="CWSAK0007E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0007E" varFormat="Java">
    BUNDLE_DOWNLOAD_0007E=CWSAK0007E: N&#227;o &#233; poss&#237;vel criar o local do cache global de pacotes configur&#225;veis: {0}
  </MsgText>
  <Explanation>
    O diret&#243;rio especificado como o cache do pacote configur&#225;vel global n&#227;o pode ser criado.
  </Explanation>
  <UserResponse>
    Investigue por que o diret&#243;rio n&#227;o pode ser criado.
  </UserResponse>
</Message>
<Message ID="CWSAK0010E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0010E" varFormat="Java">
    BUNDLE_DOWNLOAD_0010E=CWSAK0010E: N&#227;o &#233; poss&#237;vel incluir a lista de recursos {0} para o pacote configur&#225;vel {1} porque o pacote configur&#225;vel n&#227;o existe no cache interno.
  </MsgText>
  <Explanation>
    Uma propriedade da lista de recursos no arquivo de conte&#250;do do cache n&#227;o possui uma propriedade do pacote configur&#225;vel correspondente.
  </Explanation>
  <UserResponse>
    Investigue se o arquivo de conte&#250;do do cache est&#225; corrompido.
  </UserResponse>
</Message>
<Message ID="CWSAK0016E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0016E" varFormat="Java">
    BUNDLE_DOWNLOAD_0016E=CWSAK0016E: Ocorreu um erro interno. Nenhum local de cache do pacote configur&#225;vel foi especificado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0006E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0006E" varFormat="Java">
    BUNDLE_DOWNLOAD_0006E=CWSAK0006E: O arquivo de pacote configur&#225;vel local {0} n&#227;o existe.
  </MsgText>
  <Explanation>
    O processo de download n&#227;o criou o arquivo do pacote configur&#225;vel {0} local.
  </Explanation>
  <UserResponse>
    Investigue por que o arquivo n&#227;o foi criado.
  </UserResponse>
</Message>
<Message ID="CWSAK0019E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_DELETE_EXPANDED_DIRECTORY" varFormat="Java">
    UNABLE_TO_DELETE_EXPANDED_DIRECTORY=CWSAK0019E: N&#227;o foi poss&#237;vel excluir o diret&#243;rio de pacote configur&#225;vel expandido {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0018E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_EXPANDED_DIRECTORY" varFormat="Java">
    UNABLE_TO_CREATE_EXPANDED_DIRECTORY=CWSAK0018E: N&#227;o foi poss&#237;vel criar o diret&#243;rio de pacote configur&#225;vel expandido {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0015E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0015E" varFormat="Java">
    BUNDLE_DOWNLOAD_0015E=CWSAK0015E: N&#227;o &#233; poss&#237;vel renomear o arquivo {0} para o arquivo {1}. Exce&#231;&#227;o : {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0005E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0005E" varFormat="Java">
    BUNDLE_DOWNLOAD_0005E=CWSAK0005E: N&#227;o &#233; poss&#237;vel fazer download do pacote configur&#225;vel porque a URL do reposit&#243;rio, o nome do pacote configur&#225;vel ou ambos est&#227;o ausentes. URL do Reposit&#243;rio: {0} Nome do pacote configur&#225;vel local: {1}.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode determinar qual pacote configur&#225;vel deve ser transferido por download.
  </Explanation>
  <UserResponse>
    Verifique se uma URL do reposit&#243;rio v&#225;lido e o nome do pacote configur&#225;vel s&#227;o fornecidos.
  </UserResponse>
</Message>
<Message ID="CWSAK0014E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0014E" varFormat="Java">
    BUNDLE_DOWNLOAD_0014E=CWSAK0014E: O arquivo do cache de pacotes configur&#225;veis n&#227;o foi inicializado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0004E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0004E" varFormat="Java">
    BUNDLE_DOWNLOAD_0004E=CWSAK0004E: N&#227;o &#233; poss&#237;vel excluir o arquivo {0}. Exce&#231;&#227;o {1}
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode excluir o arquivo do pacote configur&#225;vel.
  </Explanation>
  <UserResponse>
    Investigue por que o arquivo n&#227;o pode ser exclu&#237;do.
  </UserResponse>
</Message>
<Message ID="CWSAK0013E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0013E" varFormat="Java">
    BUNDLE_DOWNLOAD_0013E=CWSAK0013E: N&#227;o &#233; poss&#237;vel criar o arquivo de cache de pacote configur&#225;vel, {0}.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode criar este arquivo interno e seu diret&#243;rio pai.
  </Explanation>
  <UserResponse>
    Verifique se o sistema possui acesso de grava&#231;&#227;o para o local.
  </UserResponse>
</Message>
<Message ID="CWSAK0021E" severity="E" prefix="yes">
  <MsgText pgmKey="ILLEGAL_BUNDLE_VERSION" varFormat="Java">
    ILLEGAL_BUNDLE_VERSION=CWSAK0021E: N&#227;o &#233; poss&#237;vel analisar a vers&#227;o do pacote configur&#225;vel com nome simb&#243;lico e vers&#227;o combinados: {0}.
  </MsgText>
  <Explanation>
    O nome simb&#243;lico e a vers&#227;o podem ser analisados de diversas maneiras devido &#224; presen&#231;a de caracteres de sublinhado excessivos.
  </Explanation>
  <UserResponse>
    Simplifique a vers&#227;o do pacote configur&#225;vel removendo os caracteres de sublinhado.
  </UserResponse>
</Message>
<Message ID="CWSAK0023E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_EXCEPTION_DURING_REFRESH" varFormat="Java">
    RESOLVER_EXCEPTION_DURING_REFRESH=CWSAK0023E: Encontrada ResolverException ao atualizar URL do pacote configur&#225;vel: {0}
  </MsgText>
  <Explanation>
    A atualiza&#231;&#227;o da URL de um pacote configur&#225;vel a partir dos reposit&#243;rios de pacotes configur&#225;veis configurados falhou com uma exce&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Verifique se os reposit&#243;rios de pacotes configur&#225;veis est&#227;o configurados corretamente.
  </UserResponse>
</Message>
<Message ID="CWSAK0003E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0003E" varFormat="Java">
    BUNDLE_DOWNLOAD_0003E=CWSAK0003E: N&#227;o &#233; poss&#237;vel fazer download do pacote configur&#225;vel com a URL {0}. Exce&#231;&#227;o {1}
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode fazer download do pacote configur&#225;vel que foi pedido.
  </Explanation>
  <UserResponse>
    Verifique se a URL para o pacote configur&#225;vel est&#225; correta.
  </UserResponse>
</Message>
<Message ID="CWSAK0009E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0009E" varFormat="Java">
    BUNDLE_DOWNLOAD_0009E=CWSAK0009E: N&#227;o &#233; poss&#237;vel iniciar um novo encadeamento para o pacote configur&#225;vel {0} (URL: {1}) no ThreadPool {2}. Exce&#231;&#227;o : {3}
  </MsgText>
  <Explanation>
    O conjunto de encadeamentos atingiu seu tamanho m&#225;ximo, portanto, mais nenhum encadeamento poder&#225; ser iniciado.
  </Explanation>
  <UserResponse>
    O download dos pacotes configur&#225;veis afetados ser&#227;o tentados novamente na pr&#243;xima vez em que um recurso for importado ou quando o servidor for reiniciado.
  </UserResponse>
</Message>
<Message ID="CWSAK0020E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_LOOSE_CBA" varFormat="Java">
    INVALID_LOOSE_CBA=CWSAK0020E: A URL {0} do pacote configur&#225;vel composto do tipo loose n&#227;o &#233; v&#225;lida.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0022E" severity="E" prefix="yes">
  <MsgText pgmKey="CANNOT_OBTAIN_BUNDLE_REPOSITORY_SERVICE" varFormat="Java">
    CANNOT_OBTAIN_BUNDLE_REPOSITORY_SERVICE=CWSAK0022E: N&#227;o &#233; poss&#237;vel obter o servi&#231;o {0} no registro de servi&#231;o.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0012E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0012E" varFormat="Java">
    BUNDLE_DOWNLOAD_0012E=CWSAK0012E: O local do cache de pacotes configur&#225;veis {0} existe, mas n&#227;o &#233; um diret&#243;rio v&#225;lido.
  </MsgText>
  <Explanation>
    O local do cache do pacote configur&#225;vel n&#227;o foi resolvido para um diret&#243;rio v&#225;lido.
  </Explanation>
  <UserResponse>
    Remova o arquivo do sistema de arquivos.
  </UserResponse>
</Message>
<Message ID="CWSAK0002E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0002E" varFormat="Java">
    BUNDLE_DOWNLOAD_0002E=CWSAK0002E: N&#227;o &#233; poss&#237;vel fazer download do pacote configur&#225;vel com a URL {0} porque n&#227;o h&#225; nenhum arquivo nessa URL.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode localizar o pacote configur&#225;vel que foi pedido.
  </Explanation>
  <UserResponse>
    Verifique se a URL para o pacote configur&#225;vel est&#225; correta.
  </UserResponse>
</Message>
<Message ID="CWSAK0008E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0008E" varFormat="Java">
    BUNDLE_DOWNLOAD_0008E=CWSAK0008E: N&#227;o &#233; poss&#237;vel criar o conjunto de encadeamentos {0}.
  </MsgText>
  <Explanation>
    Um conjunto de encadeamentos null foi retornado ao criar o conjunto de encadeamentos para fazer download de arquivos para o cache do pacote configur&#225;vel.
  </Explanation>
  <UserResponse>
    Investigue por que o conjunto de encadeamentos n&#227;o pode ser criado.
  </UserResponse>
</Message>
<Message ID="CWSAK0011E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0011E" varFormat="Java">
    BUNDLE_DOWNLOAD_0011E=CWSAK0011E: N&#227;o &#233; poss&#237;vel acessar o servi&#231;o {0}, na Refer&#234;ncia de Servi&#231;o {1}, nos rastreadores de servi&#231;o.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode obter o servi&#231;o do Service Tracker.
  </Explanation>
  <UserResponse>
    Investigue por que os servi&#231;os n&#227;o est&#227;o dispon&#237;veis.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
