<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: A resolu&#231;&#227;o do recurso {0} indica depend&#234;ncias inv&#225;lidas de conte&#250;do compartilhado no conte&#250;do do aplicativo: {1}
  </MsgText>
  <Explanation>
    Os pacotes configur&#225;veis do aplicativo n&#227;o podem fornecer pacotes ou servi&#231;os para os pacotes configur&#225;veis compartilhados. Al&#233;m disso, os pacotes configur&#225;veis n&#227;o t&#234;m permiss&#227;o para serem implementados como pacotes configur&#225;veis compartilhados e do aplicativo. Qualquer implementa&#231;&#227;o que necessite de pacotes configur&#225;veis compartilhados que dependem dos pacotes configur&#225;veis do aplicativo n&#227;o &#233; v&#225;lida.
  </Explanation>
  <UserResponse>
    Verifique se o aplicativo precisa de todos os pacotes configur&#225;veis compartilhados inv&#225;lidos. Se precisar, certifique-se de que eles n&#227;o dependem do conte&#250;do do aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: N&#227;o &#233; poss&#237;vel ler o manifesto de pacote configur&#225;vel do arquivo JAR {0} no arquivo EBA {1}.
  </MsgText>
  <Explanation>
    Ocorreu uma IOException ao localizar o manifesto de um arquivo JAR em um arquivo Enterprise Bundle Archive (EBA). O arquivo pode estar corrompido ou ileg&#237;vel.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo possui as permiss&#245;es apropriadas e se est&#225; no formato correto.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Ocorreu um erro interno. O servi&#231;o do provisionador {0} est&#225; indispon&#237;vel.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: O aplicativo OSGi implementado em uma unidade de composi&#231;&#227;o {0} no aplicativo em n&#237;vel de neg&#243;cios {1} n&#227;o foi iniciado.
  </MsgText>
  <Explanation>
    Ocorreu uma exce&#231;&#227;o durante a opera&#231;&#227;o de in&#237;cio.
  </Explanation>
  <UserResponse>
    Inspecione os logs do servidor antes dessa exce&#231;&#227;o para obter diagn&#243;sticos mais espec&#237;ficos para o problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: O arquivo Enterprise Bundle Archive (EBA) {1} cont&#233;m o diret&#243;rio {0}, que n&#227;o &#233; suportado.
  </MsgText>
  <Explanation>
    O arquivo EBA especificado cont&#233;m um diret&#243;rio denominado byValue ou byReference. Nenhum desses nomes de diret&#243;rio s&#227;o suportados no diret&#243;rio raiz de um arquivo EBA.
  </Explanation>
  <UserResponse>
    Remova ou renomeie o diret&#243;rio relevante.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: A fun&#231;&#227;o especificada {0} n&#227;o existe.
  </MsgText>
  <Explanation>
    Tentativa de mapear usu&#225;rios ou grupos para uma fun&#231;&#227;o de seguran&#231;a que n&#227;o existe.
  </Explanation>
  <UserResponse>
    Verifique se a fun&#231;&#227;o de seguran&#231;a especificada existe ou crie a fun&#231;&#227;o no aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: O manifesto de implementa&#231;&#227;o a ser importado n&#227;o &#233; v&#225;lido para o recurso {0} porque ele n&#227;o satisfaz aos requisitos no manifesto do aplicativo.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, n&#227;o &#233; compat&#237;vel com o manifesto de aplicativo, APPLICATION.MF, do recurso.
  </Explanation>
  <UserResponse>
    Verifique o novo manifesto de implementa&#231;&#227;o para o seguinte:
   1. O Application-SymbolicName e o Application-Version no arquivo DEPLOYMENT.MF devem corresponder &#224;s entradas correspondentes no arquivo APPLICATION.MF.
 2. Os pacotes configur&#225;veis listados no cabe&#231;alho Deployed-Content no arquivo DEPLOYMENT.MF devem corresponder aos pacotes configur&#225;veis listados no cabe&#231;alho Application-Content no arquivo APPLICATION.MF.
 3. A vers&#227;o do pacote configur&#225;vel no cabe&#231;alho Deployed-Content no arquivo DEPLOYMENT.MF deve estar dentro do intervalo de vers&#227;o para o pacote configur&#225;vel correspondente no arquivo APPLICATION.MF.
 4. Os pacotes configur&#225;veis listados no cabe&#231;alho Deployed-Use-Bundle no arquivo DEPLOYMENT.MF tamb&#233;m devem estar listados no cabe&#231;alho Use-Bundle no arquivo APPLICATION.MF.
   5. A vers&#227;o do pacote configur&#225;vel no cabe&#231;alho Deployed-Use-Bundle no arquivo DEPLOYMENT.MF deve estar dentro do intervalo de vers&#227;o para o pacote configur&#225;vel correspondente no cabe&#231;alho Use-Bundle no arquivo APPLICATION.MF.
 N&#227;o edite manualmente o manifesto de implementa&#231;&#227;o. Se necess&#225;rio, remova o manifesto de implementa&#231;&#227;o do EBA. Isso far&#225; com que um arquivo do manifesto de implementa&#231;&#227;o atualizado seja gerado quando o EBA &#233; importado.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: N&#227;o &#233; poss&#237;vel resolver as vers&#245;es de pacote configur&#225;vel selecionadas ou elas n&#227;o s&#227;o compat&#237;veis.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode resolver as vers&#245;es em pacotes configur&#225;veis selecionados. Os pacotes configur&#225;veis podem ter depend&#234;ncias ausentes, ser incompat&#237;veis ou n&#227;o existir.
  </Explanation>
  <UserResponse>
    Modifique o conjunto selecionado de pacotes configur&#225;veis de entrada e tente novamente. &#201; poss&#237;vel usar o console administrativo para visualizar o status do recurso.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: O usu&#225;rio {0} n&#227;o &#233; um usu&#225;rio mapeado ou um membro de um grupo mapeado para a fun&#231;&#227;o {1}.
  </MsgText>
  <Explanation>
    Qualquer usu&#225;rio especificado deve ser um usu&#225;rio mapeado na fun&#231;&#227;o de seguran&#231;a ou ser um membro de um grupo mapeado na fun&#231;&#227;o de seguran&#231;a. O usu&#225;rio especificado n&#227;o atendeu um desses requisitos.
  </Explanation>
  <UserResponse>
    Configure a fun&#231;&#227;o de seguran&#231;a para mapeamentos de usu&#225;rio/grupo para permitir que o usu&#225;rio especificado atue na fun&#231;&#227;o especificada ou especifique um usu&#225;rio diferente que j&#225; tenha as permiss&#245;es necess&#225;rias.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: O aplicativo {0} cont&#233;m um ou mais Composite Bundle Archives (CBAs) {1} em seu Application-Content. Isso n&#227;o &#233; suportado no OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7.
  </MsgText>
  <Explanation>
    Os CBAs s&#227;o suportados no Application-Content para WebSphere Application Server Vers&#227;o 8 e vers&#245;es posteriores.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria. Se o aplicativo tiver que ser executado no OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7, regrave o aplicativo para que n&#227;o exista nenhum CBA no Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: Ocorreu uma IOException ao ler o arquivo de manifesto do aplicativo do archive de pacotes configur&#225;veis corporativos (EBA) {0}. O arquivo pode ser inv&#225;lido, estar corrompido ou ileg&#237;vel.
  </MsgText>
  <Explanation>
    Ocorreu uma IOException ao ler um arquivo de manifesto do aplicativo Enterprise Bundle Archive (EBA). O arquivo pode ser inv&#225;lido, estar corrompido ou ileg&#237;vel.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo de manifesto do aplicativo, APPLICATION.MF, segue a especifica&#231;&#227;o para os arquivos de manifesto.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Ocorreu um erro interno. A URI do Arquivo de Configura&#231;&#227;o de Plugin n&#227;o tem o formato esperado {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Ocorreu um erro interno. Um resultado incorreto foi retornado durante o provisionamento do arquivo Enterprise Bundle Archive (EBA) {0}, esperava-se que a vers&#227;o m&#225;xima {1} fosse a mesma que a vers&#227;o m&#237;nima {2}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: O aplicativo {0} n&#227;o p&#244;de ser provisionado para todos os n&#243;s na c&#233;lula. O aplicativo pode ser implementado apenas nos n&#243;s da Vers&#227;o 7 que estejam executando o OSGi Applications Feature Pack. O erro de resolu&#231;&#227;o era {1}.
  </MsgText>
  <Explanation>
    O aplicativo sendo importado foi provisionado com &#234;xito no OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7, mas n&#227;o p&#244;de ser provisionado com rela&#231;&#227;o ao WebSphere Application Server Vers&#227;o 8.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria. No entanto, este aviso indica que o aplicativo pode conter um requisito de vers&#227;o excessivamente rigoroso. &#201; poss&#237;vel usar as informa&#231;&#245;es no erro de resolu&#231;&#227;o para ajudar na modifica&#231;&#227;o do aplicativo para que ele possa ser implementado com rela&#231;&#227;o aos n&#243;s da Vers&#227;o 8.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: Um membro de cluster n&#227;o pode ser criado no n&#243; {0} porque o(s) aplicativo(s) OSGi {1} define(em) Executar Como Fun&#231;&#245;es.
  </MsgText>
  <Explanation>
    Todos os membros de cluster devem conseguir executar os mesmos aplicativos, mas o novo membro de cluster n&#227;o pode suportar aplicativos OSGi com Executar Como Fun&#231;&#245;es definido.
  </Explanation>
  <UserResponse>
    Selecione um n&#243; da Vers&#227;o 8 para hospedar o membro de cluster ou modifique o(s) aplicativo(s) para que n&#227;o defina(am) mais Executar Como Fun&#231;&#245;es.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: O manifesto de implementa&#231;&#227;o do aplicativo {0} na vers&#227;o {1} lista o cont&#233;udo com o mesmo nome simb&#243;lico e vers&#227;o que o aplicativo.
  </MsgText>
  <Explanation>
    Todos os aplicativos, pacotes configur&#225;veis e pacotes configur&#225;veis compostos compartilham o mesmo espa&#231;o de nomes; portanto, eles devem ter identificadores exclusivos no espa&#231;o de nomes. Ao validar a implementa&#231;&#227;o do aplicativo, o ambiente de tempo de execu&#231;&#227;o localizou uma refer&#234;ncia para um pacote configur&#225;vel com o mesmo nome simb&#243;lico e vers&#227;o que o aplicativo.
  </Explanation>
  <UserResponse>
    Corrija o nome simb&#243;lico do pacote configur&#225;vel, pacote configur&#225;vel composto ou aplicativo, de modo que n&#227;o haja mais nenhum conflito no namespace.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: O recurso {0} n&#227;o pode ser resolvido. O atributo {1} em uma importa&#231;&#227;o do pacote {2} n&#227;o pode ser atendido na implementa&#231;&#227;o.
  </MsgText>
  <Explanation>
    Para os pacotes configur&#225;veis listados no cabe&#231;alho Application-Content no APPLICATION.MF, todas as importa&#231;&#245;es de pacote dever&#227;o possuir atributos que possam satisfazer na implementa&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Altere o pacote ou a configura&#231;&#227;o do aplicativo para que todos os pacotes configur&#225;veis que est&#227;o listados no cabe&#231;alho Application-Content possuam importa&#231;&#245;es do pacote que possam ser satisfeitos na implementa&#231;&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel localizar os dados de configura&#231;&#227;o necess&#225;rios para expandir o {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Ocorreu uma exce&#231;&#227;o durante a modelagem do pacote configur&#225;vel {0}: {1}
  </MsgText>
  <Explanation>
    A exce&#231;&#227;o especificada ocorreu durante a modelagem do pacote configur&#225;vel especificado.
  </Explanation>
  <UserResponse>
    Estude a exce&#231;&#227;o especificada para obter detalhes do problema e corrigi-lo.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel obter o InputStream para Entrada Zip de web.xml no War {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: Nenhum Alias de Autentica&#231;&#227;o do Listener MDB correspondente ao nome {0} p&#244;de ser localizada no destino {1} para o recurso usado pelo bean {2} no pacote configur&#225;vel {3} na vers&#227;o {4}.
  </MsgText>
  <Explanation>
    O Alias de Autentica&#231;&#227;o especificado n&#227;o existe ou n&#227;o est&#225; vis&#237;vel para esse aplicativo.
  </Explanation>
  <UserResponse>
    Configure o Alias de Autentica&#231;&#227;o necess&#225;rio ou assegure-se de que esteja configurado no escopo correto para o aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: O recurso {0} n&#227;o pode ser resolvido. Ele requer o bundle {1} que n&#227;o est&#225; listado no cabe&#231;alho Application-Content no manifesto do aplicativo,  APPLICATION.MF. Esse bundle consome o servi&#231;o {2} a partir do bundle {3}, que est&#225; listado no cabe&#231;alho Application-Content.
  </MsgText>
  <Explanation>
    O aplicativo n&#227;o est&#225; configurado corretamente. Um bundle compartilhado n&#227;o pode consumir um servi&#231;o de um bundle isolado. Os pacotes configur&#225;veis que est&#227;o listados no cabe&#231;alho Application-Content s&#227;o isolados em podem exportar servi&#231;os apenas para outros aplicativos por meio do mecanismo Application-ExportService.
  </Explanation>
  <UserResponse>
    Altere o pacote ou a configura&#231;&#227;o do aplicativo para que os pacotes configur&#225;veis que estiverem listados no cabe&#231;alho Use-Bundle ou inclu&#237;dos pelo resolvedor n&#227;o precisem dos servi&#231;os que s&#227;o fornecidos pelos pacotes configur&#225;veis que estiverem listados no cabe&#231;alho Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: O recurso {0} requer downloads externos antes que possa ser implementado em uma unidade de composi&#231;&#227;o.
  </MsgText>
  <Explanation>
    O recurso novo ou atualizado requer que um ou mais pacotes sejam transferidos por download de um reposit&#243;rio antes que possa ser inclu&#237;do em uma unidade de composi&#231;&#227;o ou atualizado em uma unidade de composi&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Para iniciar o processo de download do pacote configur&#225;vel, salve suas mudan&#231;as para a configura&#231;&#227;o principal. &#201; poss&#237;vel visualizar o status do download do bundle do recurso a partir do painel de detalhes do recurso no console administrativo. Depois que os downloads do pacote configur&#225;vel forem conclu&#237;dos, tente novamente para incluir ou atualizar o recurso em uma unidade de composi&#231;&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: A convers&#227;o do arquivo WAR {0} em arquivo EBA {1} para um arquivo WAB n&#227;o foi conclu&#237;da com &#234;xito.
  </MsgText>
  <Explanation>
    Os arquivos Web Application Archive (WAR) em um Enterprise Bundle Archive (EBA) devem ser convertidos em Web Application Bundles (WABs) antes de serem implementados. O processo de convers&#227;o n&#227;o foi conclu&#237;do com &#234;xito.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo WAR &#233; v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Ocorreu um erro interno. O servi&#231;o RepositoryAdminSupport n&#227;o est&#225; dispon&#237;vel no registro do servi&#231;o OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: O alias de autentica&#231;&#227;o {0} n&#227;o existe no dom&#237;nio de seguran&#231;a {2} do destino {1}.
  </MsgText>
  <Explanation>
    Um authentication alias dever&#225; existir no dom&#237;nio de seguran&#231;a global ou de destino quando as refer&#234;ncias de recursos Blueprint forem limitadas.
  </Explanation>
  <UserResponse>
    Selecione um authentication alias que exista no dom&#237;nio de seguran&#231;a global ou de destino ou crie um authentication alias adequado.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: Um membro de cluster n&#227;o pode ser criado no n&#243; {0} porque o(s) aplicativo(s) OSGi {1} cont&#233;m(&#234;m) o Composite Bundle Archives (CBAs) no Application-Content.
  </MsgText>
  <Explanation>
    Todos os membros de cluster devem conseguir executar os mesmos aplicativos, mas o novo membro de cluster n&#227;o pode suportar aplicativos OSGi com CBAs no Application-Content.
  </Explanation>
  <UserResponse>
    Selecione um n&#243; da Vers&#227;o 8 para hospedar o membro de cluster ou modifique o(s) aplicativo(s) para que n&#227;o contenham mais CBAs no Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: A unidade de composi&#231;&#227;o {0} n&#227;o corresponde a um aplicativo OSGi.
  </MsgText>
  <Explanation>
    A opera&#231;&#227;o chamada opera em uma unidade de composi&#231;&#227;o para um aplicativo OSGi. A unidade de composi&#231;&#227;o selecionada n&#227;o cont&#233;m um aplicativo OSGi.
  </Explanation>
  <UserResponse>
    Verifique se a unidade de composi&#231;&#227;o selecionada &#233; apoiada por um recurso com o aspecto de tipo &quot;EBA,version=1.0&quot;.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Ocorreu um erro interno. N&#227;o foi poss&#237;vel extrair o manifesto de implementa&#231;&#227;o do bin&#225;rio do recurso {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Ocorreu um erro interno. O servi&#231;o ModelledResourceManager n&#227;o est&#225; dispon&#237;vel no registro do servi&#231;o OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Ocorreu um erro interno. O pacote configur&#225;vel CBA {0} na vers&#227;o {1} n&#227;o pode ser modelado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: O arquivo do descritor do aplicativo Java EE n&#227;o foi encontrado no arquivo EBA {0}. Sem esse arquivo descritor, as ra&#237;zes de contexto dos arquivos WAR s&#227;o configuradas como valores-padr&#227;o.
  </MsgText>
  <Explanation>
    O sistema processou um Web Application Archive (WAR) sem um arquivo descritor de aplicativo associado, application.xml, que define as ra&#237;zes de contexto. As ra&#237;zes de contexto para o arquivo WAR migrado ser&#227;o configuradas como valores-padr&#227;o.
  </Explanation>
  <UserResponse>
    Se um arquivo descritor de aplicativo for necess&#225;rio, verifique se ele foi fornecido e empacotado corretamente no arquivo Enterprise Bundle Archive (EBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Imposs&#237;vel processar o arquivo de manifesto de implementa&#231;&#227;o fornecido pelo aplicativo neste local {0}.
  </MsgText>
  <Explanation>
    Foi feita uma tentativa de importar um EBA que cont&#233;m um arquivo de manifesto de implementa&#231;&#227;o. O processamento deste arquivo n&#227;o teve &#234;xito.
  </Explanation>
  <UserResponse>
    Verifique se o servidor de aplicativos tem permiss&#227;o para acessar o arquivo e verifique se o arquivo n&#227;o est&#225; danificado. N&#227;o edite manualmente o manifesto de implementa&#231;&#227;o. Se necess&#225;rio, remova o manifesto de implementa&#231;&#227;o do EBA. Isso faz com que o arquivo de manifesto de implementa&#231;&#227;o novo seja gerado quando o EBA for importado.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Ocorreu um erro interno. O servi&#231;o {0} n&#227;o est&#225; dispon&#237;vel a partir do registro de servi&#231;o OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: N&#227;o &#233; poss&#237;vel criar o diret&#243;rio {0}.
  </MsgText>
  <Explanation>
    O diret&#243;rio especificado n&#227;o pode ser criado.
  </Explanation>
  <UserResponse>
    Verifique se o espa&#231;o de armazenamento existe e se o produto possui as permiss&#245;es necess&#225;rias para criar o diret&#243;rio.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Ocorreu um erro interno. O m&#243;dulo {0} tinha um tipo inesperado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: Arquivo EBA {0} instalado com erros.
  </MsgText>
  <Explanation>
    A valida&#231;&#227;o e a instala&#231;&#227;o do arquivo Enterprise Bundle Archive (EBA) foram conclu&#237;das com erros.
  </Explanation>
  <UserResponse>
    Consulte as mensagens de erros anexas no arquivo SystemOut.log para obter informa&#231;&#245;es adicionais.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Nenhuma liga&#231;&#227;o padr&#227;o p&#244;de ser criada para a refer&#234;ncia EJB {0} no pacote configur&#225;vel {1} na vers&#227;o {2} com interface {3}, j&#225; que n&#227;o existe nenhum enterprise bean correspondente no aplicativo.
  </MsgText>
  <Explanation>
    Liga&#231;&#245;es padr&#227;o devem ser criadas para refer&#234;ncias EJB desvinculadas. N&#227;o p&#244;de ser localizado nenhum enterprise ao qual ligar essa refer&#234;ncia.
  </Explanation>
  <UserResponse>
    Ligue a refer&#234;ncia a um local JNDI conhecido ou corrija o aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel localizar o objeto do recurso de configura&#231;&#227;o para o recurso {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: N&#227;o &#233; poss&#237;vel localizar a refer&#234;ncia de recurso com nome JNDI {0} e tipo {1} no destino {2} da refer&#234;ncia de recurso EJB {3} definida no pacote configur&#225;vel {4} com vers&#227;o {5}.
  </MsgText>
  <Explanation>
    Um archive de pacotes configur&#225;veis corporativos (EBA) que inclui refer&#234;ncias de recurso em um m&#243;dulo EJB especifica um nome JNDI para uma refer&#234;ncia de recurso que n&#227;o existe no namespace JNDI.
  </Explanation>
  <UserResponse>
    Se a refer&#234;ncia de recurso tiver que estar no espa&#231;o de nomes JNDI, ligue um objeto ao nome ou corrija a refer&#234;ncia de recurso e atualize o EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: O aplicativo OSGi implementado em uma unidade de composi&#231;&#227;o {0} no aplicativo em n&#237;vel de neg&#243;cios {1} n&#227;o parou.
  </MsgText>
  <Explanation>
    Ocorreu uma exce&#231;&#227;o durante a opera&#231;&#227;o de parada.
  </Explanation>
  <UserResponse>
    Inspecione os logs do servidor antes dessa exce&#231;&#227;o para obter diagn&#243;sticos mais espec&#237;ficos para o problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: A fun&#231;&#227;o {0} n&#227;o &#233; uma fun&#231;&#227;o v&#225;lida.
  </MsgText>
  <Explanation>
    A fun&#231;&#227;o especificada n&#227;o foi configurada.
  </Explanation>
  <UserResponse>
    Configure a fun&#231;&#227;o especificada.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: O membro de cluster {0} n&#227;o foi aumentado com os recursos, {2}, exigidos pelo aplicativo OSGi {1}.
  </MsgText>
  <Explanation>
    Para que um aplicativo OSGi seja instalado em um cluster, cada membro do cluster precisa ter todos os recursos requeridos do aplicativo. Ao incluir um novo membro de cluster, este membro tamb&#233;m precisa ter todos os recursos requeridos por todos os aplicativos OSGi instalados no cluster.
  </Explanation>
  <UserResponse>
    Verifique se o membro proposto do cluster tem todos os recursos requeridos para o aplicativo OSGi listado na mensagem de erro.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: N&#227;o &#233; poss&#237;vel criar o diret&#243;rio {0}.
  </MsgText>
  <Explanation>
    O diret&#243;rio especificado n&#227;o pode ser criado.
  </Explanation>
  <UserResponse>
    Verifique se o espa&#231;o de armazenamento existe e se o produto possui as permiss&#245;es necess&#225;rias para criar o diret&#243;rio.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: O conte&#250;do do manifesto de implementa&#231;&#227;o n&#227;o est&#225; correto. Os seguintes pacotes configur&#225;veis s&#227;o redundantes: {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o a ser importado inclui pacotes configur&#225;veis que n&#227;o s&#227;o necess&#225;rios para resolver o recurso enterprise bundle archive (EBA).
  </Explanation>
  <UserResponse>
    Verifique se o novo manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, n&#227;o inclui os pacotes configur&#225;veis listados na mensagem de exce&#231;&#227;o. N&#227;o edite manualmente o manifesto de implementa&#231;&#227;o. Se necess&#225;rio, remova o manifesto de implementa&#231;&#227;o do EBA. Isso far&#225; com que um arquivo do manifesto de implementa&#231;&#227;o atualizado seja gerado quando o EBA &#233; importado.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: O grupo especificado {0} n&#227;o &#233; v&#225;lido.
  </MsgText>
  <Explanation>
    Tentativa de mapear uma fun&#231;&#227;o de seguran&#231;a para um grupo que n&#227;o &#233; v&#225;lido.
  </Explanation>
  <UserResponse>
    Verifique se o grupo especificado existe.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Ocorreu um erro interno. O Admin Service n&#227;o foi registrado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Uma extens&#227;o &#224; unidade de composi&#231;&#227;o {0} requer downloads externos.
  </MsgText>
  <Explanation>
    Voc&#234; criou ou atualizou um Composite Bundle Archive (CBA) a ser usado como uma extens&#227;o para uma unidade de composi&#231;&#227;o. Esta extens&#227;o requer um ou mais pacotes configur&#225;veis para download a partir de um reposit&#243;rio antes que seja poss&#237;vel incluir a extens&#227;o na unidade de composi&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Para iniciar o processo de download, salve as altera&#231;&#245;es na configura&#231;&#227;o principal.  &#201; poss&#237;vel visualizar o status de download do pacote configur&#225;vel a partir do painel de detalhe da unidade de composi&#231;&#227;o no console administrativo. Aguarde a conclus&#227;o de download do pacote configur&#225;vel e, em seguida, inclua a extens&#227;o na unidade de composi&#231;&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: Nenhum dos servidores ou clusters tem o recurso {0} necess&#225;rio implementado para o recurso {1}.
  </MsgText>
  <Explanation>
    O recurso necess&#225;rio n&#227;o p&#244;de ser localizado em nenhum dos servidores.
  </Explanation>
  <UserResponse>
    Instale o recurso necess&#225;rio em pelo menos um dos servidores.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Ocorreu um erro interno. O arquivo Enterprise Bundle Archive (EBA) {0} est&#225; ausente dos seguintes pacotes configur&#225;veis: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: N&#227;o &#233; poss&#237;vel incluir {0} nesse aplicativo em n&#237;vel de neg&#243;cios porque ele j&#225; foi inclu&#237;do no aplicativo em n&#237;vel de neg&#243;cios: {1}
  </MsgText>
  <Explanation>
    Um recurso enterprise bundle archive (EBA) pode estar apenas em um &#250;nico aplicativo em n&#237;vel de neg&#243;cios (BLA).
  </Explanation>
  <UserResponse>
    Crie um novo aplicativo com o mesmo conte&#250;do, mas com um application symbolic name diferente. Importe o novo aplicativo como um recurso EBA e, em seguida, inclua-o nesse BLA.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: Provisionar o aplicativo {0} produziu resultados diferentes para o OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7 e WebSphere Application Server Vers&#227;o 8. O resultado da Vers&#227;o 8 ser&#225; usado.
  </MsgText>
  <Explanation>
    O aplicativo sendo importado foi provisionado com &#234;xito no OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7 e WebSphere Application Server Vers&#227;o 8. No entanto, diferentes resultados foram obtidos para as duas opera&#231;&#245;es de fornecimento. N&#227;o &#233; poss&#237;vel executar o mesmo aplicativo com diferentes implementa&#231;&#245;es.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1} foi atribu&#237;do ao diret&#243;rio {0}.
  </MsgText>
  <Explanation>
    Um recurso Archive de Pacotes Configur&#225;veis Corporativos (EBA) est&#225; sendo inclu&#237;do em uma unidade de composi&#231;&#227;o. Para configurar o aplicativo da Web contido no EBA, um diret&#243;rio foi designado ao aplicativo da Web.
  </Explanation>
  <UserResponse>
    Nenhuma
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel ler o manifesto do aplicativo ou o manifesto de implementa&#231;&#227;o para o arquivo Enterprise Bundle Archive (EBA) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Ocorreu um erro interno. A etapa {0} n&#227;o pode ser localizada.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: O recurso {0} cont&#233;m um arquivo JAR {1} que n&#227;o &#233; um pacote configur&#225;vel e que n&#227;o ser&#225; convertido. Se outras partes do aplicativo dependerem desse arquivo, o aplicativo falhar&#225; no tempo de execu&#231;&#227;o.
  </MsgText>
  <Explanation>
    A convers&#227;o dos arquivos de Java (JAR) do utilit&#225;rio e dos arquivos JAR Enterprise JavaBeans (EJB) n&#227;o &#233; suportada.
  </Explanation>
  <UserResponse>
    Verifique se nenhum pacote configur&#225;vel ou Web application bundle (WAB) depende de classes a partir do arquivo JAR. Para evitar a mensagem de aviso, remova o arquivo JAR do enterprise bundle archive (EBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel ler o manifesto do aplicativo ou o manifesto de implementa&#231;&#227;o para o arquivo Enterprise Bundle Archive (EBA) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: A interface EJB {0} para o enterprise bean {1} no Pacote Configur&#225;vel {2} na vers&#227;o {3} n&#227;o pode ser ligada ao local {4}. As interfaces EJB acess&#237;veis localmente devem ser ligadas ao namespace ejblocal:.
  </MsgText>
  <Explanation>
    As visualiza&#231;&#245;es &quot;Sem Interface&quot; e &quot;Home Local&quot; locais de um enterprise bean s&#243; podem ser ligadas a uma JNDI acess&#237;vel localmente. Isso significa que seus nomes de liga&#231;&#227;o devem iniciar com &quot;ejblocal:&quot;.
  </Explanation>
  <UserResponse>
    Ajuste os nomes de liga&#231;&#227;o de qualquer visualiza&#231;&#227;o EJB acess&#237;vel localmente para que use o prefixo de namespace ejblocal:.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: O CompUnitStatusStep indica que a unidade de composi&#231;&#227;o {0} deve ser atualizada para a mais recente vers&#227;o de implementa&#231;&#227;o dispon&#237;vel a partir do recurso {1}. No entanto, a unidade de composi&#231;&#227;o {0} est&#225; atualizada.
  </MsgText>
  <Explanation>
    Antes de poder atualizar o recurso implementado em uma unidade de composi&#231;&#227;o, uma vers&#227;o atualizada do recurso deve estar dispon&#237;vel e todos os pacotes configur&#225;veis necess&#225;rios pelo recurso atualizado devem ter conclu&#237;do o download.
  </Explanation>
  <UserResponse>
    Verifique se uma vers&#227;o mais recente do recurso est&#225; dispon&#237;vel e se todos os downloads de pacote configur&#225;vel para o recurso foram conclu&#237;dos.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel obter a unidade de composi&#231;&#227;o para o recurso {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: Um membro de cluster n&#227;o pode ser criado no n&#243; {0} porque o(s) aplicativo(s) OSGi {1} foi(foram) estendido(s).
  </MsgText>
  <Explanation>
    Todos os membros de cluster devem conseguir executar os mesmos aplicativos, mas o novo membro de cluster n&#227;o pode suportar extens&#245;es de aplicativo OSGi.
  </Explanation>
  <UserResponse>
    Selecione um n&#243; da Vers&#227;o 8 para hospedar o membro de cluster ou remova a(s) extens&#227;o(&#245;es) do(s) aplicativo(s) de modo que possam ser executados usando o n&#243; selecionado.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: O pacote configur&#225;vel {0} na Unidade de Composi&#231;&#227;o {1} n&#227;o p&#244;de ser atualizado, pois h&#225; uma extens&#227;o em conflito com o mesmo nome simb&#243;lico.
  </MsgText>
  <Explanation>
    N&#227;o &#233; poss&#237;vel atualizar um pacote configur&#225;vel cba com a vers&#227;o solicitada, pois j&#225; existe uma extens&#227;o com o mesmo nome simb&#243;lico nessa vers&#227;o.
  </Explanation>
  <UserResponse>
    Remova a extens&#227;o ou modifique a vers&#227;o do pacote configur&#225;vel para a qual voc&#234; est&#225; tentando atualizar.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: Nenhuma Especifica&#231;&#227;o de Ativa&#231;&#227;o MDB correspondente ao nome JNDI {0} p&#244;de ser localizada no destino {1} para o recurso usado pelo bean {2} no pacote configur&#225;vel {3} na vers&#227;o {4}.
  </MsgText>
  <Explanation>
    O nome JNDI de refer&#234;ncia de Especifica&#231;&#227;o de Ativa&#231;&#227;o de liga&#231;&#227;o do Listener MDB especificado n&#227;o existe.
  </Explanation>
  <UserResponse>
    Se a refer&#234;ncia tiver que estar no namespace JNDI, ligue um objeto ao nome ou corrija a refer&#234;ncia e atualize o EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Ocorreu um erro interno. O recurso {0} n&#227;o p&#244;de ser consultado para o conte&#250;do.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: O aplicativo {0} inclui um pacote configur&#225;vel composto {1} no conte&#250;do deste aplicativo. Esse processo n&#227;o &#233; suportado.
  </MsgText>
  <Explanation>
    N&#227;o &#233; poss&#237;vel usar o cabe&#231;alho do Conte&#250;do do Aplicativo para incluir os archives do pacote configur&#225;vel composto diretamente em um EBA.
  </Explanation>
  <UserResponse>
    Remova o pacote configur&#225;vel composto do conte&#250;do do aplicativo. &#201; poss&#237;vel incluir os pacotes configur&#225;veis individuais no Conte&#250;do do Aplicativo ou instalar o pacote configur&#225;vel composto em um reposit&#243;rio de pacotes configur&#225;veis para compartilhamento.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Ocorreu um erro interno. Um arquivo com o nome correto existe no cache do bundle, mas ele n&#227;o cont&#233;m o bundle esperado {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: N&#227;o &#233; poss&#237;vel localizar a refer&#234;ncia de destino de mensagem ou a refer&#234;ncia do ambiente de recursos com o nome JNDI {0} e o tipo {1} no destino {2} da refer&#234;ncia de destino de mensagem EJB ou refer&#234;ncia do ambiente de recursos {3} definida no pacote configur&#225;vel {4} com vers&#227;o {5}.
  </MsgText>
  <Explanation>
    Um archive de pacotes configur&#225;veis corporativos (EBA) que inclui refer&#234;ncias de destino de mensagem ou refer&#234;ncias do ambiente de recursos em um m&#243;dulo EJB especifica um nome JNDI para uma refer&#234;ncia de destino de mensagem ou uma refer&#234;ncia do ambiente de recursos que n&#227;o existe no namespace JNDI.
  </Explanation>
  <UserResponse>
    Se a refer&#234;ncia de destino de mensagem ou a refer&#234;ncia do ambiente de recursos tiver que estar no namespace JNDI, ligue um objeto ao nome ou corrija a refer&#234;ncia de destino de mensagem ou a refer&#234;ncia do ambiente de recursos e atualize o EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: O aplicativo OSGi {0} n&#227;o &#233; v&#225;lido porque seu nome simb&#243;lico cont&#233;m dois caracteres de ponto consecutivos.
  </MsgText>
  <Explanation>
    O nome simb&#243;lico de um aplicativo OSGi n&#227;o pode conter a sequ&#234;ncia &quot;..&quot;; ou seja, dois caracteres de ponto consecutivos.
  </Explanation>
  <UserResponse>
    Altere o nome simb&#243;lico do aplicativo OSGi.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: N&#227;o &#233; poss&#237;vel ler o arquivo EBA {0}.
  </MsgText>
  <Explanation>
    Ocorreu uma IOException ao ler um arquivo Enterprise Bundle Archive (EBA). O arquivo pode estar corrompido ou ileg&#237;vel.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo possui as permiss&#245;es apropriadas e se est&#225; no formato correto.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Ocorreu um erro interno. O SecurityAdmin MBean n&#227;o foi registrado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: As refer&#234;ncias de servi&#231;o no conte&#250;do do Composite Bundle Archive (CBA) {0} n&#227;o podem ser resolvidas. Se estes servi&#231;os forem fornecidos por pacotes configur&#225;veis que n&#227;o est&#227;o inclu&#237;dos no CBA, o CBA dever&#225; import&#225;-los. As seguintes depend&#234;ncias de servi&#231;o n&#227;o foram resolvidas: {1}
  </MsgText>
  <Explanation>
    Se um pacote configur&#225;vel em um Composite Bundle Archive (CBA) usar um servi&#231;o que n&#227;o est&#225; contido no pacote configur&#225;vel, ou exportado por um outro pacote configur&#225;vel no CBA, o CBA dever&#225; importar o servi&#231;o.
  </Explanation>
  <UserResponse>
    Corrija o manifesto composto, COMPOSITEBUNDLE.MF, para que o CBA importe qualquer servi&#231;o que seja usado por pacotes configur&#225;veis no CBA e n&#227;o esteja de outra forma dispon&#237;vel no CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: N&#227;o &#233; poss&#237;vel gravar no arquivo EBA {0} migrado.
  </MsgText>
  <Explanation>
    Ocorreu uma IOException ao gravar um arquivo Enterprise Bundle Archive (EBA) migrado.
  </Explanation>
  <UserResponse>
    Verifique se o produto possui permiss&#245;es necess&#225;rias para gravar no diret&#243;rio relevante, se o arquivo de destino n&#227;o est&#225; bloqueado e se o espa&#231;o de armazenamento est&#225; dispon&#237;vel.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: O aplicativo {0} n&#227;o p&#244;de ser provisionado para todos os n&#243;s na c&#233;lula. O aplicativo pode ser implementado apenas nos n&#243;s da Vers&#227;o 8. O erro de resolu&#231;&#227;o era {1}.
  </MsgText>
  <Explanation>
    O aplicativo sendo importado foi provisionado com &#234;xito no WebSphere Application Server Vers&#227;o 8, mas n&#227;o p&#244;de ser provisionado no OSGi Applications Feature Pack no WebSphere Application Server Vers&#227;o 7.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria. No entanto, &#233; poss&#237;vel usar as informa&#231;&#245;es no erro de resolu&#231;&#227;o para modificar o aplicativo de modo que possa ser implementado no OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Usando o host local como o nome do host para o transporte do servidor {0}.{1}. A solicita&#231;&#227;o de roteamento funcionar&#225; contanto que o servidor da Web e o servidor de aplicativos estiverem no mesmo n&#243;.
  </MsgText>
  <Explanation>
    O nome do host do servidor de aplicativos especificado no transporte foi resolvido como o host local.
  </Explanation>
  <UserResponse>
    Se o servidor da Web e o servidor de aplicativos estiverem em n&#243;s diferentes, investigue por que o nome do host do servidor de aplicativos foi resolvido como o host local.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: N&#227;o foi poss&#237;vel instalar o arquivo EBA {0}. O Application-SymbolicName {1} do EBA j&#225; est&#225; sendo usado pelo recurso {2}.
  </MsgText>
  <Explanation>
    Voc&#234; est&#225; tentando instalar um arquivo EBA, mas h&#225; um recurso existente que possui o mesmo nome simb&#243;lico.
  </Explanation>
  <UserResponse>
    Altere o nome simb&#243;lico do EBA que voc&#234; est&#225; instalando ou desinstale o recurso existente.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: Um membro de cluster n&#227;o pode ser criado no n&#243; {0} porque o(s) aplicativo(s) OSGi {1} n&#227;o pode(m) ser provisionado(s) com rela&#231;&#227;o a ele. O erro de resolu&#231;&#227;o era {2}.
  </MsgText>
  <Explanation>
    Todos os membros de cluster devem conseguir executar os mesmos aplicativos, mas o novo membro de cluster n&#227;o pode executar aplicativos OSGi nomeados.
  </Explanation>
  <UserResponse>
    Selecione outro n&#243; compat&#237;vel para hospedar o membro de cluster ou modifique os aplicativos para que eles possam ser executados usando o n&#243; selecionado.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: N&#227;o &#233; poss&#237;vel analisar o arquivo {0} do arquivo enterprise bundle archive (EBA) {1}.
  </MsgText>
  <Explanation>
    O arquivo especificado n&#227;o p&#244;de ser analisado.
  </Explanation>
  <UserResponse>
    Verifique se o arquivo est&#225; formatado corretamente e se n&#227;o est&#225; corrompido.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel ler o manifesto do aplicativo ou o manifesto de implementa&#231;&#227;o para o arquivo Enterprise Bundle Archive (EBA) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: Imposs&#237;vel criar o arquivo: {0}
  </MsgText>
  <Explanation>
    Houve um problema ao criar o nome do caminho requerido durante a exporta&#231;&#227;o do recurso.
  </Explanation>
  <UserResponse>
    Verifique se o servidor de aplicativos tem permiss&#227;o para criar esse nome do caminho.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: O comando UpdateAppContentVersionStep no WAS V7 foi substitu&#237;do pelo comando UpdateAppContentVersions no WAS V8.
  </MsgText>
  <Explanation>
    O comando UpdateAppContentVersionStep do WAS V7 foi substitu&#237;do pelo comando UpdateAppContentVersions no WAS V8. Consulte o Centro de Informa&#231;&#245;es para obter mais informa&#231;&#245;es.
  </Explanation>
  <UserResponse>
    Altere o script para usar o comando UpdateAppContentVersions.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Ocorreu um erro interno. O arquivo Enterprise Bundle Archive (EBA) {0}, quando resolvido, n&#227;o tem nenhum conte&#250;do que possa ser implementado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: N&#227;o &#233; poss&#237;vel resolver o arquivo EBA. Exce&#231;&#227;o: {0}.
  </MsgText>
  <Explanation>
    O sistema n&#227;o pode resolver os locais dos pacotes configur&#225;veis do aplicativo constituinte, em vers&#245;es apropriadas, do arquivo Enterprise Bundle Archive (EBA).
  </Explanation>
  <UserResponse>
    Consulte a exce&#231;&#227;o para obter informa&#231;&#245;es adicionais.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel resolver o arquivo Enterprise Bundle Archive (EBA) {0} porque o servi&#231;o {1} est&#225; indispon&#237;vel.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: O usu&#225;rio especificado {0} n&#227;o &#233; v&#225;lido.
  </MsgText>
  <Explanation>
    Tentativa de mapear uma fun&#231;&#227;o de seguran&#231;a para um usu&#225;rio que n&#227;o &#233; v&#225;lido.
  </Explanation>
  <UserResponse>
    Verifique se o usu&#225;rio especificado existe.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Ocorreu um erro interno. Falha ao localizar o MBean do BundleCacheManager para o perfil {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: A liga&#231;&#227;o {0} para refer&#234;ncia EJB {1} no pacote configur&#225;vel {2} na vers&#227;o {3} com a interface {4} pode fazer com que o aplicativo funcione incorretamente ap&#243;s uma atualiza&#231;&#227;o.
  </MsgText>
  <Explanation>
    As partes constituintes das refer&#234;ncias de consulta java:global/application_name/module_name/ejb_name ou java:app/module_name/ejb_name podem ser alteradas depois que um aplicativo OSGi for atualizado, de modo que as refer&#234;ncias devem ser modificadas de acordo, o que torna essa abordagem impratic&#225;vel.
  </Explanation>
  <UserResponse>
    Use os servi&#231;os OSGi para configurar as depend&#234;ncias EJB ou declare uma refer&#234;ncia EJB e mapeie-a para o nome EJB JNDI.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Imposs&#237;vel expandir o arquivo enterprise bundle archive (EBA) {0}, n&#227;o &#233; poss&#237;vel criar o diret&#243;rio {1}.
  </MsgText>
  <Explanation>
    Ao tentar expandir o arquivo EBA especificado, um diret&#243;rio necess&#225;rio n&#227;o p&#244;de ser criado.
  </Explanation>
  <UserResponse>
    Certifique-se de que o servidor de aplicativos tem permiss&#227;o para criar o diret&#243;rio especificado.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: O recurso {0} n&#227;o pode ser resolvido. Ele possui requisitos de vers&#227;o incompat&#237;veis nos seguintes pacotes: {1}.
  </MsgText>
  <Explanation>
    Para os pacotes configur&#225;veis que est&#227;o listados no cabe&#231;alho Application-Content no APPLICATION.MF, todas as importa&#231;&#245;es de um determinado pacote dever&#227;o ser compat&#237;veis com os requisitos de vers&#227;o.
  </Explanation>
  <UserResponse>
    Altere o pacote ou a configura&#231;&#227;o do aplicativo para que todos os pacotes configur&#225;veis que est&#227;o listados no cabe&#231;alho Application-Content sejam compat&#237;veis com os requisitos de vers&#227;o de pacote.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Executar Como Fun&#231;&#245;es n&#227;o pode ser configurado para n&#243;s anteriores ao WebSphere Application Server Vers&#227;o 8. Toda configura&#231;&#227;o ser&#225; ignorada.
  </MsgText>
  <Explanation>
    Executar Como Fun&#231;&#245;es pode ser configurado apenas para WebSphere Application Server Vers&#227;o 8 e vers&#245;es posteriores. Eles n&#227;o podem ser configurados para uma unidade de composi&#231;&#227;o que esteja implementada nos destinos do OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7.
  </Explanation>
  <UserResponse>
    Nenhuma a&#231;&#227;o &#233; necess&#225;ria. Se Executar Como Fun&#231;&#245;es precisar ser configurado, remova todos os mapeamentos de destino para os n&#243;s OSGi Applications Feature Pack do WebSphere Application Server Vers&#227;o 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: O ID do usu&#225;rio ou a senha est&#225; incorreto.
  </MsgText>
  <Explanation>
    Foi fornecido um ID de usu&#225;rio incorreto ou senha incorreta.
  </Explanation>
  <UserResponse>
    Tente a a&#231;&#227;o novamente usando o ID do usu&#225;rio e a senha corretos.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: A opera&#231;&#227;o de atualiza&#231;&#227;o n&#227;o teve &#234;xito para o aplicativo OSGi implementado na unidade de composi&#231;&#227;o {0} no aplicativo em n&#237;vel de neg&#243;cios {1}.
  </MsgText>
  <Explanation>
    Ocorreu uma exce&#231;&#227;o durante a opera&#231;&#227;o de atualiza&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Inspecione os logs do servidor antes dessa exce&#231;&#227;o para obter diagn&#243;sticos mais espec&#237;ficos para o problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Ocorreu um erro interno. A entrada de Application-Content do manifesto do aplicativo no arquivo Enterprise Bundle Archive (EBA) {0} est&#225; vazia, portanto, nenhum bundle ser&#225; instalado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: N&#227;o &#233; poss&#237;vel ler o arquivo do descritor de aplicativo Java EE no arquivo EBA {0}.
  </MsgText>
  <Explanation>
    Ocorreu uma IOException ao ler o arquivo descritor de aplicativo Java EE em um arquivo Enterprise Bundle Archive (EBA).
  </Explanation>
  <UserResponse>
    Verifique se o arquivo descritor de aplicativo n&#227;o est&#225; corrompido, se &#233; leg&#237;vel e se possui conjunto de permiss&#245;es apropriadas.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: N&#227;o &#233; poss&#237;vel localizar a refer&#234;ncia de recurso ao nome da JNDI {0} e ao tipo {1} no destino {2} da refer&#234;ncia de recursos do m&#243;dulo da web {3} definida no pacote configur&#225;vel {4} com vers&#227;o {5}.
  </MsgText>
  <Explanation>
    Um Enterprise Bundle Archive (EBA) que inclui refer&#234;ncias de recursos em um Web Application Archive (WAR) especifica um nome JNDI para uma refer&#234;ncia de recurso que n&#227;o existe no espa&#231;o de nomes JNDI.
  </Explanation>
  <UserResponse>
    Se a refer&#234;ncia de recurso tiver que estar no espa&#231;o de nomes JNDI, ligue um objeto ao nome ou corrija a refer&#234;ncia de recurso e atualize o EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Nenhuma liga&#231;&#227;o padr&#227;o p&#244;de ser criada para a refer&#234;ncia EJB {0} no pacote configur&#225;vel {1} na vers&#227;o {2} com interface {3} porque h&#225; duas ou mais poss&#237;veis liga&#231;&#245;es. A refer&#234;ncia poderia ser ligada a qualquer um dos seguintes enterprise beans: {4}.
  </MsgText>
  <Explanation>
    Liga&#231;&#245;es padr&#227;o devem ser criadas para refer&#234;ncias EJB desvinculadas. Foi localizado mais de um poss&#237;vel enterprise bean ao qual essa refer&#234;ncia poderia ser ligada.
  </Explanation>
  <UserResponse>
    Ligue a refer&#234;ncia a um determinado enterprise bean ou corrija o aplicativo.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: O alias de autentica&#231;&#227;o {0} n&#227;o est&#225; configurado corretamente. Ele n&#227;o &#233; aplic&#225;vel para ligar um alias a um tipo de autentica&#231;&#227;o do Application para as refer&#234;ncias.
  </MsgText>
  <Explanation>
    Os Authentication aliases com um tipo de autentica&#231;&#227;o Application n&#227;o podem ser ligados &#224;s refer&#234;ncias de recursos de Blueprint.
  </Explanation>
  <UserResponse>
    Remova o authentication alias da refer&#234;ncia de recurso relevante.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: O host virtual {0} especificado para o pacote configur&#225;vel {1} n&#227;o existe.
  </MsgText>
  <Explanation>
    Tentativa de mapear um Web Application Bundle (WAB) para um host virtual que n&#227;o &#233; v&#225;lido.
  </Explanation>
  <UserResponse>
    Verifique se o host virtual especificado existe.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: O manifesto do aplicativo do arquivo EBA {0} lista os pacotes configur&#225;veis no cabe&#231;alho Application-Content que tamb&#233;m est&#227;o no cabe&#231;alho Use-Bundle.
  </MsgText>
  <Explanation>
    Os nomes do bundle que s&#227;o listados no cabe&#231;alho Application-Content do arquivo APPLICATION.MF tamb&#233;m n&#227;o podem ser listados no cabe&#231;alho Use-Bundle, independente das vers&#245;es do bundle.
  </Explanation>
  <UserResponse>
    Altere o pacote do Enterprise Bundle Archive (EBA) para que os nomes do bundle n&#227;o sejam duplicados nos cabe&#231;alhos Application-Content e Use-Bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: O Composite Bundle Archive (CBA) {0} n&#227;o &#233; v&#225;lido. Os pacotes importados por pacotes configur&#225;veis no CBA est&#227;o ausentes no cabe&#231;alho Import-Package do arquivo de manifesto do CBA. Os seguintes problemas foram relatados: {1}
  </MsgText>
  <Explanation>
    Se um pacote configur&#225;vel em um Composite Bundle Archive (CBA) usar um pacote que n&#227;o est&#225; contido no pacote configur&#225;vel, ou exportado por um outro pacote configur&#225;vel dentro do CBA, o CBA dever&#225; importar o pacote.
  </Explanation>
  <UserResponse>
    Corrija o manifesto composto, COMPOSITEBUNDLE.MF, para que o CBA importe qualquer pacote que seja usado por pacotes configur&#225;veis no CBA e n&#227;o esteja de outra forma dispon&#237;vel no CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: O enterprise bean {0} no pacote configur&#225;vel {1} na vers&#227;o {2} possui diversos mapeamentos para a interface {3} em seu arquivo de liga&#231;&#245;es. Os mapeamentos eram {4} e {5}.
  </MsgText>
  <Explanation>
    O arquivo de liga&#231;&#245;es EJB inclu&#237;do no pacote configur&#225;vel cont&#233;m informa&#231;&#245;es de configura&#231;&#227;o de mapeamento amb&#237;guas para uma interface EJB.
  </Explanation>
  <UserResponse>
    Corrija o arquivo de liga&#231;&#245;es para que haja apenas um mapeamento configurado para cada interface EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: Nenhuma unidade de composi&#231;&#227;o com o nome {0} pode ser localizada na c&#233;lula atual.
  </MsgText>
  <Explanation>
    O nome fornecido n&#227;o corresponde a qualquer nome de unidade de composi&#231;&#227;o existente.
  </Explanation>
  <UserResponse>
    Verifique o nome da unidade de composi&#231;&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: O arquivo EBA {0} cont&#233;m um MANIFEST.MF com o cabe&#231;alho Extension-List. A convers&#227;o deste cabe&#231;alho n&#227;o &#233; suportada.
  </MsgText>
  <Explanation>
    Voc&#234; tentou converter um arquivo EAR (enterprise archive) para um arquivo EBA (enterprise bundle archive); no entanto, o EAR cont&#233;m um MANIFEST.MF com um cabe&#231;alho Extension-List, sendo que a convers&#227;o n&#227;o &#233; suportada. Um arquivo EAR utiliza o cabe&#231;alho Extension-List para identificar JARs externos exigidos pelo sistema no tempo de execu&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Certifique-se de que os JARs externos nomeados no cabe&#231;alho Extension-List estejam dispon&#237;veis como pacotes configur&#225;veis no reposit&#243;rio de pacotes configur&#225;veis.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: O recurso {0} n&#227;o pode ser resolvido. Ele requer o bundle {1} que n&#227;o est&#225; listado no cabe&#231;alho Application-Content no manifesto do aplicativo,  APPLICATION.MF. Esse bundle importa o pacote {2} a partir do bundle {3}, que est&#225; listado no cabe&#231;alho Application-Content.
  </MsgText>
  <Explanation>
    O aplicativo n&#227;o est&#225; configurado corretamente. Um bundle compartilhado n&#227;o pode importar um pacote de um bundle isolado. Os pacotes configur&#225;veis que est&#227;o listados no cabe&#231;alho Application-Content s&#227;o isolados em podem fornecer pacotes apenas para outros pacotes configur&#225;veis listados nesse cabe&#231;alho.
  </Explanation>
  <UserResponse>
    Altere o pacote ou a configura&#231;&#227;o do aplicativo para que os pacotes configur&#225;veis que estiverem listados no cabe&#231;alho Use-Bundle ou inclu&#237;dos pelo resolvedor n&#227;o precisem de pacotes a partir dos pacotes configur&#225;veis que estiverem listados no cabe&#231;alho Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep n&#227;o foi executado e deveria ter sido.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: O recurso {0} n&#227;o pode ser implementado no destino {1} do dom&#237;nio de seguran&#231;a {2} e no destino {3} do dom&#237;nio de seguran&#231;a {4}.
  </MsgText>
  <Explanation>
    Para implementar o recurso em mais de um destino, todos os destinos dever&#227;o estar no mesmo dom&#237;nio de seguran&#231;a.
  </Explanation>
  <UserResponse>
    Altere os destinos de implementa&#231;&#227;o para escolher um conjunto que est&#225; em um dom&#237;nio de seguran&#231;a &#250;nico.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: O manifesto composto do Composite Bundle Archive (CBA) {0} cont&#233;m um cabe&#231;alho CompositeBundle-ExportService, mas nenhum servi&#231;o definido no CBA corresponde a esse filtro.
  </MsgText>
  <Explanation>
    O manifesto do pacote configur&#225;vel composto define um cabe&#231;alho CompositeBundle-ExportService, mas nenhuma declara&#231;&#227;o de servi&#231;o do projeto corresponde a esse filtro.
  </Explanation>
  <UserResponse>
    Inclua as declara&#231;&#245;es de servi&#231;o Blueprint ausentes no conte&#250;do do CBA ou corrija o cabe&#231;alho CompositeBundle-ExportService no manifesto composto, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: O enterprise bean {0} no pacote configur&#225;vel {1} na vers&#227;o {2} possui um nome de mapeamento simples definido, mas tamb&#233;m possui mapeamentos espec&#237;ficos em seu arquivo de liga&#231;&#245;es.
  </MsgText>
  <Explanation>
    O arquivo de liga&#231;&#245;es EJB inclu&#237;do no pacote configur&#225;vel cont&#233;m configura&#231;&#227;o de mapeamento inv&#225;lida para um enterprise bean.
  </Explanation>
  <UserResponse>
    Corrija o arquivo de liga&#231;&#245;es para que haja um nome de mapeamento simples ou informa&#231;&#245;es de configura&#231;&#227;o de mapeamento espec&#237;ficas, mas n&#227;o ambos.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel excluir o diret&#243;rio folha do {0} de forma que a renomea&#231;&#227;o de um diret&#243;rio possa continuar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Ocorreu um erro interno. N&#227;o &#233; poss&#237;vel expandir o Archive de Pacotes Configur&#225;veis Corporativos (EBA), n&#227;o h&#225; diret&#243;rio de expans&#227;o especificado na configura&#231;&#227;o para o {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: Foi feita uma tentativa para atualizar um recurso do aplicativo OSGi. Esse processo n&#227;o &#233; suportado. A atualiza&#231;&#227;o dos recursos de aplicativo OSGi pode ser executada usando o painel &quot;Atualizar vers&#245;es de pacote configur&#225;vel neste aplicativo&quot; na p&#225;gina de configura&#231;&#227;o do recurso do aplicativo OSGi.
  </MsgText>
  <Explanation>
    A atualiza&#231;&#227;o de um recurso de aplicativo OSGi com um novo bin&#225;rio n&#227;o &#233; suportada.
  </Explanation>
  <UserResponse>
    Caso precise fazer mais do que atualizar as vers&#245;es de pacote configur&#225;vel no recurso existente, voc&#234; deve desinstalar o recurso antes de importar seu substituto. Como alternativa, &#233; poss&#237;vel incluir novos pacotes configur&#225;veis em um aplicativo existente os compactando em um Composite Bundle Archive (CBA) e incluindo o CBA como uma extens&#227;o na unidade de composi&#231;&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Nenhum nome JNDI de Especifica&#231;&#227;o de Ativa&#231;&#227;o MDB foi configurado para o bean {0} no pacote configur&#225;vel {1} na vers&#227;o {2}, no destino {3}.
  </MsgText>
  <Explanation>
    O nome JNDI de Especifica&#231;&#227;o de Ativa&#231;&#227;o de liga&#231;&#227;o do Listener MDB n&#227;o foi configurado.
  </Explanation>
  <UserResponse>
    Voc&#234; deve configurar uma refer&#234;ncia JNDI de Especifica&#231;&#227;o de Ativa&#231;&#227;o para o MDB.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Imposs&#237;vel renomear o arquivo {0} a {1} como parte da expans&#227;o do arquivo enterprise bundle archive (EBA) {2}.
  </MsgText>
  <Explanation>
    Para concluir a expans&#227;o do arquivo EBA especificado, um arquivo precisa ser renomeado. Essa renomea&#231;&#227;o n&#227;o teve &#234;xito.
  </Explanation>
  <UserResponse>
    Certifique-se de que o servidor de aplicativos tem permiss&#227;o para renomear o arquivo.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: O Composite Bundle Archive (CBA), {0}, n&#227;o &#233; v&#225;lido. Os seguintes pacotes exportados listados no manifesto composto n&#227;o s&#227;o exportados por pacotes configur&#225;veis no CBA: {1}
  </MsgText>
  <Explanation>
    Um CBA pode exportar apenas pacotes que s&#227;o exportados pelos pacotes configur&#225;veis no CBA.
  </Explanation>
  <UserResponse>
    Inclua os pacotes de exporta&#231;&#227;o ausentes nos pacotes configur&#225;veis no CBA ou remova os detalhes das exporta&#231;&#245;es insatisfeitas do manifesto composto, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: N&#227;o &#233; poss&#237;vel incluir o recurso {0} porque os pacotes configur&#225;veis de que ele necessita n&#227;o podem ser transferidos por download. Para iniciar o download do bundle, salve as mudan&#231;as na configura&#231;&#227;o principal depois de importar o recurso.
  </MsgText>
  <Explanation>
    Voc&#234; tentou incluir um recurso que requer que um ou mais pacotes configur&#225;veis sejam transferidos por download a partir de um reposit&#243;rio. O download n&#227;o iniciou ou ele ainda n&#227;o est&#225; completo.
  </Explanation>
  <UserResponse>
    Se voc&#234; n&#227;o salvou as altera&#231;&#245;es depois de importar o recurso, salve as altera&#231;&#245;es agora. Aguarde o download do bundle ser conclu&#237;do e tente novamente incluir o recurso no aplicativo em n&#237;vel de neg&#243;cios (BLA). &#201; poss&#237;vel visualizar o status do download do bundle do recurso a partir do painel de detalhes do recurso no console administrativo.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: O conte&#250;do do manifesto de implementa&#231;&#227;o n&#227;o est&#225; correto. Os seguintes pacotes configur&#225;veis extras s&#227;o necess&#225;rios {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o a ser importado n&#227;o inclui todos os pacotes configur&#225;veis necess&#225;rios para resolver o recurso Enterprise Bundle Archive (EBA).
  </Explanation>
  <UserResponse>
    Verifique se o novo manifesto de implementa&#231;&#227;o, DEPLOYMENT.MF, inclui todos os pacotes configur&#225;veis que s&#227;o listados na mensagem de exce&#231;&#227;o. N&#227;o edite manualmente o manifesto de implementa&#231;&#227;o. Se necess&#225;rio, remova o manifesto de implementa&#231;&#227;o do EBA. Isso faz com que o arquivo de manifesto de implementa&#231;&#227;o novo seja gerado quando o EBA for importado.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: N&#227;o &#233; poss&#237;vel criar o diret&#243;rio {0}.
  </MsgText>
  <Explanation>
    O diret&#243;rio especificado n&#227;o pode ser criado.
  </Explanation>
  <UserResponse>
    Verifique se o espa&#231;o de armazenamento existe e se o produto possui as permiss&#245;es necess&#225;rias para criar o diret&#243;rio.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: N&#227;o &#233; poss&#237;vel exportar o recurso {0} porque o download do pacote configur&#225;vel {1} n&#227;o foi totalmente conclu&#237;do.
  </MsgText>
  <Explanation>
    Voc&#234; tentou exportar um recurso que requer que um ou mais pacotes configur&#225;veis sejam transferidos por download a partir de um reposit&#243;rio. O download n&#227;o iniciou ou ele ainda n&#227;o est&#225; completo.
  </Explanation>
  <UserResponse>
    Se voc&#234; n&#227;o salvou as altera&#231;&#245;es depois de importar o recurso, salve as altera&#231;&#245;es agora. Aguarde o download do pacote configur&#225;vel ser conclu&#237;do e tente novamente excluir o recurso.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Ocorreu um erro interno. O servi&#231;o DeploymentManifestManager n&#227;o est&#225; dispon&#237;vel no registro do servi&#231;o OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: N&#227;o &#233; poss&#237;vel resolver o arquivo EBA. O manifesto de implementa&#231;&#227;o inclu&#237;do n&#227;o &#233; v&#225;lido nesse sistema. Exce&#231;&#227;o: {0}.
  </MsgText>
  <Explanation>
    O manifesto de implementa&#231;&#227;o lista as vers&#245;es espec&#237;ficas dos pacotes configur&#225;veis necess&#225;rios. O sistema n&#227;o pode resolver as vers&#245;es de pacote configur&#225;vel. Quando um manifesto de implementa&#231;&#227;o &#233; inclu&#237;do em um arquivo EBA, o resolvedor usa apenas as vers&#245;es de pacote configur&#225;vel que est&#227;o especificadas no manifesto. &#201; poss&#237;vel que haja no sistema outras vers&#245;es de pacote configur&#225;vel v&#225;lidas, mas elas n&#227;o ser&#227;o usadas por n&#227;o estarem especificadas no manifesto de implementa&#231;&#227;o.
  </Explanation>
  <UserResponse>
    Se for necess&#225;rio usar um manifesto de implementa&#231;&#227;o para o seu aplicativo (por exemplo, para assegurar que exatamente a mesma configura&#231;&#227;o de pacote configur&#225;vel esteja em execu&#231;&#227;o em v&#225;rios ambientes diferentes), use as informa&#231;&#245;es dadas na exce&#231;&#227;o para identificar que vers&#245;es de pacote configur&#225;vel s&#227;o necess&#225;rias, e as disponibilize no sistema. Se o seu aplicativo n&#227;o precisar desse n&#237;vel extra de controle, remova o manifesto de implementa&#231;&#227;o. N&#227;o edite manualmente o manifesto de implementa&#231;&#227;o.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: O valor especificado para o manifesto de aplicativo vers&#227;o {0} n&#227;o &#233; suportado. A vers&#227;o suportada &#233; {1}.
  </MsgText>
  <Explanation>
    O valor especificado para o cabe&#231;alho Application-ManifestVersion em APPLICATION.MF est&#225; incorreto.
  </Explanation>
  <UserResponse>
    Corrija o valor de Application-ManifestVersion em APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Os requisitos especificados pelo manifesto de implementa&#231;&#227;o no EBA n&#227;o podem ser cumpridos. A exce&#231;&#227;o gerada &#233; {0}.
  </MsgText>
  <Explanation>
    Foi feita uma tentativa de importar um EBA que cont&#233;m um arquivo de manifesto de implementa&#231;&#227;o. Os requisitos especificados pelo arquivo n&#227;o puderam ser cumpridos.
  </Explanation>
  <UserResponse>
    Verifique o conte&#250;do do arquivo de manifesto de implementa&#231;&#227;o e verifique se o sistema no qual este EBA est&#225; sendo implementado &#233; compat&#237;vel. Verifique se quaisquer reposit&#243;rios de pacotes configur&#225;veis internos ou externos requeridos est&#227;o configurados. N&#227;o edite manualmente o manifesto de implementa&#231;&#227;o. Se necess&#225;rio, remova o manifesto de implementa&#231;&#227;o do EBA. Isso faz com que o arquivo de manifesto de implementa&#231;&#227;o novo seja gerado quando o EBA for importado.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: O arquivo EBA {0} especifica o Application-Content no manifesto do aplicativo, mas a entrada est&#225; vazia.
  </MsgText>
  <Explanation>
    Um arquivo Enterprise Bundle Archive (EBA) cont&#233;m um cabe&#231;alho do Application-Content vazio em seu manifesto do aplicativo, application.mf. Se fornecida, essa entrada dever&#225; listar pelo menos um bundle v&#225;lido.
  </Explanation>
  <UserResponse>
    Modifique o cabe&#231;alho do Application-Content no arquivo application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: Nenhum Destino MDB correspondente ao nome JNDI {0} p&#244;de ser localizada no destino {1} para o recurso usado pelo bean {2} no pacote configur&#225;vel {3} na vers&#227;o {4}.
  </MsgText>
  <Explanation>
    O nome JNDI da refer&#234;ncia de destino da liga&#231;&#227;o do listener MDB especificado n&#227;o existe.
  </Explanation>
  <UserResponse>
    Se a refer&#234;ncia tiver que estar no namespace JNDI, ligue um objeto ao nome ou corrija a refer&#234;ncia e atualize o EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: O arquivo EBA {0} n&#227;o especifica o Application-Content e n&#227;o cont&#233;m nenhum pacote configur&#225;vel v&#225;lido.
  </MsgText>
  <Explanation>
    Um arquivo Enterprise Bundle Archive (EBA) deve conter pelo menos um pacote configur&#225;vel OSGi v&#225;lido ou o arquivo Web Application Archive (WAR), ou listar pelo menos um pacote configur&#225;vel OSGi no cabe&#231;alho do Application-Content de seu arquivo de manifesto do aplicativo.
  </Explanation>
  <UserResponse>
    Modifique o arquivo EBA para conter pelo menos um bundle v&#225;lido ou WAR (inclu&#237;do pelo valor) ou listar pelo menos um bundle no cabe&#231;alho do Application-Content de seu arquivo de manifesto do aplicativo, application.mf (inclu&#237;do pela refer&#234;ncia).
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: Imposs&#237;vel criar o diret&#243;rio: {0}
  </MsgText>
  <Explanation>
    Houve um problema ao criar o nome do caminho requerido durante a exporta&#231;&#227;o do recurso.
  </Explanation>
  <UserResponse>
    Verifique se o servidor de aplicativos tem permiss&#227;o para criar esse nome do caminho.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
