# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment bietet Verbesserungen in Bezug auf Leistung, Management und hohe Verf\u00fcgbarkeit. \
Das Produkt kombiert ein nahezu unterunterbrochene Verf\u00fcgbarkeit mit automatisierter Leistungsoptimierung sowie zentralen Management- und \u00dcberwachungsfunktionen f\u00fcr gesch\u00e4ftskritische Anwendungen. 

nd.70.description=WebSphere Application Server Network Deployment bietet Verbesserungen in Bezug auf Leistung, Management und hohe Verf\u00fcgbarkeit. \
Das Produkt kombiert ein nahezu unterunterbrochene Verf\u00fcgbarkeit mit automatisierter Leistungsoptimierung sowie zentralen Management- und \u00dcberwachungsfunktionen f\u00fcr gesch\u00e4ftskritische Anwendungen. 
nd.70.feature.longname.samplesSelected=Anwendungsservermuster
nd.70.feature.description.samplesSelected=W\u00e4hlen Sie das Musterfeature aus, um Musteranwendungen zu installieren.
nd.70.feature.longname.languagepack.console.all=Sprachenpaket f\u00fcr die Administrationskonsole
nd.70.feature.description.languagepack.console.all=W\u00e4hlen Sie dieses Feature aus, um andere Sprache au\u00dfer Englisch f\u00fcr die Administrationskonsole zu installieren.
nd.70.feature.longname.languagepack.server.all=Sprachenpaket f\u00fcr Serverlaufzeitumgebung
nd.70.feature.description.languagepack.server.all=W\u00e4hlen Sie dieses Feature aus, um andere Sprache au\u00dfer Englisch f\u00fcr die Serverlaufzeitumgebung zu installieren.


updi.70.description=Update Installer installiert Aktualisierungen, wie z. B. vorl\u00e4ufige Fixes, Fixpacks und Refresh-Packs f\u00fcr IBM WebSphere-Software. \
Dieser Update Installer ist f\u00fcr Releases der WebSphere Application Server Version 7 bestimmt.

nd.70.maintenance.description=Dieses Installationspaket ist ein vom Benutzer assembliertes Wartungspaket f\u00fcr WebSphere Application Server Network Deployment Version 7.0. \
In dieses Paket k\u00f6nnen vom Benutzer ausgew\u00e4hlte vorl\u00e4ufige Fixes f\u00fcr das genannte Produkt, die von der IBM Unterst\u00fctzungswebsite heruntergeladen werden, gepackt werden. \
Au\u00dferdem kann dieses Paket unter Verwendung von Centralized Installation Manager und des WebSphere-Programms Update Installer f\u00fcr die Installation und Deinstallation ausgew\u00e4hlter Wartungspakete verwendet werden. \
Dieses Installationspaket ist vom Installationspaket des WebSphere-Programms Update Installer abh\u00e4ngig. \
Deshalb m\u00fcssen die Bin\u00e4rdateien f\u00fcr Update Installer heruntergeladen werden, bevor Fixes aus diesem Paket installiert werden.

nd.70.fixpack.description=In dieses Installationspaket k\u00f6nnen die Dateien gepackt werden, die erforderlich sind, um Installationen von WebSphere Application Server Network Deployment Version 7.0 auf den angegebenen Fixpack-Stand zu aktualisieren. \
Nach dem Herunterladen der Dateien f\u00fcr die erforderlichen Plattformen kann ein Administrator das Paket unter Verwendung von Centralized Installation Manager und des WebSphere-Programms Update Installer f\u00fcr die Installation auf geeigneten Hosts verwenden. \
Dieses Installationspaket ist vom Paket des WebSphere-Programms Update Installer abh\u00e4ngig. \
Deshalb m\u00fcssen die Bin\u00e4rdateien f\u00fcr Update Installer heruntergeladen werden, bevor dieses Installationspaket f\u00fcr die Aktualisierung von Zielhosts verwendet wird.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=Die Standardprofilposition f\u00fcr WebSphere Application Server for i5/OS enth\u00e4lt die konfigurierbaren Dateien f\u00fcr das Profil.\
Auf dieses Verzeichnis wird in vielen Information-Center-Beispielen mit user_data_root oder Datenstammverzeichnis_des_Benutzers verwiesen. \
Die Standardprofilposition ist das Verzeichnis, unter dem die Profilregistry und das Profilverzeichnis erstellt werden. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=Ein verwalteter Knoten von WebSphere Application Server mit dem Standardknotennamen und dem Profilnamen \"Custom01\" wird auf jedem der fernen Ziele erstellt und in die aktuelle Deployment-Manager-Zelle eingebunden. \
Nach erfolgreichem Abschluss der Operation erstellen Sie mit dem Deployment Manager einen Server oder einen Server-Cluster auf dem Knoten.


was.install.summary.400=Tempor\u00e4re Platzhalternachricht f\u00fcr Installationen unter i5/OS.


was.installWithRespFile.summary.all=Wenn das Installationsziel eine vorhandene Installation ist, versucht Centralized Installation Manager, alle aktiven Server auf dem Zielhost zu stoppen, bevor die Installationoperation gestartet wird.\
Die Fortsetzung der Operation wird auch dann zugelassen, wenn einige der aktiven Server nicht gestoppt werden konnten. \
Die nachfolgende Installation kann jedoch fehlschlagen. \
Wenn Sie nicht m\u00f6chten, dass die aktiven Server von Centralized Installation Manager gestoppt werden, k\u00f6nnen Sie diese Operation abbrechen. 


was.uninstall.summary.all=Centralized Installation Manager versucht, alle aktiven Server auf dem Zielhost zu stoppen, bevor die Deinstallationoperation gestartet wird.\
Die Fortsetzung der Operation wird auch dann zugelassen, wenn einige der aktiven Server nicht gestoppt werden konnten. \
Die nachfolgende Deinstallation kann jedoch fehlschlagen. \
Wenn Sie nicht m\u00f6chten, dass die aktiven Server von Centralized Installation Manager gestoppt werden, k\u00f6nnen Sie diese Operation abbrechen. 


was.maintenance.update.warning.all=Vor der Ausf\u00fchrung des Tools WebSphere Update Installer f\u00fcr die Installation bzw. Deinstallation von Wartungspaketen in den ausgew\u00e4hlten Zielen weist Centralized Installation Manager die Node Agents auf den Zielhosts an, alle aktiven Serverprozesse in den Zielen zu stoppen.\
Wenn die Node Agents auf dem Zielhost nicht aktiv sind, m\u00fcssen Sie sicherstellen, dass alle Serverprozesse in den ausgew\u00e4hlten Zielen gestoppt sind, bevor die Operation fortgesetzt wird.\
Nach erfolgreichem Abschluss der Wartungsaktualisierung im ausgew\u00e4hlten Ziel startet Centralized Installation Manager den Node Agent auf dem Zielhost automatisch erneut.


