# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment \u63d0\u4f9b\u9032\u968e\u7684\u6548\u80fd\u3001\u7ba1\u7406\u548c\u9ad8\u53ef\u7528\u6027\u3002\
\u5b83\u53ef\u91dd\u5c0d\u91cd\u8981\u5546\u696d\u61c9\u7528\u7a0b\u5f0f\uff0c\u5c07\u8fd1\u4e4e\u9023\u7e8c\u6027\u7684\u53ef\u7528\u6027\uff0c\u8207\u81ea\u52d5\u6548\u80fd\u6700\u4f73\u5316\u3001\u96c6\u4e2d\u7ba1\u7406\u4ee5\u53ca\u76e3\u8996\u529f\u80fd\u5408\u4f75\u5728\u4e00\u8d77\u3002


nd.70.description=WebSphere Application Server Network Deployment \u63d0\u4f9b\u9032\u968e\u7684\u6548\u80fd\u3001\u7ba1\u7406\u548c\u9ad8\u53ef\u7528\u6027\u3002\
\u5b83\u53ef\u91dd\u5c0d\u91cd\u8981\u5546\u696d\u61c9\u7528\u7a0b\u5f0f\uff0c\u5c07\u8fd1\u4e4e\u9023\u7e8c\u6027\u7684\u53ef\u7528\u6027\uff0c\u8207\u81ea\u52d5\u6548\u80fd\u6700\u4f73\u5316\u3001\u96c6\u4e2d\u7ba1\u7406\u4ee5\u53ca\u76e3\u8996\u529f\u80fd\u5408\u4f75\u5728\u4e00\u8d77\u3002

nd.70.feature.longname.samplesSelected=Application Server \u7bc4\u4f8b
nd.70.feature.description.samplesSelected=\u9078\u53d6\u300c\u7bc4\u4f8b\u300d\u7279\u6027\uff0c\u4ee5\u5b89\u88dd\u7bc4\u4f8b\u61c9\u7528\u7a0b\u5f0f\u3002
nd.70.feature.longname.languagepack.console.all=\u7ba1\u7406\u4e3b\u63a7\u53f0\u7684\u8a9e\u8a00\u5957\u4ef6
nd.70.feature.description.languagepack.console.all=\u9078\u53d6\u9019\u500b\u7279\u6027\uff0c\u4ee5\u5b89\u88dd\u975e\u82f1\u6587\u7248\u7684\u7ba1\u7406\u4e3b\u63a7\u53f0\u3002
nd.70.feature.longname.languagepack.server.all=\u4f3a\u670d\u5668\u57f7\u884c\u6642\u671f\u7684\u8a9e\u8a00\u5957\u4ef6
nd.70.feature.description.languagepack.server.all=\u9078\u53d6\u9019\u500b\u7279\u6027\uff0c\u4ee5\u5b89\u88dd\u975e\u82f1\u6587\u7248\u7684\u4f3a\u670d\u5668\u57f7\u884c\u6642\u671f\u3002


updi.70.description=\u300c\u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u6703\u5b89\u88dd IBM WebSphere \u8edf\u9ad4\u7684\u66f4\u65b0\u9805\u76ee\uff0c\u4f8b\u5982\uff0c\u81e8\u6642\u4fee\u6b63\u7a0b\u5f0f\u3001\u4fee\u6b63\u5957\u4ef6\u548c\u7522\u54c1\u66f4\u65b0\u5957\u4ef6\u3002\
\u9019\u500b\u300c\u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u662f\u91dd\u5c0d WebSphere Application Server \u7b2c 7 \u7248\u63d0\u4f9b\u3002

nd.70.maintenance.description=\u9019\u500b\u5b89\u88dd\u5957\u4ef6\u662f\u7531\u4f7f\u7528\u8005\u7d44\u5408\u7684 WebSphere Application Server Network Deployment 7.0 \u7248\u7dad\u8b77\u5957\u4ef6\u3002\
\u9019\u500b\u5957\u4ef6\u53ef\u7528\u4f86\u5305\u542b\u4e0a\u8ff0\u7522\u54c1\u3008\u4e0b\u8f09\u81ea IBM \u652f\u63f4\u7db2\u7ad9\u3009\u7684\u4f7f\u7528\u8005\u9078\u53d6\u81e8\u6642\u4fee\u6b63\u7a0b\u5f0f\u3002\
\u53e6\u5916\uff0c\u9019\u500b\u5957\u4ef6\u4e5f\u53ef\u4f9b\u60a8\u5229\u7528\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u548c\u300cWebSphere \u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\uff0c\u5f9e\u76ee\u6a19\u4e3b\u6a5f\u4e2d\u5b89\u88dd\u6216\u89e3\u9664\u5b89\u88dd\u6240\u9078\u7684\u7dad\u8b77\u3002\
\u9019\u500b\u5b89\u88dd\u5957\u4ef6\u76f8\u4f9d\u65bc\u300cWebSphere \u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u5b89\u88dd\u5957\u4ef6\u3002\
\u56e0\u6b64\uff0c\u60a8\u5fc5\u9808\u5148\u4e0b\u8f09\u300c\u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u7684\u4e8c\u9032\u4f4d\u6a94\uff0c\u624d\u80fd\u5f9e\u9019\u500b\u5957\u4ef6\u4e2d\u5b89\u88dd\u4efb\u4f55\u4fee\u6b63\u7a0b\u5f0f\u3002

nd.70.fixpack.description=\u9019\u500b\u5b89\u88dd\u5957\u4ef6\u53ef\u7528\u4f86\u5305\u542b\u5fc5\u8981\u7684\u6a94\u6848\uff0c\
\u85c9\u4ee5\u5c07 WebSphere Application Server Network Deployment 7.0 \u7248\u5b89\u88dd\u67b6\u69cb\u66f4\u65b0\u6210\u6307\u5b9a\u7684\u4fee\u6b63\u5957\u4ef6\u5c64\u6b21\u3002\
\u4e0b\u8f09\u6240\u9700\u5e73\u53f0\u7684\u6a94\u6848\u4e4b\u5f8c\uff0c\u7ba1\u7406\u8005\u53ef\u4ee5\u5229\u7528\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u548c\u300cWebSphere \u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u4ee5\u53ca\u9019\u500b\u5957\u4ef6\uff0c\u5728\u9069\u7576\u4e3b\u6a5f\u4e0a\u9032\u884c\u5b89\u88dd\u3002\
\u9019\u500b\u5b89\u88dd\u5957\u4ef6\u76f8\u4f9d\u65bc\u300cWebSphere \u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u5957\u4ef6\u3002\
\u56e0\u6b64\uff0c\u60a8\u5fc5\u9808\u5148\u4e0b\u8f09\u300c\u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u7684\u4e8c\u9032\u4f4d\u6a94\uff0c\u624d\u80fd\u5229\u7528\u9019\u500b\u5b89\u88dd\u5957\u4ef6\u4f86\u66f4\u65b0\u76ee\u6a19\u4e3b\u6a5f\u3002

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=WebSphere Application Server for i5/OS \u7684\u9810\u8a2d\u8a2d\u5b9a\u6a94\u4f4d\u7f6e\u542b\u6709\u8a2d\u5b9a\u6a94\u7684\u53ef\u914d\u7f6e\u6a94\u3002\
\u5728\u591a\u500b\u8cc7\u8a0a\u4e2d\u5fc3\u7bc4\u4f8b\u4e2d\uff0c\u9019\u500b\u76ee\u9304\u6307\u7684\u662f user_data_root\u3002\
\u5728\u9810\u8a2d\u8a2d\u5b9a\u6a94\u4f4d\u7f6e\u4e0b\uff0c\u5efa\u6709\u8a2d\u5b9a\u6a94\u767b\u9304\u548c\u8a2d\u5b9a\u6a94\u76ee\u9304\u3002

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=\u9810\u8a2d\u7bc0\u9ede\u540d\u7a31\u548c\u8a2d\u5b9a\u6a94\u540d\u7a31\u70ba \"Custom01\" \u7684\u53d7\u7ba1\u7406 WebSphere Application Server \u7bc0\u9ede\uff0c\
\u6703\u5efa\u7acb\u5728\u6bcf\u4e00\u500b\u9060\u7aef\u76ee\u6a19\u4e0a\uff0c\u4e26\u806f\u5408\u81f3\u73fe\u884c\u90e8\u7f72\u7ba1\u7406\u7a0b\u5f0f Cell \u4e2d\u3002\
\u5728\u9806\u5229\u5b8c\u6210\u4f5c\u696d\u5f8c\uff0c\
\u8acb\u4f7f\u7528\u90e8\u7f72\u7ba1\u7406\u7a0b\u5f0f\uff0c\u5728\u7bc0\u9ede\u4e2d\u5efa\u7acb\u4f3a\u670d\u5668\u6216\u4f3a\u670d\u5668\u53e2\u96c6\u3002

was.install.summary.400=\u5b89\u88dd\u5728 i5/OS \u6642\u7684\u66ab\u6642\u4f4d\u7f6e\u4fdd\u7559\u5143\u6458\u8981\u8a0a\u606f\u3002


was.installWithRespFile.summary.all=\u5982\u679c\u5b89\u88dd\u76ee\u6a19\u662f\u73fe\u6709\u7684\u5b89\u88dd\uff0c\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u6703\u5148\u8a66\u5716\u505c\u6b62\u76ee\u6a19\u4e3b\u6a5f\u4e0a\u6240\u6709\u57f7\u884c\u4e2d\u7684\u4f3a\u670d\u5668\uff0c\u7136\u5f8c\u518d\u555f\u52d5\u5b89\u88dd\u4f5c\u696d\u3002\
\u5373\u4f7f\u7121\u6cd5\u505c\u6b62\u90e8\u5206\u57f7\u884c\u4e2d\u7684\u4f3a\u670d\u5668\uff0c\u9084\u662f\u53ef\u4ee5\u7e7c\u7e8c\u9032\u884c\u5b89\u88dd\u4f5c\u696d\u3002\
\u4e0d\u904e\uff0c\u5f8c\u7e8c\u7684\u5b89\u88dd\u53ef\u80fd\u6703\u5931\u6557\u3002\
\u5982\u679c\u60a8\u76ee\u524d\u4e0d\u60f3\u8981\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u505c\u6b62\u57f7\u884c\u4e2d\u7684\u4f3a\u670d\u5668\uff0c\u5247\u61c9\u8a72\u53d6\u6d88\u9019\u9805\u4f5c\u696d\u3002


was.uninstall.summary.all=\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u6703\u5148\u8a66\u5716\u505c\u6b62\u76ee\u6a19\u4e3b\u6a5f\u4e0a\u6240\u6709\u57f7\u884c\u4e2d\u7684\u4f3a\u670d\u5668\uff0c\u7136\u5f8c\u518d\u555f\u52d5\u89e3\u9664\u5b89\u88dd\u4f5c\u696d\u3002\
\u5373\u4f7f\u7121\u6cd5\u505c\u6b62\u90e8\u5206\u57f7\u884c\u4e2d\u7684\u4f3a\u670d\u5668\uff0c\u9084\u662f\u53ef\u4ee5\u7e7c\u7e8c\u9032\u884c\u5b89\u88dd\u4f5c\u696d\u3002\
\u4e0d\u904e\uff0c\u5f8c\u7e8c\u7684\u89e3\u9664\u5b89\u88dd\u53ef\u80fd\u6703\u5931\u6557\u3002\
\u5982\u679c\u60a8\u76ee\u524d\u4e0d\u60f3\u8981\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u505c\u6b62\u57f7\u884c\u4e2d\u7684\u4f3a\u670d\u5668\uff0c\u5247\u61c9\u8a72\u53d6\u6d88\u9019\u9805\u4f5c\u696d\u3002


was.maintenance.update.warning.all=\u5728\u6240\u9078\u76ee\u6a19\u4e0a\u57f7\u884c\u300cWebSphere \u66f4\u65b0\u5b89\u88dd\u7a0b\u5f0f\u300d\u5de5\u5177\u4f86\u5b89\u88dd\u6216\u89e3\u9664\u5b89\u88dd\u7dad\u8b77\u7a0b\u5f0f\u4e4b\u524d\uff0c\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u6703\u547c\u53eb\u76ee\u6a19\u4e3b\u6a5f\u4e0a\u7684\u7bc0\u9ede\u4ee3\u7406\u7a0b\u5f0f\uff0c\u505c\u6b62\u76ee\u6a19\u4e0a\u7684\u6240\u6709\u57f7\u884c\u4e2d\u4f3a\u670d\u5668\u8655\u7406\u7a0b\u5e8f\u3002\
\u5982\u679c\u7bc0\u9ede\u4ee3\u7406\u7a0b\u5f0f\u4e0d\u5728\u76ee\u6a19\u4e3b\u6a5f\u4e0a\u57f7\u884c\uff0c\u60a8\u5fc5\u9808\u78ba\u5b9a\u6240\u9078\u76ee\u6a19\u4e0a\u7684\u6240\u6709\u4f3a\u670d\u5668\u8655\u7406\u7a0b\u5e8f\u90fd\u505c\u6b62\u5f8c\uff0c\u518d\u7e7c\u7e8c\u9032\u884c\u3002\
\u9806\u5229\u5b8c\u6210\u6240\u9078\u76ee\u6a19\u4e0a\u7684\u7dad\u8b77\u7a0b\u5f0f\u66f4\u65b0\u4f5c\u696d\u4e4b\u5f8c\uff0c\u96c6\u4e2d\u5f0f\u5b89\u88dd\u7ba1\u7406\u7a0b\u5f0f\u5c07\u6703\u81ea\u52d5\u91cd\u65b0\u555f\u52d5\u76ee\u6a19\u4e3b\u6a5f\u4e0a\u7684\u7bc0\u9ede\u4ee3\u7406\u7a0b\u5f0f\u3002


