# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment \u63d0\u4f9b\u4e86\u9ad8\u7ea7\u6027\u80fd\u3001\u7ba1\u7406\u548c\u9ad8\u53ef\u7528\u6027\u3002\
\u5b83\u5c06\u63a5\u8fd1\u4e8e\u8fde\u7eed\u7684\u53ef\u7528\u6027\u4e0e\u81ea\u52a8\u6027\u80fd\u4f18\u5316\u3001\u96c6\u4e2d\u7ba1\u7406\u548c\u76d1\u89c6\u7ec4\u5408\u5728\u4e00\u8d77\uff0c\u9002\u7528\u4e8e\u4f01\u4e1a\u7684\u91cd\u8981\u5e94\u7528\u7a0b\u5e8f\u3002

nd.70.description=WebSphere Application Server Network Deployment \u63d0\u4f9b\u4e86\u9ad8\u7ea7\u6027\u80fd\u3001\u7ba1\u7406\u548c\u9ad8\u53ef\u7528\u6027\u3002\
\u5b83\u5c06\u63a5\u8fd1\u4e8e\u8fde\u7eed\u7684\u53ef\u7528\u6027\u4e0e\u81ea\u52a8\u6027\u80fd\u4f18\u5316\u3001\u96c6\u4e2d\u7ba1\u7406\u548c\u76d1\u89c6\u7ec4\u5408\u5728\u4e00\u8d77\uff0c\u9002\u7528\u4e8e\u4f01\u4e1a\u7684\u91cd\u8981\u5e94\u7528\u7a0b\u5e8f\u3002
nd.70.feature.longname.samplesSelected=\u5e94\u7528\u7a0b\u5e8f\u670d\u52a1\u5668\u6837\u672c
nd.70.feature.description.samplesSelected=\u9009\u62e9\u8981\u5b89\u88c5\u6837\u672c\u5e94\u7528\u7a0b\u5e8f\u7684\u6837\u672c\u529f\u80fd\u90e8\u4ef6\u3002
nd.70.feature.longname.languagepack.console.all=\u7ba1\u7406\u63a7\u5236\u53f0\u7684\u8bed\u8a00\u5305
nd.70.feature.description.languagepack.console.all=\u9009\u62e9\u6b64\u529f\u80fd\u90e8\u4ef6\u4ee5\u5b89\u88c5\u7ba1\u7406\u63a7\u5236\u53f0\u7684\u975e\u82f1\u8bed\u8bed\u8a00\u3002
nd.70.feature.longname.languagepack.server.all=\u670d\u52a1\u5668\u8fd0\u884c\u65f6\u7684\u8bed\u8a00\u5305
nd.70.feature.description.languagepack.server.all=\u9009\u62e9\u6b64\u529f\u80fd\u90e8\u4ef6\u4ee5\u5b89\u88c5\u670d\u52a1\u5668\u8fd0\u884c\u65f6\u7684\u975e\u82f1\u8bed\u8bed\u8a00\u3002


updi.70.description=Update Installer \u7528\u4e8e\u5b89\u88c5 IBM WebSphere \u8f6f\u4ef6\u7684\u66f4\u65b0\uff0c\u4f8b\u5982\u4e34\u65f6\u4fee\u8ba2\u3001\u4fee\u8ba2\u5305\u548c\u66f4\u65b0\u5305\u3002\
\u672c Update Installer \u7528\u4e8e WebSphere Application Server V7 \u53d1\u884c\u7248\u3002

nd.70.maintenance.description=\u6b64\u5b89\u88c5\u8f6f\u4ef6\u5305\u662f WebSphere Application Server Network Deployment V7.0 \u7684\u7528\u6237\u7ec4\u88c5\u7ef4\u62a4\u5305\u3002\
\u6b64\u8f6f\u4ef6\u5305\u53ef\u7528\u4e8e\u5305\u542b\u4ece IBM \u652f\u6301 Web \u7ad9\u70b9\u4e0b\u8f7d\u7684\u6307\u5b9a\u4ea7\u54c1\u7684\u7528\u6237\u6240\u9009\u4e34\u65f6\u4fee\u8ba2\u3002\
\u6b64\u8f6f\u4ef6\u5305\u8fd8\u53ef\u7528\u4e8e\u901a\u8fc7\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u548c WebSphere Update Installer \u5bf9\u76ee\u6807\u4e3b\u673a\u5b89\u88c5\u6216\u5378\u8f7d\u6240\u9009\u7ef4\u62a4\u5305\u3002\
\u6b64\u5b89\u88c5\u8f6f\u4ef6\u5305\u4f9d\u8d56\u4e8e WebSphere Update Installer \u5b89\u88c5\u8f6f\u4ef6\u5305\u3002\
\u540c\u6837\uff0c\u5b89\u88c5\u6b64\u8f6f\u4ef6\u5305\u4e2d\u7684\u4efb\u4f55\u4fee\u8ba2\u524d\uff0c\u5fc5\u987b\u4e0b\u8f7d Update Installer \u4e8c\u8fdb\u5236\u6587\u4ef6\u3002

nd.70.fixpack.description=\u6b64\u5b89\u88c5\u8f6f\u4ef6\u5305\u53ef\u7528\u4e8e\u5305\u542b\u5c06 WebSphere Application Server Network Deployment V7.0 \u5b89\u88c5\u7248\u672c\u66f4\u65b0\u5230\u6240\u6307\u5b9a\u4fee\u8ba2\u5305\u7ea7\u522b\u65f6\u9700\u8981\u7684\u6587\u4ef6\u3002\
\u4e0b\u8f7d\u9002\u7528\u4e8e\u6240\u9700\u5e73\u53f0\u7684\u6587\u4ef6\u540e\uff0c\u7ba1\u7406\u5458\u53ef\u901a\u8fc7\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u548c WebSphere Update Installer \u5c06\u8f6f\u4ef6\u5305\u5b89\u88c5\u5728\u76f8\u5e94\u7684\u4e3b\u673a\u4e0a\u3002\
\u6b64\u5b89\u88c5\u8f6f\u4ef6\u5305\u4f9d\u8d56\u4e8e WebSphere Update Installer \u8f6f\u4ef6\u5305\u3002\
\u540c\u6837\uff0c\u4f7f\u7528\u6b64\u5b89\u88c5\u8f6f\u4ef6\u5305\u6765\u66f4\u65b0\u76ee\u6807\u4e3b\u673a\u524d\uff0c\u5fc5\u987b\u4e0b\u8f7d Update Installer \u4e8c\u8fdb\u5236\u6587\u4ef6\u3002

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=WebSphere Application Server for i5/OS \u7684\u7f3a\u7701\u6982\u8981\u6587\u4ef6\u4f4d\u7f6e\u5305\u542b\u6982\u8981\u6587\u4ef6\u7684\u53ef\u914d\u7f6e\u6587\u4ef6\u3002\
\u8bb8\u591a\u4fe1\u606f\u4e2d\u5fc3\u793a\u4f8b\u4e2d\u5c06\u6b64\u76ee\u5f55\u79f0\u4e3a user_data_root\u3002\
\u7f3a\u7701\u6982\u8981\u6587\u4ef6\u4f4d\u7f6e\u662f\u5728\u5176\u4e2d\u521b\u5efa\u6982\u8981\u6587\u4ef6\u6ce8\u518c\u8868\u548c\u6982\u8981\u6587\u4ef6\u76ee\u5f55\u7684\u76ee\u5f55\u3002

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=\u5c06\u5728\u6bcf\u4e2a\u8fdc\u7a0b\u76ee\u6807\u4e0a\u521b\u5efa\u4e00\u4e2a\u5177\u6709\u7f3a\u7701\u8282\u70b9\u540d\u7684\u53d7\u7ba1 WebSphere Application Server \u8282\u70b9\u548c\u4e00\u4e2a\u540d\u4e3a\u201cCustom01\u201d\u7684\u6982\u8981\u6587\u4ef6\uff0c\u5e76\u5c06\u8be5\u8282\u70b9\u548c\u6982\u8981\u6587\u4ef6\u8054\u5408\u5230\u5f53\u524d Deployment Manager \u5355\u5143\u3002\
\u5728\u8be5\u64cd\u4f5c\u6210\u529f\u5b8c\u6210\u540e\uff0c\u8bf7\u4f7f\u7528 Deployment Manager \u5728\u8282\u70b9\u4e2d\u521b\u5efa\u4e00\u4e2a\u670d\u52a1\u5668\u6216\u4e00\u4e2a\u670d\u52a1\u5668\u96c6\u7fa4\u3002

was.install.summary.400=\u5728 i5/OS \u4e0a\u5b89\u88c5\u65f6\u7684\u4e34\u65f6\u5360\u4f4d\u7b26\u6458\u8981\u6d88\u606f\u3002


was.installWithRespFile.summary.all=\u5982\u679c\u5b89\u88c5\u76ee\u6807\u662f\u73b0\u6709\u5b89\u88c5\uff0c\u90a3\u4e48\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u5c06\u5728\u542f\u52a8\u5b89\u88c5\u64cd\u4f5c\u4e4b\u524d\u5c1d\u8bd5\u505c\u6b62\u76ee\u6807\u4e3b\u673a\u4e0a\u6240\u6709\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\u3002\
\u5373\u4f7f\u65e0\u6cd5\u505c\u6b62\u67d0\u4e9b\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\uff0c\u4e5f\u4f1a\u5141\u8bb8\u7ee7\u7eed\u6267\u884c\u8be5\u64cd\u4f5c\u3002\
\u7136\u800c\uff0c\u540e\u7eed\u5b89\u88c5\u53ef\u80fd\u4f1a\u5931\u8d25\u3002\
\u5982\u679c\u60a8\u6b64\u65f6\u4e0d\u5e0c\u671b\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u505c\u6b62\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\uff0c\u90a3\u4e48\u60a8\u5e94\u8be5\u53d6\u6d88\u6b64\u64cd\u4f5c\u3002


was.uninstall.summary.all=\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u5c06\u5728\u542f\u52a8\u5378\u8f7d\u64cd\u4f5c\u4e4b\u524d\u5c1d\u8bd5\u505c\u6b62\u76ee\u6807\u4e3b\u673a\u4e0a\u6240\u6709\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\u3002\
\u5373\u4f7f\u65e0\u6cd5\u505c\u6b62\u67d0\u4e9b\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\uff0c\u4e5f\u4f1a\u5141\u8bb8\u7ee7\u7eed\u6267\u884c\u8be5\u64cd\u4f5c\u3002\
\u7136\u800c\uff0c\u540e\u7eed\u5378\u8f7d\u53ef\u80fd\u4f1a\u5931\u8d25\u3002\
\u5982\u679c\u60a8\u6b64\u65f6\u4e0d\u5e0c\u671b\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u505c\u6b62\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\uff0c\u90a3\u4e48\u60a8\u5e94\u8be5\u53d6\u6d88\u6b64\u64cd\u4f5c\u3002


was.maintenance.update.warning.all=\u5728\u8fd0\u884c WebSphere Update Installer \u5de5\u5177\u4ee5\u5b89\u88c5\u6216\u5378\u8f7d\u6240\u9009\u76ee\u6807\u4e0a\u7684\u7ef4\u62a4\u4e4b\u524d\uff0c\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u5728\u76ee\u6807\u4e3b\u673a\u4e0a\u8c03\u7528 Node Agent \u4ee5\u505c\u6b62\u76ee\u6807\u4e0a\u6240\u6709\u6b63\u5728\u8fd0\u884c\u7684\u670d\u52a1\u5668\u8fdb\u7a0b\u3002\
\u5982\u679c Node Agent \u672a\u5728\u76ee\u6807\u4e3b\u673a\u4e0a\u8fd0\u884c\uff0c\u90a3\u4e48\u60a8\u5fc5\u987b\u786e\u4fdd\u5728\u7ee7\u7eed\u4e4b\u524d\u6240\u9009\u76ee\u6807\u4e0a\u7684\u6240\u6709\u670d\u52a1\u5668\u8fdb\u7a0b\u5df2\u505c\u6b62\u3002\
\u6210\u529f\u5b8c\u6210\u6240\u9009\u76ee\u6807\u4e0a\u7684\u7ef4\u62a4\u66f4\u65b0\u65f6\uff0c\u96c6\u4e2d\u5b89\u88c5\u7ba1\u7406\u5668\u5c06\u5728\u76ee\u6807\u4e3b\u673a\u4e0a\u81ea\u52a8\u91cd\u65b0\u542f\u52a8 NodeAgent\u3002


