# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=Produkt WebSphere Application Server Network Deployment nab\u00edz\u00ed vylep\u0161en\u00fd v\u00fdkon, spr\u00e1vu a vysokou dostupnost. \
Kombinuje skoro nep\u0159etr\u017eitou dostupnost s automatizovanou optimalizac\u00ed v\u00fdkonu, centralizovanou spr\u00e1vou a sledov\u00e1n\u00edm, to v\u0161e pro kritick\u00e9 podnikov\u00e9 aplikace.  

nd.70.description=Produkt WebSphere Application Server Network Deployment nab\u00edz\u00ed vylep\u0161en\u00fd v\u00fdkon, spr\u00e1vu a vysokou dostupnost. \
Kombinuje skoro nep\u0159etr\u017eitou dostupnost s automatizovanou optimalizac\u00ed v\u00fdkonu, centralizovanou spr\u00e1vou a sledov\u00e1n\u00edm, to v\u0161e pro kritick\u00e9 podnikov\u00e9 aplikace.  
nd.70.feature.longname.samplesSelected=Uk\u00e1zky aplika\u010dn\u00edho serveru
nd.70.feature.description.samplesSelected=Vyberte funkci Uk\u00e1zky a nainstalujte uk\u00e1zkov\u00e9 aplikace.
nd.70.feature.longname.languagepack.console.all=Jazykov\u00e1 sada pro administrativn\u00ed konzolu
nd.70.feature.description.languagepack.console.all=Tuto funkci vyberte, chcete-li pro administrativn\u00ed konzolu instalovat jin\u00e9 jazyky ne\u017e angli\u010dtinu.
nd.70.feature.longname.languagepack.server.all=Jazykov\u00e1 sada pro b\u011bhov\u00e9 prost\u0159ed\u00ed serveru
nd.70.feature.description.languagepack.server.all=Tuto funkci vyberte, chcete-li pro b\u011bhov\u00e9 prost\u0159ed\u00ed serveru instalovat jin\u00e9 jazyky ne\u017e angli\u010dtinu.


updi.70.description=Aktualiza\u010dn\u00ed program instaluje aktualizace, jako jsou prozat\u00edmn\u00ed opravy, opravn\u00e9 sady a aktualiza\u010dn\u00ed sady, pro software IBM WebSphere. \
Aktualiza\u010dn\u00ed program je ur\u010den pro verze 7 produktu WebSphere Application Server.

nd.70.maintenance.description=Tento instala\u010dn\u00ed bal\u00edk je u\u017eivatelem sestaven\u00fd bal\u00edk \u00fadr\u017eby pro produkt WebSphere Application Server Network Deployment verze 7.0. \
Tento bal\u00edk lze pou\u017e\u00edt k um\u00edst\u011bn\u00ed prozat\u00edmn\u00edch oprav vybran\u00fdch u\u017eivatelem pro p\u0159\u00edslu\u0161n\u00fd produkt sta\u017een\u00fd z webu podpory spole\u010dnosti IBM. \
Tento bal\u00edk lze tak\u00e9 pou\u017e\u00edt k instalaci vybran\u00e9 \u00fadr\u017eby na c\u00edlov\u00e9 hostitele nebo jej\u00ed odinstalaci pomoc\u00ed spr\u00e1vce centralizovan\u00e9 instalace (CIM) a aktualiza\u010dn\u00edho programu platformy WebSphere. \
Tento instala\u010dn\u00ed bal\u00edk z\u00e1vis\u00ed na instala\u010dn\u00edm bal\u00edku aktualiza\u010dn\u00edho programu platformy WebSphere. \
Proto bin\u00e1rn\u00ed soubory aktualiza\u010dn\u00edho programu je t\u0159eba st\u00e1hnout p\u0159ed instalac\u00ed jak\u00fdchkoli oprav z tohoto bal\u00edku.

nd.70.fixpack.description=Tento instala\u010dn\u00ed bal\u00edk lze pou\u017e\u00edt k p\u0159id\u00e1n\u00ed soubor\u016f nutn\u00fdch k aktualizaci instalac\u00ed produktu WebSphere Application Server Network Deployment verze 7.0 na ur\u010denou \u00farove\u0148 opravn\u00e9 sady. \
Pot\u00e9, co jsou sta\u017eeny soubory pro po\u017eadovan\u00e9 platformy, administr\u00e1tor m\u016f\u017ee pou\u017e\u00edt bal\u00edk pro instalaci na p\u0159\u00edslu\u0161n\u00e9 hostitele pomoc\u00ed spr\u00e1vce centralizovan\u00e9 instalace (CIM) a aktualiza\u010dn\u00edho programu platformy WebSphere. \
Tento instala\u010dn\u00ed bal\u00edk z\u00e1vis\u00ed na bal\u00edku aktualiza\u010dn\u00edho programu platformy WebSphere. \
Proto bin\u00e1rn\u00ed soubory aktualiza\u010dn\u00edho programu je t\u0159eba st\u00e1hnout p\u0159ed pou\u017eit\u00edm tohoto instala\u010dn\u00edho bal\u00edku k aktualizaci c\u00edlov\u00fdch hostitel\u016f.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=V\u00fdchoz\u00ed um\u00edst\u011bn\u00ed profilu pro produkt WebSphere Application Server for i5/OS obsahuje konfigurovateln\u00e9 soubory profilu. \
Mnoho p\u0159\u00edklad\u016f obsa\u017een\u00fdch v Informa\u010dn\u00edm centru se na tento adres\u00e1\u0159 odkazuje jako na ko\u0159enov\u00fd adres\u00e1\u0159 u\u017eivatelsk\u00fdch dat. \
V\u00fdchoz\u00edm um\u00edst\u011bn\u00edm profilu je adres\u00e1\u0159, ve kter\u00e9m je vytvo\u0159en registr profilu a adres\u00e1\u0159 profil\u016f. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=V ka\u017ed\u00e9m vzd\u00e1len\u00e9m c\u00edli bude vytvo\u0159en spravovan\u00fd uzel produktu WebSphere Application Server s v\u00fdchoz\u00edm n\u00e1zvem uzlu a s n\u00e1zvem profilu \"Custom01\"; tento uzel bude sdru\u017een s aktu\u00e1ln\u00ed bu\u0148kou spr\u00e1vce implementace. \
Po \u00fasp\u011b\u0161n\u00e9m dokon\u010den\u00ed operace v r\u00e1mci uzlu vytvo\u0159te server nebo klastr server\u016f pomoc\u00ed spr\u00e1vce implementace. 

was.install.summary.400=Souhrnn\u00e1 zpr\u00e1va do\u010dasn\u00e9ho z\u00e1stupn\u00e9ho symbolu pro instalaci v syst\u00e9mu i5/OS.


was.installWithRespFile.summary.all=Pokud c\u00edlem instalace je existuj\u00edc\u00ed instalace, spr\u00e1vce centralizovan\u00e9 instalace (CIM) se p\u0159ed spu\u0161t\u011bn\u00edm instalace pokus\u00ed zastavit v\u0161echny servery spu\u0161t\u011bn\u00e9 na c\u00edlov\u00e9m hostiteli. \
Pokra\u010dov\u00e1n\u00ed v operaci bude povoleno i v p\u0159\u00edpad\u011b, \u017ee n\u011bkter\u00e9 spu\u0161t\u011bn\u00e9 servery nebude mo\u017en\u00e9 zastavit. \
V tom p\u0159\u00edpad\u011b v\u0161ak m\u016f\u017ee doj\u00edt k selh\u00e1n\u00ed instalace. \
Pokud nechcete, aby spu\u0161t\u011bn\u00e9 servery byly v t\u00e9to chv\u00edli spr\u00e1vcem centralizovan\u00e9 instalace (CIM) zastaveny, mus\u00edte tuto operaci zru\u0161it.   


was.uninstall.summary.all=Spr\u00e1vce centralizovan\u00e9 instalace (CIM) se p\u0159ed spu\u0161t\u011bn\u00edm odinstalace pokus\u00ed zastavit v\u0161echny servery spu\u0161t\u011bn\u00e9 na c\u00edlov\u00e9m hostiteli. \
Pokra\u010dov\u00e1n\u00ed v operaci bude povoleno i v p\u0159\u00edpad\u011b, \u017ee n\u011bkter\u00e9 spu\u0161t\u011bn\u00e9 servery nebude mo\u017en\u00e9 zastavit. \
V tom p\u0159\u00edpad\u011b v\u0161ak m\u016f\u017ee doj\u00edt k selh\u00e1n\u00ed odinstalace. \
Pokud nechcete, aby spu\u0161t\u011bn\u00e9 servery byly v t\u00e9to chv\u00edli spr\u00e1vcem centralizovan\u00e9 instalace (CIM) zastaveny, mus\u00edte tuto operaci zru\u0161it.   


was.maintenance.update.warning.all=P\u0159ed spu\u0161t\u011bn\u00edm n\u00e1stroje aktualiza\u010dn\u00edho programu platformy WebSphere za \u00fa\u010delem instalace nebo odinstalace \u00fadr\u017eby na vybran\u00fdch c\u00edlech provede spr\u00e1vce centralizovan\u00e9 instalace (CIM) na v\u0161ech agentech uzlu vol\u00e1n\u00ed, kter\u00e9 v c\u00edlech zastav\u00ed v\u0161echny spu\u0161t\u011bn\u00e9 procesy serveru. \
V p\u0159\u00edpad\u011b, \u017ee na c\u00edlov\u00e9m hostiteli nejsou spu\u0161t\u011bni agenti uzl\u016f, je t\u0159eba p\u0159ed pokra\u010dov\u00e1n\u00edm zajistit, \u017ee jsou na vybran\u00fdch c\u00edlech zastaveny v\u0161echny procesy serveru. \
Po \u00fasp\u011b\u0161n\u00e9m dokon\u010den\u00ed aktualizace \u00fadr\u017eby na vybran\u00e9m c\u00edli spr\u00e1vce centralizovan\u00e9 instalace (CIM) automaticky znovu spust\u00ed agenta uzlu na c\u00edlov\u00e9m hostiteli.


