# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment ofrece un rendimiento, una gesti\u00f3n y una alta disponibilidad avanzados. \
Combina una disponibilidad casi ininterrumpida con una optimizaci\u00f3n automatizada del rendimiento y una gesti\u00f3n y supervisi\u00f3n centralizadas para las aplicaciones m\u00e1s importantes.   

nd.70.description=WebSphere Application Server Network Deployment ofrece un rendimiento, una gesti\u00f3n y una alta disponibilidad avanzados. \
Combina una disponibilidad casi ininterrumpida con una optimizaci\u00f3n automatizada del rendimiento y una gesti\u00f3n y supervisi\u00f3n centralizadas para las aplicaciones m\u00e1s importantes.   
nd.70.feature.longname.samplesSelected=Ejemplos de Application Server
nd.70.feature.description.samplesSelected=Seleccione la caracter\u00edstica de ejemplos para instalar las aplicaciones de ejemplo.
nd.70.feature.longname.languagepack.console.all=Paquete de idiomas para la consola administrativa
nd.70.feature.description.languagepack.console.all=Seleccione esta caracter\u00edstica para instalar los idiomas que no son ingl\u00e9s para la consola administrativa.
nd.70.feature.longname.languagepack.server.all=Paquete de idiomas para el tiempo de ejecuci\u00f3n del servidor
nd.70.feature.description.languagepack.server.all=Seleccione esta caracter\u00edstica para instalar los idiomas que no son ingl\u00e9s para el tiempo de ejecuci\u00f3n del servidor.


updi.70.description=Update Installer instala actualizaciones, como arreglos temporales, fixpacks y paquetes de renovaci\u00f3n, para el software IBM WebSphere. \
Este instalador de actualizaciones es para los releases de WebSphere Application Server V7.

nd.70.maintenance.description=Este paquete de instalaci\u00f3n es un paquete ensamblado por el usuario de mantenimiento para WebSphere Application Server Network Deployment Versi\u00f3n 7.0. \
Este paquete se puede utilizar para que contenga arreglos temporales seleccionados por el usuario para el producto que se ha descargado desde el sitio web de soporte de IBM. \
Este paquete tambi\u00e9n se puede utilizar para instalar o desinstalar mantenimiento seleccionado de hosts de destino con el gestor de instalaci\u00f3n centralizada y WebSphere Update Installer. \
Este paquete de instalaci\u00f3n depende del paquete de instalaci\u00f3n WebSphere Update Installer. \
Por ello, hay que descargar los binarios para Update Installer antes de instalar cualquiera de los arreglos de este paquete.

nd.70.fixpack.description=Este paquete de instalaci\u00f3n se puede utilizar para contener los archivos necesarios para actualizar las instalaciones de WebSphere Application Server Network Deployment Versi\u00f3n 7.0 al nivel del fixpack especificado. \
Despu\u00e9s de descargar los archivos para las plataformas que se precisen, un administrador puede utilizar el paquete para instalarlo en los hosts que corresponda mediante el gestor de instalaci\u00f3n centralizada y WebSphere Update Installer. \
Este paquete de instalaci\u00f3n depende del paquete de WebSphere Update Installer. \
Por ello, hay que descargar los binarios para Update Installer antes de utilizar este paquete de instalaci\u00f3n para actualizar hosts de destino.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=La ubicaci\u00f3n por omisi\u00f3n del perfil para WebSphere Application Server for i5/OS contiene los archivos configurables para el perfil. \
En muchos ejemplos del Information Center se hace referencia a este directorio como ra\u00edz_datos_usuario. \
La ubicaci\u00f3n por omisi\u00f3n del perfil es el directorio en el cual se crean el directorio de perfiles y el registro de perfiles. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=Se crear\u00e1 un nodo gestionado de WebSphere Application Server con un nombre de nodo y un nombre de perfil por omisi\u00f3n de \"Custom01\" en cada uno de los destinos remotos y se federar\u00e1 en la c\u00e9lula del gestor de despliegue actual. \
Despu\u00e9s de que la operaci\u00f3n se complete satisfactoriamente, utilice el gestor de despliegue para crear un servidor o un cl\u00faster de servidores dentro del nodo. 

was.install.summary.400=Contenedor de posici\u00f3n temporal Mensaje de resumen para las instalaciones en i5/OS.


was.installWithRespFile.summary.all=Si el destino de instalaci\u00f3n es una instalaci\u00f3n existente, el gestor de instalaci\u00f3n centralizada intentar\u00e1 detener todos los servidores en ejecuci\u00f3n en el host de destino antes de iniciar la operaci\u00f3n de instalaci\u00f3n. \
Se permitir\u00e1 que contin\u00fae la operaci\u00f3n aun cuando no se hayan podido detener algunos servidores en ejecuci\u00f3n. \
No obstante, quiz\u00e1 la instalaci\u00f3n subsiguiente sea an\u00f3mala. \
Si no desea que el gestor de instalaci\u00f3n centralizada detenga en este momento los servidores en ejecuci\u00f3n, debe cancelar esta operaci\u00f3n.    


was.uninstall.summary.all=El gestor de instalaci\u00f3n centralizada intentar\u00e1 detener todos los servidores en ejecuci\u00f3n en el host de destino antes de iniciar la operaci\u00f3n de desinstaci\u00f3n. \
Se permitir\u00e1 que contin\u00fae la operaci\u00f3n aun cuando no se hayan podido detener algunos servidores en ejecuci\u00f3n. \
No obstante, quiz\u00e1 la desinstalaci\u00f3n subsiguiente sea an\u00f3mala. \
Si no desea que el gestor de instalaci\u00f3n centralizada detenga en este momento los servidores en ejecuci\u00f3n, debe cancelar esta operaci\u00f3n.    


was.maintenance.update.warning.all=Antes de ejecutar la herramienta WebSphere Update Installer para instalar o desinstalar mantenimiento en destinos seleccionados, el gestor de instalaci\u00f3n centralizado invoca los agentes de nodo en los host de destino para detener todos los procesos de servidor en ejecuci\u00f3n en los destinos. \
Si los agentes de nodo no est\u00e1n en ejecuci\u00f3n en el host de destino, antes de continuar, debe asegurarse de que todos los procesos de servidor en los destinos seleccionados se detienen. \
Una vez terminada correctamente la actualizaci\u00f3n de mantenimiento en el destino seleccionado, el gestor centralizado de instalaci\u00f3n reiniciar\u00e1 autom\u00e1ticamente el agente de nodo en el host de destino.


