# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=O WebSphere Application Server Network Deployment oferece desempenho avan\u00e7ado, gerenciamento e alta disponibilidade. \
Ele combina a disponibilidade praticamente cont\u00ednua com a otimiza\u00e7\u00e3o do desempenho automatizado e com gerenciamento e  monitoramento centralizados, para aplicativos cr\u00edticos de neg\u00f3cios.   

nd.70.description=O WebSphere Application Server Network Deployment oferece desempenho avan\u00e7ado, gerenciamento e alta disponibilidade. \
Ele combina a disponibilidade praticamente cont\u00ednua com a otimiza\u00e7\u00e3o do desempenho automatizado e com gerenciamento e  monitoramento centralizados, para aplicativos cr\u00edticos de neg\u00f3cios.   
nd.70.feature.longname.samplesSelected=Amostras do Application Server
nd.70.feature.description.samplesSelected=Selecione o recurso de Amostras para instalar aplicativos de amostra.
nd.70.feature.longname.languagepack.console.all=Pacote de idiomas para o console administrativo
nd.70.feature.description.languagepack.console.all=Selecione esse recurso para instalar os idiomas diferentes do ingl\u00eas para o console administrativo.
nd.70.feature.longname.languagepack.server.all=Pacote de idiomas para o tempo de execu\u00e7\u00e3o do servidor
nd.70.feature.description.languagepack.server.all=Selecione esse recurso para instalar os idiomas diferentes do ingl\u00eas para o tempo de execu\u00e7\u00e3o do servidor.


updi.70.description=O Update Installer instala atualiza\u00e7\u00f5es, como corre\u00e7\u00f5es tempor\u00e1rias, fix packs e pacotes de atualiza\u00e7\u00f5es, para software IBM WebSphere. \
Este Instalador de Atualiza\u00e7\u00e3o destina-se aos releases do WebSphere Application Server V7.

nd.70.maintenance.description=Esse pacote de instala\u00e7\u00e3o \u00e9 um pacote de manuten\u00e7\u00e3o montado pelo usu\u00e1rio para o WebSphere Application Server Network Deployment Vers\u00e3o 7.0. \
Esse pacote pode ser utilizado para conter corre\u00e7\u00f5es tempor\u00e1rias selecionadas pelo usu\u00e1rio para o produto em quest\u00e3o transferido por download do Web site de suporte da IBM. \
Esse pacote tamb\u00e9m pode ser utilizado para instalar ou desinstalar manuten\u00e7\u00e3o selecionada de hosts de destino, utilizando o gerenciador de instala\u00e7\u00e3o centralizado e o WebSphere Update Installer. \
Esse pacote de instala\u00e7\u00e3o depende do pacote de instala\u00e7\u00e3o do WebSphere Update Installer. \
Dessa forma, os bin\u00e1rios do Update Installer devem ser transferidos por download antes da instala\u00e7\u00e3o das corre\u00e7\u00f5es desse pacote.

nd.70.fixpack.description=Esse pacote de instala\u00e7\u00e3o pode ser utilizado para conter os arquivos necess\u00e1rios para atualizar as instala\u00e7\u00f5es do WebSphere Application Server Network Deployment Vers\u00e3o 7.0 para o n\u00edvel do fix pack especificado. \
Ap\u00f3s os arquivos para as plataformas requeridas serem transferidos por download, um administrador pode utilizar o pacote para instala\u00e7\u00e3o em hosts aplic\u00e1veis, utilizando o gerenciador de instala\u00e7\u00e3o centralizado e o WebSphere Update Installer. \
Esse pacote de instala\u00e7\u00e3o depende do pacote do WebSphere Update Installer. \
Dessa forma, os bin\u00e1rios do Update Installer devem ser transferidos por download antes de utilizar esse pacote de instala\u00e7\u00e3o para atualizar hosts de destino.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=O local de perfil padr\u00e3o para o WebSphere Application Server para i5/OS cont\u00e9m os arquivos configur\u00e1veis para o perfil. \
Esse diret\u00f3rio \u00e9 referido em muitos exemplos do Centro de Informa\u00e7\u00f5es como o user_data_root. \
O local de perfil padr\u00e3o \u00e9 o diret\u00f3rio sob o qual o registro de perfil e o diret\u00f3rio de perfis s\u00e3o criados. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=Um n\u00f3 do WebSphere Application Server gerenciado com o nome de n\u00f3 padr\u00e3o e um nome de perfil do \"Custom01\" ser\u00e3o criados em cada um dos destinos remotos e associados \u00e0 c\u00e9lula do gerenciador de implementa\u00e7\u00e3o. \
Ap\u00f3s a opera\u00e7\u00e3o ser conclu\u00edda com \u00eaxito, utilize o gerenciador de implementa\u00e7\u00e3o para criar um servidor ou um cluster dos servidores dentro do n\u00f3. 

was.install.summary.400=Mensagem de Resumo do place holder tempor\u00e1ria para instala\u00e7\u00f5es no i5/OS.


was.installWithRespFile.summary.all=Se o destino da instala\u00e7\u00e3o for uma instala\u00e7\u00e3o existente, o gerenciador de instala\u00e7\u00e3o centralizado tentar\u00e1 interromper todos os servidores em execu\u00e7\u00e3o no host de destino antes de iniciar a opera\u00e7\u00e3o de instala\u00e7\u00e3o. \
A opera\u00e7\u00e3o ter\u00e1 permiss\u00e3o para continuar mesmo se alguns servidores em execu\u00e7\u00e3o n\u00e3o puderem ser interrompidos. \
Entretanto, a instala\u00e7\u00e3o subseq\u00fcente poder\u00e1 falhar. \
Se voc\u00ea n\u00e3o desejar que os servidores em execu\u00e7\u00e3o sejam interrompidos pelo gerenciador de instala\u00e7\u00e3o centralizado neste momento, voc\u00ea deve cancelar esta opera\u00e7\u00e3o.    


was.uninstall.summary.all=O gerenciador de instala\u00e7\u00e3o centralizado tentar\u00e1 interromper todos os servidores em execu\u00e7\u00e3o no host de destino antes de iniciar a opera\u00e7\u00e3o de desinstala\u00e7\u00e3o. \
A opera\u00e7\u00e3o ter\u00e1 permiss\u00e3o para continuar mesmo se alguns servidores em execu\u00e7\u00e3o n\u00e3o puderem ser interrompidos. \
Entretanto, a desinstala\u00e7\u00e3o subseq\u00fcente poder\u00e1 falhar. \
Se voc\u00ea n\u00e3o desejar que os servidores em execu\u00e7\u00e3o sejam interrompidos pelo gerenciador de instala\u00e7\u00e3o centralizado neste momento, voc\u00ea deve cancelar esta opera\u00e7\u00e3o.    


was.maintenance.update.warning.all=Antes de executar a ferramenta do \
WebSphere Update Installer para manuten\u00e7\u00e3o de instala\u00e7\u00e3o ou \
desinstala\u00e7\u00e3o em destinos selecionados, o gerenciador de instala\u00e7\u00e3o \
centralizado chama os agentes do n\u00f3 nos hosts do destino para \
interromper todos os processos do servidor em execu\u00e7\u00e3o nos destinos. \
Se os agentes do n\u00f3 n\u00e3o est\u00e3o em execu\u00e7\u00e3o no host de destino, \u00e9 \
necess\u00e1rio certificar-se que todos os processos do servidor nos \
destinos selecionados sejam interrompidos antes de prosseguir. \
Ao completar a atualiza\u00e7\u00e3o de manuten\u00e7\u00e3o com \u00eaxito no destino \
selecionado o gerenciador de instala\u00e7\u00e3o centralizado reiniciar\u00e1 \
automaticamente o agente do n\u00f3 no host de destino.


