# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment \u306f\u3001\u62e1\u5f35\u3055\u308c\u305f\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3001\u7ba1\u7406\u3001\u304a\u3088\u3073\u9ad8\u53ef\u7528\u6027\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002 \
\u30d3\u30b8\u30cd\u30b9\u306b\u4e0d\u53ef\u6b20\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3057\u3066\u3001\u307b\u307c\u9023\u7d9a\u7684\u306a\u53ef\u7528\u6027\u3068\u81ea\u52d5\u5316\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u6700\u9069\u5316\u306a\u3089\u3073\u306b\u96c6\u4e2d\u7ba1\u7406\u304a\u3088\u3073\u30e2\u30cb\u30bf\u30fc\u3068\u3092\u540c\u6642\u306b\u5b9f\u73fe\u3057\u307e\u3059\u3002   

nd.70.description=WebSphere Application Server Network Deployment \u306f\u3001\u62e1\u5f35\u3055\u308c\u305f\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3001\u7ba1\u7406\u3001\u304a\u3088\u3073\u9ad8\u53ef\u7528\u6027\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002 \
\u30d3\u30b8\u30cd\u30b9\u306b\u4e0d\u53ef\u6b20\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3057\u3066\u3001\u307b\u307c\u9023\u7d9a\u7684\u306a\u53ef\u7528\u6027\u3068\u81ea\u52d5\u5316\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u6700\u9069\u5316\u306a\u3089\u3073\u306b\u96c6\u4e2d\u7ba1\u7406\u304a\u3088\u3073\u30e2\u30cb\u30bf\u30fc\u3068\u3092\u540c\u6642\u306b\u5b9f\u73fe\u3057\u307e\u3059\u3002   
nd.70.feature.longname.samplesSelected=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30b5\u30f3\u30d7\u30eb
nd.70.feature.description.samplesSelected=\u30b5\u30f3\u30d7\u30eb\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u306b\u306f\u3001\u30b5\u30f3\u30d7\u30eb\u30fb\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3092\u9078\u629e\u3057\u307e\u3059\u3002
nd.70.feature.longname.languagepack.console.all=\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u306e\u8a00\u8a9e\u30d1\u30c3\u30af
nd.70.feature.description.languagepack.console.all=\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u7528\u306e\u8a00\u8a9e\u3068\u3057\u3066\u82f1\u8a9e\u4ee5\u5916\u306e\u8a00\u8a9e\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3092\u9078\u629e\u3057\u307e\u3059\u3002
nd.70.feature.longname.languagepack.server.all=\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30f3\u30bf\u30a4\u30e0\u306e\u8a00\u8a9e\u30d1\u30c3\u30af
nd.70.feature.description.languagepack.server.all=\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30f3\u30bf\u30a4\u30e0\u7528\u306e\u8a00\u8a9e\u3068\u3057\u3066\u82f1\u8a9e\u4ee5\u5916\u306e\u8a00\u8a9e\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3092\u9078\u629e\u3057\u307e\u3059\u3002


updi.70.description=Update Installer \u306f\u3001IBM WebSphere \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306b\u5bfe\u3059\u308b\u66f4\u65b0 (\u66ab\u5b9a\u4fee\u6b63\u3001\u30d5\u30a3\u30c3\u30af\u30b9\u30d1\u30c3\u30af\u3001\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30fb\u30d1\u30c3\u30af\u306a\u3069) \u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u3002 \
\u3053\u306e Update Installer \u306f\u3001WebSphere Application Server V7 \u30ea\u30ea\u30fc\u30b9\u7528\u3067\u3059\u3002

nd.70.maintenance.description=\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 7.0 \u306b\u5bfe\u3059\u308b\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u53ce\u96c6\u3055\u308c\u308b\u4fdd\u5b88\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u3059\u3002 \
\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001IBM Support Web \u30b5\u30a4\u30c8\u304b\u3089\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u305f\u3001\u5f53\u8a72\u88fd\u54c1\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u9078\u629e\u3057\u305f\u66ab\u5b9a\u4fee\u6b63\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304a\u3088\u3073 WebSphere Update Installer \u3092\u4f7f\u7528\u3057\u3066\u3001\u9078\u629e\u3055\u308c\u305f\u4fdd\u5b88\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u307e\u305f\u306f\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u305f\u3081\u306b\u3082\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Update Installer \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u304b\u3089\u4fee\u6b63\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u3001Update Installer \u306e\u30d0\u30a4\u30ca\u30ea\u30fc\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002

nd.70.fixpack.description=\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 7.0 \u3092\u6307\u5b9a\u3055\u308c\u305f\u30d5\u30a3\u30c3\u30af\u30b9\u30d1\u30c3\u30af\u30fb\u30ec\u30d9\u30eb\u306b\u66f4\u65b0\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u5fc5\u8981\u306a\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u7528\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u305f\u5f8c\u3001\u7ba1\u7406\u8005\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304a\u3088\u3073 WebSphere Update Installer \u3092\u4f7f\u7528\u3057\u3066\u9069\u5207\u306a\u30db\u30b9\u30c8\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u969b\u306b\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \
\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Update Installer \u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u306e\u66f4\u65b0\u306e\u305f\u3081\u306b\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u4f7f\u7528\u3059\u308b\u524d\u306b\u3001Update Installer \u306e\u30d0\u30a4\u30ca\u30ea\u30fc\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=WebSphere Application Server for i5/OS \u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u69cb\u6210\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002 \
\u3053\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306f\u3001\u591a\u304f\u306e\u30a4\u30f3\u30d5\u30a9\u30e1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bb\u30f3\u30bf\u30fc\u4f8b\u3067 user_data_root \u3068\u3057\u3066\u53c2\u7167\u3055\u308c\u307e\u3059\u3002 \
\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u3068\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304c\u4f5c\u6210\u3055\u308c\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3067\u3059\u3002 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ce\u30fc\u30c9\u540d\u3068 \"Custom01\" \u3068\u3044\u3046\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u6301\u3064\u7ba1\u7406\u5bfe\u8c61\u306e WebSphere Application Server \u30ce\u30fc\u30c9\u304c\u5404\u30ea\u30e2\u30fc\u30c8\u30fb\u30bf\u30fc\u30b2\u30c3\u30c8\u306b\u4f5c\u6210\u3055\u308c\u3001\u73fe\u5728\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30bb\u30eb\u306b\u7d71\u5408\u3055\u308c\u307e\u3059\u3002 \
\u64cd\u4f5c\u306e\u6b63\u5e38\u5b8c\u4e86\u5f8c\u306b\u3001\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3001\u30ce\u30fc\u30c9\u5185\u306b\u30b5\u30fc\u30d0\u30fc\u307e\u305f\u306f\u30b5\u30fc\u30d0\u30fc\u306e\u30af\u30e9\u30b9\u30bf\u30fc\u3092\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002 

was.install.summary.400=i5/OS \u3078\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306b\u5bfe\u3059\u308b\u4e00\u6642\u30d7\u30ec\u30fc\u30b9\u30db\u30eb\u30c0\u30fc\u8981\u7d04\u30e1\u30c3\u30bb\u30fc\u30b8\u3002


was.installWithRespFile.summary.all=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30bf\u30fc\u30b2\u30c3\u30c8\u304c\u65e2\u5b58\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306e\u5834\u5408\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u64cd\u4f5c\u3092\u958b\u59cb\u3059\u308b\u524d\u306b\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u4e0a\u3067\u7a3c\u50cd\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3057\u3088\u3046\u3068\u3057\u307e\u3059\u3002 \
\u3053\u306e\u64cd\u4f5c\u306f\u3001\u7a3c\u50cd\u4e2d\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u3044\u304f\u3064\u304b\u505c\u6b62\u3067\u304d\u306a\u3044\u5834\u5408\u3067\u3042\u3063\u3066\u3082\u7d9a\u884c\u3067\u304d\u307e\u3059\u3002 \
\u305f\u3060\u3057\u3001\u5f8c\u7d9a\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306b\u5931\u6557\u3059\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \
\u3053\u306e\u6642\u70b9\u3067\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u3088\u3063\u3066\u7a3c\u50cd\u4e2d\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3055\u305b\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u64cd\u4f5c\u3092\u53d6\u308a\u6d88\u305b\u307e\u3059\u3002    


was.uninstall.summary.all=\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u3001\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u64cd\u4f5c\u3092\u958b\u59cb\u3059\u308b\u524d\u306b\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u4e0a\u3067\u7a3c\u50cd\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3057\u3088\u3046\u3068\u3057\u307e\u3059\u3002 \
\u3053\u306e\u64cd\u4f5c\u306f\u3001\u7a3c\u50cd\u4e2d\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u3044\u304f\u3064\u304b\u505c\u6b62\u3067\u304d\u306a\u3044\u5834\u5408\u3067\u3042\u3063\u3066\u3082\u7d9a\u884c\u3067\u304d\u307e\u3059\u3002 \
\u305f\u3060\u3057\u3001\u5f8c\u7d9a\u306e\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306b\u5931\u6557\u3059\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \
\u3053\u306e\u6642\u70b9\u3067\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u3088\u3063\u3066\u7a3c\u50cd\u4e2d\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3055\u305b\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u64cd\u4f5c\u3092\u53d6\u308a\u6d88\u305b\u307e\u3059\u3002    


was.maintenance.update.warning.all=WebSphere Update Installer \u30c4\u30fc\u30eb\u3092\u5b9f\u884c\u3057\u3066\u9078\u629e\u3057\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u3067\u4fdd\u5b88\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u307e\u305f\u306f\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u4e0a\u306e\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306b\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u3067\u5b9f\u884c\u4e2d\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u3092\u3059\u3079\u3066\u505c\u6b62\u3059\u308b\u3088\u3046\u8981\u6c42\u3057\u307e\u3059\u3002 \
\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u3067\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u9078\u629e\u3057\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u306e\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u304c\u505c\u6b62\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u3001\u4f5c\u696d\u3092\u7d9a\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \
\u9078\u629e\u3057\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u3067\u4fdd\u5b88\u66f4\u65b0\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3059\u308b\u3068\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u81ea\u52d5\u7684\u306b\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u4e0a\u306e\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u3092\u518d\u59cb\u52d5\u3057\u307e\u3059\u3002


