# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment\ub294 \uace0\uae09 \uc131\ub2a5, \uad00\ub9ac \ubc0f \uace0\uac00\uc6a9\uc131\uc744 \uc81c\uacf5\ud569\ub2c8\ub2e4. \
\ube44\uc988\ub2c8\uc2a4\uc5d0 \uc911\uc694\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc704\ud574 \uac70\uc758 \uc5f0\uc18d\uc801\uc778 \uac00\uc6a9\uc131\uc744 \uc790\ub3d9\ud654\ub41c \uc131\ub2a5 \ucd5c\uc801\ud654\uc640 \uc911\uc559 \uc9d1\uc911\uc2dd \uad00\ub9ac \ubc0f \ubaa8\ub2c8\ud130\ub9c1\uacfc \uacb0\ud569\ud569\ub2c8\ub2e4.  

nd.70.description=WebSphere Application Server Network Deployment\ub294 \uace0\uae09 \uc131\ub2a5, \uad00\ub9ac \ubc0f \uace0\uac00\uc6a9\uc131\uc744 \uc81c\uacf5\ud569\ub2c8\ub2e4. \
\ube44\uc988\ub2c8\uc2a4\uc5d0 \uc911\uc694\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc704\ud574 \uac70\uc758 \uc5f0\uc18d\uc801\uc778 \uac00\uc6a9\uc131\uc744 \uc790\ub3d9\ud654\ub41c \uc131\ub2a5 \ucd5c\uc801\ud654\uc640 \uc911\uc559 \uc9d1\uc911\uc2dd \uad00\ub9ac \ubc0f \ubaa8\ub2c8\ud130\ub9c1\uacfc \uacb0\ud569\ud569\ub2c8\ub2e4.  
nd.70.feature.longname.samplesSelected=\uc560\ud50c\ub9ac\ucf00\uc774\uc158 \uc11c\ubc84 \uc0d8\ud50c
nd.70.feature.description.samplesSelected=\uc0d8\ud50c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc124\uce58\ud558\ub3c4\ub85d \uc0d8\ud50c \uae30\ub2a5\uc744 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
nd.70.feature.longname.languagepack.console.all=\uad00\ub9ac \ucf58\uc194\uc6a9 \uc5b8\uc5b4 \ud329
nd.70.feature.description.languagepack.console.all=\uc774 \uae30\ub2a5\uc744 \uc120\ud0dd\ud558\uc5ec \uad00\ub9ac \ucf58\uc194\uc6a9\uc73c\ub85c \uc601\uc5b4\uac00 \uc544\ub2cc \uc5b8\uc5b4\ub97c \uc124\uce58\ud558\uc2ed\uc2dc\uc624.
nd.70.feature.longname.languagepack.server.all=\uc11c\ubc84 \ub7f0\ud0c0\uc784\uc6a9 \uc5b8\uc5b4 \ud329
nd.70.feature.description.languagepack.server.all=\uc774 \uae30\ub2a5\uc744 \uc120\ud0dd\ud558\uc5ec \uc11c\ubc84 \ub7f0\ud0c0\uc784\uc6a9\uc73c\ub85c \uc601\uc5b4\uac00 \uc544\ub2cc \uc5b8\uc5b4\ub97c \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.


updi.70.description=\uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8\uc740 IBM WebSphere \uc18c\ud504\ud2b8\uc6e8\uc5b4\uc5d0 \ub300\ud55c \uc784\uc2dc \ud53d\uc2a4, \ud53d\uc2a4\ud329 \ubc0f \uc5c5\ub370\uc774\ud2b8 \ud329\uacfc \uac19\uc740 \uc5c5\ub370\uc774\ud2b8\uc0ac\ud56d\uc744 \uc124\uce58\ud569\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8\uc740 WebSphere Application Server V7 \ub9b4\ub9ac\uc2a4\uc6a9\uc785\ub2c8\ub2e4.

nd.70.maintenance.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Application Server Network Deployment \ubc84\uc804 7.0\uc758 \uc0ac\uc6a9\uc790\uac00 \uc218\uc9d1\ud55c \uc720\uc9c0\ubcf4\uc218 \ud328\ud0a4\uc9c0\uc785\ub2c8\ub2e4. \
\uc774 \ud328\ud0a4\uc9c0\ub294 IBM \uc9c0\uc6d0 \uc13c\ud130 \uc6f9 \uc0ac\uc774\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\uc790\uac00 \uc120\ud0dd\ud558\uc5ec \ub2e4\uc6b4\ub85c\ub4dc\ud55c \ud2b9\uc815 \uc81c\ud488\uc758 \uc784\uc2dc \ud53d\uc2a4\ub97c \ud3ec\ud568\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ub610\ud55c \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8\uc744 \uc0ac\uc6a9\ud558\uc5ec \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc120\ud0dd\ud55c \uc720\uc9c0\ubcf4\uc218\ub97c \uc124\uce58\ud558\uac70\ub098 \uc124\uce58 \uc81c\uac70\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8 \uc124\uce58 \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \uc774 \ud328\ud0a4\uc9c0\uc5d0\uc11c \uc218\uc815\uc0ac\ud56d\uc744 \uc124\uce58\ud558\uae30 \uc804\uc5d0 \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

nd.70.fixpack.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Application Server Network Deployment \ubc84\uc804 7.0\uc744 \uc9c0\uc815\ub41c \ud53d\uc2a4\ud329 \ub808\ubca8\ub85c \uc5c5\ub370\uc774\ud2b8\ud558\ub294 \ub370 \ud544\uc694\ud55c \ud30c\uc77c\uc744 \ud3ec\ud568\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \
\ud544\uc694\ud55c \ud50c\ub7ab\ud3fc \ud30c\uc77c\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud558\uba74, \uad00\ub9ac\uc790\uac00 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8\uc744 \uc0ac\uc6a9\ud558\uc5ec \ud574\ub2f9 \ud638\uc2a4\ud2b8\uc5d0 \uc124\uce58\ud560 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\uac8c \ub429\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8 \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \ub300\uc0c1 \ud638\uc2a4\ud2b8 \uc5c5\ub370\uc774\ud2b8\ub97c \uc704\ud574 \uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud558\uae30 \uc804\uc5d0 \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=i5/OS\uc6a9 WebSphere Application Server\uc758 \uae30\ubcf8 \ud504\ub85c\ud30c\uc77c \uc704\uce58\ub294 \ud504\ub85c\ud30c\uc77c\uc758 \uad6c\uc131 \uac00\ub2a5 \ud30c\uc77c\uc744 \ud3ec\ud568\ud569\ub2c8\ub2e4. \
\uc5ec\ub7ec Information Center \uc608\uc81c\uc5d0\uc11c \uc774 \ub514\ub809\ud1a0\ub9ac\ub294 user_data_root\ub77c\uace0 \ud569\ub2c8\ub2e4. \
\uae30\ubcf8 \ud504\ub85c\ud30c\uc77c \uc704\uce58\ub294 \ud504\ub85c\ud30c\uc77c \ub808\uc9c0\uc2a4\ud2b8\ub9ac \ubc0f \ud504\ub85c\ud30c\uc77c \ub514\ub809\ud1a0\ub9ac\uac00 \uc791\uc131\ub418\ub294 \ub514\ub809\ud1a0\ub9ac\uc785\ub2c8\ub2e4. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=\uae30\ubcf8 \ub178\ub4dc \uc774\ub984\uacfc \"Custom01\"\uc774\ub77c\ub294 \ud504\ub85c\ud30c\uc77c \uc774\ub984\uc758 \uad00\ub9ac\ub41c WebSphere Application Server \ub178\ub4dc\uac00 \uac01 \uc6d0\uaca9 \ub300\uc0c1\uc5d0 \uc791\uc131\ub418\uc5b4 \ud604\uc7ac \ubc30\uce58 \uad00\ub9ac\uc790 \uc140\ub85c \uc5f0\ud569\ub429\ub2c8\ub2e4. \
\uc791\uc5c5\uc774 \uc131\uacf5\uc801\uc73c\ub85c \uc644\ub8cc\ub418\uba74 \ubc30\uce58 \uad00\ub9ac\uc790\ub97c \uc0ac\uc6a9\ud558\uc5ec \ub178\ub4dc\uc5d0 \uc11c\ubc84\uc758 \ud074\ub7ec\uc2a4\ud130\ub098 \uc11c\ubc84\ub97c\
\uc791\uc131\ud558\uc2ed\uc2dc\uc624. 

was.install.summary.400=i5/OS\uc5d0 \uc124\uce58\ub97c \uc704\ud55c \uc784\uc2dc \uc704\uce58 \ud45c\uc2dc\uae30 \uc694\uc57d \uba54\uc2dc\uc9c0.


was.installWithRespFile.summary.all=\uc124\uce58 \ub300\uc0c1\uc774 \uae30\uc874 \uc124\uce58\uc778 \uacbd\uc6b0, \uc124\uce58 \uc870\uc791\uc744 \uc2dc\uc791\ud558\uae30 \uc804\uc5d0 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uac00 \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \uc11c\ubc84\ub97c \ubaa8\ub450 \uc911\uc9c0\ud558\uac8c \ub429\ub2c8\ub2e4. \
\uc2e4\ud589 \uc911\uc778 \uc11c\ubc84 \uc911 \uc77c\ubd80\ub97c \uc911\uc9c0\ud560 \uc218 \uc5c6\ub294 \uacbd\uc6b0\ub77c\ub3c4 \uc870\uc791\uc740 \uacc4\uc18d \uc9c4\ud589\ub429\ub2c8\ub2e4. \
\uadf8\ub7ec\ub098 \ud6c4\uc18d \uc124\uce58\uac00 \uc2e4\ud328\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \
\uc774\ub54c \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \uc11c\ubc84\ub97c \uc911\uc9c0\ud558\uc9c0 \uc54a\ub3c4\ub85d \ud558\ub824\uba74 \uc774 \uc870\uc791\uc744 \ucde8\uc18c\ud574\uc57c \ud569\ub2c8\ub2e4.   


was.uninstall.summary.all=\uc124\uce58 \uc81c\uac70 \uc870\uc791\uc744 \uc2dc\uc791\ud558\uae30 \uc804\uc5d0 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uac00 \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \uc11c\ubc84\ub97c \ubaa8\ub450 \uc911\uc9c0\ud558\uac8c \ub429\ub2c8\ub2e4. \
\uc2e4\ud589 \uc911\uc778 \uc11c\ubc84 \uc911 \uc77c\ubd80\ub97c \uc911\uc9c0\ud560 \uc218 \uc5c6\ub294 \uacbd\uc6b0\ub77c\ub3c4 \uc870\uc791\uc740 \uacc4\uc18d \uc9c4\ud589\ub429\ub2c8\ub2e4. \
\uadf8\ub7ec\ub098 \ud6c4\uc18d \uc124\uce58 \uc81c\uac70\uac00 \uc2e4\ud328\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \
\uc774\ub54c \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \uc11c\ubc84\ub97c \uc911\uc9c0\ud558\uc9c0 \uc54a\ub3c4\ub85d \ud558\ub824\uba74 \uc774 \uc870\uc791\uc744 \ucde8\uc18c\ud574\uc57c \ud569\ub2c8\ub2e4.   


was.maintenance.update.warning.all=WebSphere \uc124\uce58 \uc5c5\ub370\uc774\ud2b8 \ud504\ub85c\uadf8\ub7a8 \ub3c4\uad6c\ub97c \uc2e4\ud589\ud558\uc5ec \uc120\ud0dd\ub41c \ub300\uc0c1\uc5d0 \uc720\uc9c0\ubcf4\uc218\ub97c \uc124\uce58 \ub610\ub294 \uc124\uce58 \uc81c\uac70\ud558\uae30 \uc804\uc5d0, \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uac00 \ub300\uc0c1\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \ubaa8\ub4e0 \uc11c\ubc84 \ud504\ub85c\uc138\uc2a4\ub97c \uc911\uc9c0\ud558\ub3c4\ub85d \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc758 \ub178\ub4dc \uc5d0\uc774\uc804\ud2b8\uc5d0 \uc9c0\uc2dc\ud569\ub2c8\ub2e4.\
\ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \ub178\ub4dc \uc5d0\uc774\uc804\ud2b8\uac00 \uc2e4\ud589 \uc911\uc774 \uc544\ub2cc \uacbd\uc6b0, \uacc4\uc18d\ud558\uae30 \uc804\uc5d0 \uc120\ud0dd\ub41c \ub300\uc0c1\uc758 \ubaa8\ub4e0 \uc11c\ubc84 \ud504\ub85c\uc138\uc2a4\uac00 \uc911\uc9c0\ub418\uc5c8\ub294\uc9c0 \ud655\uc778\ud574\uc57c \ud569\ub2c8\ub2e4. \
\uc120\ud0dd\ub41c \ub300\uc0c1\uc5d0\uc11c \uc720\uc9c0\ubcf4\uc218 \uc5c5\ub370\uc774\ud2b8\uac00 \uc815\uc0c1\uc801\uc73c\ub85c \uc644\ub8cc\ub418\uba74 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\ub294 \uc790\ub3d9\uc73c\ub85c \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \ub178\ub4dc \uc5d0\uc774\uc804\ud2b8\ub97c \ub2e4\uc2dc \uc2dc\uc791\ud569\ub2c8\ub2e4.


