# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=Produkt WebSphere Application Server Network Deployment oferuje zaawansowan\u0105 wydajno\u015b\u0107, funkcje zarz\u0105dzania i wysok\u0105 dost\u0119pno\u015b\u0107. \
Produkt ten \u0142\u0105czy prawie ci\u0105g\u0142\u0105 dost\u0119pno\u015b\u0107 z automatyczn\u0105 optymalizacj\u0105 wydajno\u015bci oraz scentralizowanym zarz\u0105dzaniem i monitorowaniem na potrzeby aplikacji o krytycznym znaczeniu dla firmy.   

nd.70.description=Produkt WebSphere Application Server Network Deployment oferuje zaawansowan\u0105 wydajno\u015b\u0107, funkcje zarz\u0105dzania i wysok\u0105 dost\u0119pno\u015b\u0107. \
Produkt ten \u0142\u0105czy prawie ci\u0105g\u0142\u0105 dost\u0119pno\u015b\u0107 z automatyczn\u0105 optymalizacj\u0105 wydajno\u015bci oraz scentralizowanym zarz\u0105dzaniem i monitorowaniem na potrzeby aplikacji o krytycznym znaczeniu dla firmy.   
nd.70.feature.longname.samplesSelected=Przyk\u0142ady produktu Application Server
nd.70.feature.description.samplesSelected=Wybierz sk\u0142adnik Przyk\u0142ady, aby zainstalowa\u0107 aplikacje przyk\u0142adowe.
nd.70.feature.longname.languagepack.console.all=Pakiet j\u0119zykowy dla Konsoli administracyjnej
nd.70.feature.description.languagepack.console.all=Wybierz ten sk\u0142adnik, aby zainstalowa\u0107 dla Konsoli administracyjnej j\u0119zyki inne ni\u017c angielski.
nd.70.feature.longname.languagepack.server.all=Pakiet j\u0119zykowy dla \u015brodowiska wykonawczego serwera
nd.70.feature.description.languagepack.server.all=Wybierz ten sk\u0142adnik, aby zainstalowa\u0107 dla \u015brodowiska wykonawczego serwera j\u0119zyki inne ni\u017c angielski.


updi.70.description=Narz\u0119dzie Update Installer instaluje aktualizacje, takie jak poprawki tymczasowe, pakiety poprawek i pakiety aktualizacyjne, dla oprogramowania IBM WebSphere. \
To narz\u0119dzie Update Installer jest przeznaczone dla produktu WebSphere Application Server 7.

nd.70.maintenance.description=Ten pakiet instalacji to stworzony przez u\u017cytkownika pakiet serwisowy dla produktu WebSphere Application Server Network Deployment 7.0. \
W tym pakiecie mo\u017cna umie\u015bci\u0107 wybrane przez u\u017cytkownika poprawki tymczasowe dla wspomnianego produktu, kt\u00f3re zosta\u0142y pobrane z serwisu WWW wsparcia IBM. \
Za pomoc\u0105 tego pakietu mo\u017cna tak\u017ce instalowa\u0107 i deinstalowa\u0107 wybrane poprawki serwisowe na hostach docelowych przy u\u017cyciu scentralizowanego mened\u017cera instalacji i narz\u0119dzia WebSphere Update Installer. \
Ten pakiet instalacji jest zale\u017cny od pakietu instalacji WebSphere Update Installer. \
Oznacza to, \u017ce pliki binarne dla narz\u0119dzia Update Installer musz\u0105 zosta\u0107 pobrane przed zainstalowaniem jakichkolwiek poprawek z tego pakietu.

nd.70.fixpack.description=W tym pakiecie instalacji mo\u017cna umie\u015bci\u0107 pliki wymagane do aktualizacji instalacji produktu WebSphere Application Server Network Deployment 7.0 do okre\u015blonego poziomu pakietu poprawek. \
Po pobraniu plik\u00f3w dla wymaganych platform administrator mo\u017ce u\u017cy\u0107 pakietu do instalacji na odpowiednich hostach przy u\u017cyciu scentralizowanego mened\u017cera instalacji i narz\u0119dzia WebSphere Update Installer. \
Ten pakiet instalacji jest zale\u017cny od pakietu WebSphere Update Installer. \
Oznacza to, \u017ce pliki binarne dla narz\u0119dzia Update Installer musz\u0105 zosta\u0107 pobrane przed u\u017cyciem tego pakietu instalacji do aktualizacji host\u00f3w docelowych.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=W domy\u015blnym po\u0142o\u017ceniu profilu produktu WebSphere Application Server dla systemu i5/OS znajduj\u0105 si\u0119 konfigurowalne pliki dla profilu. \
W wielu przyk\u0142adach znajduj\u0105cych si\u0119 w Centrum informacyjnym ten katalog jest okre\u015blany jako katalog_g\u0142\u00f3wny_danych_u\u017cytkownika. \
Domy\u015blne po\u0142o\u017cenie profilu to katalog, w kt\u00f3rym tworzony jest rejestr profilu i katalog profili. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=W\u0119ze\u0142 zarz\u0105dzany produktu WebSphere Application Server z domy\u015bln\u0105 nazw\u0105 w\u0119z\u0142a i nazw\u0105 profilu \"Niestandardowy01\" zostanie utworzony w ka\u017cdym zdalnym elemencie docelowym i stowarzyszony z bie\u017c\u0105c\u0105 kom\u00f3rk\u0105 mened\u017cera wdra\u017cania. \
Po pomy\u015blnym zako\u0144czeniu tej operacji u\u017cyj mened\u017cera wdra\u017cania do utworzenia serwera lub klastra serwer\u00f3w w obr\u0119bie w\u0119z\u0142a. 

was.install.summary.400=Tymczasowy zast\u0119pczy komunikat podsumowania dla instalacji w systemie i5/OS.


was.installWithRespFile.summary.all=Elementem docelowym jest istniej\u0105ca instalacja - przed rozpocz\u0119ciem instalacji scentralizowany mened\u017cer instalacji podejmie pr\u00f3b\u0119 zatrzymania wszystkich dzia\u0142aj\u0105cych serwer\u00f3w na ho\u015bcie docelowym. \
Operacja b\u0119dzie kontynuowana, nawet je\u015bli cz\u0119\u015b\u0107 dzia\u0142aj\u0105cych serwer\u00f3w nie zostanie zatrzymana. \
Jednak instalacja mo\u017ce w tym przypadku nie powie\u015b\u0107 si\u0119. \
Aby unikn\u0105\u0107 zatrzymania dzia\u0142aj\u0105cych serwer\u00f3w przez scentralizowany mened\u017cer instalacji w tej chwili, nale\u017cy anulowa\u0107 t\u0119 operacj\u0119.    


was.uninstall.summary.all=Przed rozpocz\u0119ciem deinstalacji scentralizowany mened\u017cer instalacji podejmie pr\u00f3b\u0119 zatrzymania wszystkich dzia\u0142aj\u0105cych serwer\u00f3w na ho\u015bcie docelowym. \
Operacja b\u0119dzie kontynuowana, nawet je\u015bli cz\u0119\u015b\u0107 dzia\u0142aj\u0105cych serwer\u00f3w nie zostanie zatrzymana. \
Jednak deinstalacja mo\u017ce w tym przypadku nie powie\u015b\u0107 si\u0119. \
Aby unikn\u0105\u0107 zatrzymania dzia\u0142aj\u0105cych serwer\u00f3w przez scentralizowany mened\u017cer instalacji w tej chwili, nale\u017cy anulowa\u0107 t\u0119 operacj\u0119.    


was.maintenance.update.warning.all=Przed uruchomieniem narz\u0119dzia \
instalatora aktualizacji produktu WebSphere w celu zainstalowania lub \
zdeinstalowania pakietu serwisowego na wybranych serwerach docelowych mened\u017cer scentralizowanej instalacji wywo\u0142uje agenty w\u0119z\u0142\u00f3w na hostach docelowych, aby \
zatrzyma\u0107 wszystkie dzia\u0142aj\u0105ce tam procesy. \
Je\u015bli agenty w\u0119z\u0142\u00f3w nie dzia\u0142aj\u0105 na ho\u015bcie docelowym, przed kontynuowaniem \
nale\u017cy upewni\u0107 si\u0119, \u017ce wszystkie procesy serwera na wybranych serwerach \
docelowych zosta\u0142y zatrzymane. \
Po pomy\u015blnym zako\u0144czeniu aktualizacji pakietu serwisowego na wybranym \
serwerze docelowym mened\u017cer scentralizowanej instalacji automatycznie \
zrestartuje agent w\u0119z\u0142a na ho\u015bcie docelowym.


