# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment ofer\u0103 performan\u0163\u0103, gestiune si disponibilitate superioare. \
Combin\u0103 disponibilitatea aproape continu\u0103 cu optimizarea automat\u0103 a performan\u0163ei \u015fi monitorizarea \u015fi gestionarea centralizat\u0103 pentru aplica\u0163iile critice din punct de vedere business.   

nd.70.description=WebSphere Application Server Network Deployment ofer\u0103 performan\u0163\u0103, gestiune si disponibilitate superioare. \
Combin\u0103 disponibilitatea aproape continu\u0103 cu optimizarea automat\u0103 a performan\u0163ei \u015fi monitorizarea \u015fi gestionarea centralizat\u0103 pentru aplica\u0163iile critice din punct de vedere business.   
nd.70.feature.longname.samplesSelected=Application Server Samples
nd.70.feature.description.samplesSelected=Selecta\u0163i caracteristicile Samples pentru a instalarea aplica\u0163iile e\u015fantion.
nd.70.feature.longname.languagepack.console.all=Pachet lingvistic pentru consola administrativ\u0103
nd.70.feature.description.languagepack.console.all=Selecta\u0163i aceast\u0103 caracteristic\u0103 pentru a instala limbi diferite de familia limbii engleze pentru consola administrativ\u0103.
nd.70.feature.longname.languagepack.server.all=Pachet lingvistic pentru runtime-ul serverului
nd.70.feature.description.languagepack.server.all=Selecta\u0163i aceast\u0103 caracteristic\u0103 pentru a instala limbi diferite de familia limbii engleze pentru runtime-ul serverului.


updi.70.description=Update Installer instaleaz\u0103 actualiz\u0103ri, cum ar fi: corec\u0163ii temporare, pachete de corec\u0163ii \u015fi pachete de actualiz\u0103ri intermediare pentru software-ul IBM WebSphere. \
Acest Update Installer este pentru produsele lansate din familia WebSphere Application Server V7.

nd.70.maintenance.description=Acest pachet de instalare este un pachet asamblat de utilizator pentru \u00eentre\u0163inerea WebSphere Application Server Network Deployment versiunea 7.0. \
Acest pachet poate con\u0163ine corec\u0163ii temporare alese de utilizator pentru produsele men\u0163ionate desc\u0103rcate de pe situl web de suport IBM. \
Acest pachet poate fi folosit \u015fi pentru instalarea sau dezinstalarea pachetele de \u00eentre\u0163inere selectate de pe gazdele \u0163int\u0103 folosind managerul de instalare centralizat\u0103 \u015fi WebSphere Update Installer. \
Acest pachet de instalare este dependent de pachetul de instalare WebSphere Update Installer. \
Ca urmare, binarele pentru Update Installer trebuie desc\u0103rcate \u00eenainte de a instala oricare dintre corec\u0163iile din acest pachet.

nd.70.fixpack.description=Acest pachet de instalare poate fi folosit pentru a include fi\u015fierele necesare pentru a actualiza instal\u0103rile de WebSphere Application Server Network Deployment versiunea 7.0 la nivelul pentru pachetul de corec\u0163ii specificat. \
Dup\u0103 ce fi\u015fierele pentru platformele necesare sunt desc\u0103rcate un administrator poate folosi pachetul pentru instalarea pe gazdele corespunz\u0103toare folosind managerul de instalare centralizat\u0103 \u015fi WebSphere Update Installer. \
Acest pachet de instalare este dependent de pachetul WebSphere Update Installer. \
Ca urmare, binarele pentru Update Installer trebuie desc\u0103rcate \u00eenainte de folosirea acestui pachet de instalare pentru actualizarea gazdelor \u0163int\u0103.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=Loca\u0163ia implicit\u0103 a profilului pentru WebSphere Application Server pentru i5/OS con\u0163ine fi\u015fierele configurabile pentru profil. \
Acest director este referit \u00een multe exemple ale Centrului de Informare ca user_data_root. \
Loca\u0163ia implicit\u0103 a profilului este directorul \u00een care regi\u015ftrii profilului \u015fi directoarele de profile sunt create. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=Un nod gestionat WebSphere Application Server cu un nume de nod implicit \u015fi un nume de profil \"Custom01\" vor fi create pe fiecare dintre \u0163intele la distan\u0163\u0103 \u015fi federalizate \u00een celula curent\u0103 a managerului de implementare. \
Dup\u0103 \u00eencheierea cu succes a opera\u0163iei, folosi\u0163i managerul de implementare pentru a crea un server sau un cluster de servere \u00een cadrul nodului. 

was.install.summary.400=\u00cenlocuitor temporar Summary Message pentru instal\u0103ri pe i5/OS.


was.installWithRespFile.summary.all=Dac\u0103 instalarea \u0163int\u0103 este una deja existent\u0103, managerul de instalare centralizat\u0103 va \u00eencerca s\u0103 opreasc\u0103 toate serverele care ruleaz\u0103 pe gazda \u0163int\u0103 \u00eenainte de \u00eenceperea opera\u0163iei de instalare. \
Opera\u0163ia va continua chiar \u015fi \u00een cazul \u00een care c\u00e2teva dintre serverele care ruleaz\u0103 nu au putut fi oprite. \
Totu\u015fi, este posibil ca instalarea s\u0103 e\u015fueze. \
Dac\u0103 nu dori\u0163i ca managerul de instalare centralizat\u0103 sa opreasc\u0103 la acest moment serverele care ruleaz\u0103, ar fi mai bine s\u0103 anula\u0163i aceast\u0103 opera\u0163ie.    


was.uninstall.summary.all=Managerul de instalare centralizat\u0103 va \u00eencerca s\u0103 opreasc\u0103 toate serverele care ruleaz\u0103 pe gazda \u0163int\u0103 \u00eenainte de \u00eenceperea opera\u0163iei de dezinstalare. \
Opera\u0163ia va continua chiar \u015fi \u00een cazul \u00een care c\u00e2teva dintre serverele care ruleaz\u0103 nu au putut fi oprite. \
Totu\u015fi, este posibil ca dezinstalarea s\u0103 e\u015fueze. \
Dac\u0103 nu dori\u0163i ca managerul de instalare centralizat\u0103 sa opreasc\u0103 la acest moment serverele care ruleaz\u0103, ar fi mai bine s\u0103 anula\u0163i aceast\u0103 opera\u0163ie.    


was.maintenance.update.warning.all=\u00cenainte de a rula unealta WebSphere Update Installer pentru instalarea sau dezinstalarea pachetelor de \u00eentre\u0163inere pe \u0163intele vizate, managerul de instalare centralizat\u0103 apeleaz\u0103 agen\u0163ii de nod ai gazdelor \u0163int\u0103 s\u0103 opreasc\u0103 procesele serverelor active pe \u0163inte. \
Dac\u0103 agen\u0163ii de nod nu ruleaz\u0103 pe gazda \u0163int\u0103 trebuie s\u0103 v\u0103 asigura\u0163i c\u0103 toate procesele serverului de pe \u0163intele selectate sunt oprite \u00eenainte a continua. \
Dup\u0103 finalizarea cu succes a actualiz\u0103rii cu pachetul de \u00eentre\u0163inere pe \u0163inta vizat\u0103, managerul de instalare centralizat\u0103 va reporni automat agentul de nod pe gazda \u0163int\u0103.


