# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/admin.cimgr.ops/properties/messages/CIMInstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
nd.61.description=WebSphere Application Server Network Deployment offre des performances, des fonctions de gestion et une haute disponibilit\u00e9 avanc\u00e9es. \
Il combine la disponibilit\u00e9 quasi continue et l'optimisation des performances, la gestion centralis\u00e9e et la surveillance automatis\u00e9es pour les applications strat\u00e9giques.   

nd.70.description=WebSphere Application Server Network Deployment offre des performances, des fonctions de gestion et une haute disponibilit\u00e9 avanc\u00e9es. \
Il combine la disponibilit\u00e9 quasi continue et l'optimisation des performances, la gestion centralis\u00e9e et la surveillance automatis\u00e9es pour les applications strat\u00e9giques.   
nd.70.feature.longname.samplesSelected=Exemples de serveurs d'applications
nd.70.feature.description.samplesSelected=S\u00e9lectionnez l'option Exemples pour installer les exemples d'applications.
nd.70.feature.longname.languagepack.console.all=Module de langue de la console d'administration
nd.70.feature.description.languagepack.console.all=S\u00e9lectionnez cette option pour installer les langues autres que l'anglais pour la console d'administration.
nd.70.feature.longname.languagepack.server.all=Module de langue de l'ex\u00e9cution du serveur
nd.70.feature.description.languagepack.server.all=S\u00e9lectionnez cette option pour installer les langues autres que l'anglais pour l'ex\u00e9cution du serveur.


updi.70.description=L'utilitaire d'installation des mises \u00e0 jour installe les mises \u00e0 jour, telles que les correctifs temporaires, les groupes de correctifs et les groupes de mises \u00e0 jour pour IBM WebSphere. \
Ce programme d'installation des mises \u00e0 jour s'applique aux \u00e9ditions WebSphere Application Server V7.

nd.70.maintenance.description=Ce package d'installation est un package de maintenance assembl\u00e9 par l'utilisateur pour WebSphere Application Server Network Deployment Version 7.0. \
Il peut \u00eatre utilis\u00e9 pour contenir les correctifs temporaires s\u00e9lectionn\u00e9s par l'utilisateur pour le produit en question et qui sont t\u00e9l\u00e9charg\u00e9s sur le site Web de Support technique IBM. \
Ce package peut \u00e9galement \u00eatre utilis\u00e9 pour installer ou d\u00e9sinstaller la maintenance s\u00e9lectionn\u00e9e \u00e0 partir des h\u00f4tes cible \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e et de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
Ce package d'installation d\u00e9pend du package d'installation de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
A ce titre, les fichiers binaires de l'utilitaire d'installation de mises \u00e0 jour doivent \u00eatre t\u00e9l\u00e9charg\u00e9s avant d'installer l'un des correctifs de ce package.

nd.70.fixpack.description=Ce package d'installation peut \u00eatre utilis\u00e9 pour stocker les fichiers n\u00e9cessaires \u00e0 la mise \u00e0 niveau des installations WebSphere Application Server Network Deployment Version 7.0 vers le niveau de groupe de correctifs sp\u00e9cifi\u00e9. \
Une fois les fichiers destin\u00e9s aux plate-formes requises t\u00e9l\u00e9charg\u00e9s, un administrateur peut utiliser le package pour installer les fichiers sur les h\u00f4tes correspondants \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e et de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
Ce package d'installation d\u00e9pend du package de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
A ce titre, les fichiers binaires de l'utilitaire d'installation de mises \u00e0 jour doivent \u00eatre t\u00e9l\u00e9charg\u00e9s avant d'utiliser ce package d'installation pour la mise \u00e0 jour des h\u00f4tes cible.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for WebSphere App Server.  
#
was.os400.default.profile.location=L'emplacement du profil par d\u00e9faut de WebSphere Application Server for i5/OS contient les fichiers configurables du profil. \
Une r\u00e9f\u00e9rence \u00e0 ce r\u00e9pertoire sous la forme user_data_root existe dans de nombreux exemples de centres de documentation. \
L'emplacement par d\u00e9faut du profil correspond au r\u00e9pertoire sous lequel le registre du profil et les r\u00e9pertoires des profils sont cr\u00e9\u00e9s. 

# The following message is purposely left empty.
was.os400.default.profile.location.os400=

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for WAS ND.  
#
was.install.summary.all=Un noeud WebSphere Application Server g\u00e9r\u00e9 avec un nom de noeud par d\u00e9faut et le nom de profil \"Custom01\" sera cr\u00e9\u00e9 sur chacune des cibles distantes et f\u00e9d\u00e9r\u00e9 avec la cellule du gestionnaire de d\u00e9ploiement en cours. \
A la fin de l'op\u00e9ration, utilisez le gestionnaire de d\u00e9ploiement pour un cr\u00e9er un serveur ou un cluster de serveurs dans le noeud. 

was.install.summary.400=Message de r\u00e9sum\u00e9 des param\u00e8tres fictifs temporaires pour les installations sur i5/OS.


was.installWithRespFile.summary.all=Si la cible de l'installation est une installation existante, le gestionnaire d'installation centralis\u00e9e tentera d'arr\u00eater tous les serveurs en cours d'ex\u00e9cution sur l'h\u00f4te cible avant de d\u00e9marrer l'installation. \
Celle-ci sera autoris\u00e9e \u00e0 se poursuivre m\u00eame si certains serveurs n'ont pu \u00eatre arr\u00eat\u00e9s. \
Mais l'installation suivante risque d'\u00e9chouer. \
Si vous ne voulez pas que les serveurs en cours d'ex\u00e9cution soient arr\u00eat\u00e9s \u00e0 ce stade par le gestionnaire d'installation centralis\u00e9e, vous devrez annuler l'op\u00e9ration.    


was.uninstall.summary.all=Le Gestionnaire d'installation centralis\u00e9e tentera d'arr\u00eater tous les serveurs en cours d'ex\u00e9cution sur l'h\u00f4te cible avant de d\u00e9marrer la d\u00e9sinstallation. \
Celle-ci sera autoris\u00e9e \u00e0 se poursuivre m\u00eame si certains serveurs n'ont pu \u00eatre arr\u00eat\u00e9s. \
Mais la d\u00e9sinstallation suivante risque d'\u00e9chouer. \
Si vous ne voulez pas que les serveurs en cours d'ex\u00e9cution soient arr\u00eat\u00e9s \u00e0 ce stade par le gestionnaire d'installation centralis\u00e9e, vous devrez annuler l'op\u00e9ration.    


was.maintenance.update.warning.all=Aant d'ex\u00e9cuter WebSphere Update Installer pour installer ou d\u00e9sinstaller de la maintenance sur les cibles s\u00e9lectionn\u00e9es, le gestionnaire d'installation centralis\u00e9e contacte tous les agents de noeuds sur les h\u00f4tes cibles pour arr\u00eater tous les processus serveurs en cours d'ex\u00e9cution sur les cibles. \
Si les agents de noeuds ne sont pas en cours d'ex\u00e9cution sur l'h\u00f4te cible, avant de continuer, vous devez vous assurer que la totalit\u00e9 des processus serveurs ont bien \u00e9t\u00e9 arr\u00eat\u00e9s sur les cibles s\u00e9lectionn\u00e9es. \
Une fois que la mise \u00e0 jour de maintenance aura \u00e9t\u00e9 install\u00e9e de mani\u00e8re satisfaisante, le gestionnaire d'installation centralis\u00e9e red\u00e9marrera automatiquement l'agent de noeud sur l'h\u00f4te cible.


