# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=A WebSphere Extended Deployment Operations Optimization \u00fagy eg\u00e9sz\u00edti ki a WebSphere Application Server Network Deployment 6.1 v\u00e1ltozat\u00e1t, hogy tov\u00e1bbfejleszt\u00e9seket biztos\u00edt a dinamikus m\u0171veletekben \u00e9s a kiterjesztett kezelhet\u0151s\u00e9gben. \
M\u0171veleti t\u00e1mogat\u00e1st tartalmaz a PHP, a Compute Grid, \u00e9s a nagy teljes\u00edtm\u00e9ny\u0171 alkalmaz\u00e1sok sz\u00e1m\u00e1ra.

xd.61.xdagent.description=Ez egy v\u00e1laszthat\u00f3 WebSphere Extended Deployment \u00f6sszetev\u0151, amely a kevert kiszolg\u00e1l\u00f3j\u00fa k\u00f6rnyezetek (pl: a t\u00e1voli megfigyel\u00e9s) t\u00e1mogat\u00e1s\u00e1nak \u00e9rdek\u00e9ben olyan t\u00e1voli munka\u00e1llom\u00e1sokra telep\u00edthet\u0151, ahol a WebSphere Application Server nincs telep\u00edtve.

xd.61.compute.grid.description=A WebSphere Extended Deployment Compute Grid \u00fagy eg\u00e9sz\u00edti ki a WebSphere Application Server Network Deployment 6.1 v\u00e1ltozat\u00e1t, hogy t\u00e1mogat\u00e1st ny\u00fajt a Compute Grid feladatok futtat\u00e1s\u00e1hoz (tranzakci\u00f3s k\u00f6tegelt feladatok, sz\u00e1m\u00edt\u00e1sintenz\u00edv feladatok \u00e9s nat\u00edv feladatok). \
Tov\u00e1bb\u00e1 \u00fctemez\u0151t \u00e9s feladatkezel\u00e9si funkci\u00f3kat is tartalmaz a feladatok vez\u00e9rl\u00e9s\u00e9hez.

xd.61.data.grid.description=A WebSphere Extended Deployment Data Grid \u00fagy eg\u00e9sz\u00edti ki a WebSphere Application Server Network Deployment 6.1 v\u00e1ltozat\u00e1t, hogy t\u00e1mogat\u00e1st ny\u00fajt a nagy teljes\u00edtm\u00e9ny\u0171 alkalmaz\u00e1sok sz\u00e1m\u00e1ra. \
Tov\u00e1bb\u00e1 tartalmazza az ObjectGrid eszk\u00f6zt \u00e9s a particion\u00e1l\u00f3 szolg\u00e1ltat\u00e1st is.

updi.61.description=Az Update Installer seg\u00edts\u00e9g\u00e9vel telep\u00edthet\u0151k a friss\u00edt\u00e9sek, mint p\u00e9ld\u00e1ul a k\u00f6ztes jav\u00edt\u00e1sok, a jav\u00edt\u00f3csomagok \u00e9s a friss\u00edt\u0151csomagok az IBM WebSphere szoftverekbe. \
Ez az Update Installer a WebSphere Application Server V6.1 kiad\u00e1sokhoz tartozik.

nd.61.fixpack.description=Ez a telep\u00edt\u0151csomag olyan f\u00e1jlokat tartalmaz, amelyek a WebSphere Application Server Network Deployment 6.1 v\u00e1ltozat\u00fa telep\u00edt\u00e9sek megadott jav\u00edt\u00f3csomag-szintre t\u00f6rt\u00e9n\u0151 friss\u00edt\u00e9s\u00e9re szolg\u00e1lnak. \
Miut\u00e1n a k\u00edv\u00e1nt platformhoz sz\u00fcks\u00e9ges f\u00e1jlok let\u00f6lt\u00e9sre ker\u00fcltek, egy adminisztr\u00e1tor a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 \u00e9s a WebSphere Update Installer seg\u00edts\u00e9g\u00e9vel telep\u00edtheti a csomagot a megfelel\u0151 hosztokon. \
Ez a telep\u00edt\u0151csomag f\u00fcgg a WebSphere Update Installer csomagt\u00f3l. \
\u00c9ppen ez\u00e9rt az Update Installer bin\u00e1ris f\u00e1jljait le kell t\u00f6lteni, miel\u0151tt ezt a telep\u00edt\u0151csomagot a c\u00e9lhosztok friss\u00edt\u00e9s\u00e9re haszn\u00e1lhatn\u00e1.

xd.61.fixpack.description=Ez a telep\u00edt\u0151csomag olyan f\u00e1jlokat tartalmaz, amelyek a WebSphere Extended Deployment 6.1 v\u00e1ltozat\u00fa telep\u00edt\u00e9sek megadott jav\u00edt\u00f3csomag-szintre t\u00f6rt\u00e9n\u0151 friss\u00edt\u00e9s\u00e9re szolg\u00e1lnak. \
Miut\u00e1n a k\u00edv\u00e1nt platformhoz sz\u00fcks\u00e9ges f\u00e1jlok let\u00f6lt\u00e9sre ker\u00fcltek, egy adminisztr\u00e1tor a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 \u00e9s a WebSphere Update Installer seg\u00edts\u00e9g\u00e9vel telep\u00edtheti a csomagot a megfelel\u0151 hosztokon. \
Ez a telep\u00edt\u0151csomag f\u00fcgg a WebSphere Update Installer csomagt\u00f3l. \
\u00c9ppen ez\u00e9rt az Update Installer bin\u00e1ris f\u00e1jljait le kell t\u00f6lteni, miel\u0151tt ezt a telep\u00edt\u0151csomagot a c\u00e9lhosztok friss\u00edt\u00e9s\u00e9re haszn\u00e1lhatn\u00e1.

nd.61.maintenance.description=Ez a telep\u00edt\u0151csomag egy felhaszn\u00e1l\u00f3k \u00e1ltal \u00f6ssze\u00e1ll\u00edtott csomag a WebSphere Application Server Network Deployment Version 6.1 karbantart\u00e1sa sz\u00e1m\u00e1ra. \
A csomagban felhaszn\u00e1l\u00f3k \u00e1ltal kiv\u00e1lasztott k\u00f6ztes jav\u00edt\u00e1sok helyezhet\u0151k el az eml\u00edtett term\u00e9k sz\u00e1m\u00e1ra, amely az IBM term\u00e9kt\u00e1mogat\u00e1si webhely\u00e9r\u0151l let\u00f6lthet\u0151. \
Ez a csomag a kiv\u00e1lasztott karbantart\u00e1si elemek telep\u00edt\u00e9s\u00e9re \u00e9s elt\u00e1vol\u00edt\u00e1s\u00e1ra is alkalmazhat\u00f3 a c\u00e9lhosztokr\u00f3l a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 \u00e9s a WebSphere Update Installer \
seg\u00edts\u00e9g\u00e9vel. \
Ez a telep\u00edt\u0151csomag f\u00fcgg a WebSphere Update Installer telep\u00edt\u0151csomagt\u00f3l. \
\u00c9ppen ez\u00e9rt az Update Installer bin\u00e1ris f\u00e1jljait le kell t\u00f6lteni, miel\u0151tt a csomagb\u00f3l b\u00e1rmilyen jav\u00edt\u00e1st telep\u00edthetne.

xd.61.maintenance.description=Ez a telep\u00edt\u0151csomag egy felhaszn\u00e1l\u00f3k \u00e1ltal \u00f6ssze\u00e1ll\u00edtott csomag a WebSphere Extended Deployment 6.1 v\u00e1ltozat karbantart\u00e1sa sz\u00e1m\u00e1ra. \
A csomagban felhaszn\u00e1l\u00f3k \u00e1ltal kiv\u00e1lasztott k\u00f6ztes jav\u00edt\u00e1sok helyezhet\u0151k el az eml\u00edtett term\u00e9k sz\u00e1m\u00e1ra, amely az IBM term\u00e9kt\u00e1mogat\u00e1si webhely\u00e9r\u0151l let\u00f6lthet\u0151. \
Ez a csomag a kiv\u00e1lasztott karbantart\u00e1si elemek telep\u00edt\u00e9s\u00e9re \u00e9s elt\u00e1vol\u00edt\u00e1s\u00e1ra is alkalmazhat\u00f3 a c\u00e9lhosztokr\u00f3l a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 \u00e9s a WebSphere Update Installer \
seg\u00edts\u00e9g\u00e9vel. \
Ez a telep\u00edt\u0151csomag f\u00fcgg a WebSphere Update Installer telep\u00edt\u0151csomagt\u00f3l. \
\u00c9ppen ez\u00e9rt az Update Installer bin\u00e1ris f\u00e1jljait le kell t\u00f6lteni, miel\u0151tt a csomagb\u00f3l b\u00e1rmilyen jav\u00edt\u00e1st telep\u00edthetne.

wasce.description=A WebSphere Application Server Community Edition egy ingyenes, egyszer\u0171 Java 2 Platform, Enterprise Edition (J2EE) alkalmaz\u00e1skiszolg\u00e1l\u00f3, amely az Apache Geronimo technol\u00f3gia\u00e1ra \u00e9p\u00fcl. \
A ny\u00edlt forr\u00e1s\u00fa k\u00f6z\u00f6ss\u00e9g legfrissebb innov\u00e1ci\u00f3it alkalmazva ny\u00fajt egy integr\u00e1lt, k\u00f6nnyen hozz\u00e1f\u00e9rhet\u0151 \u00e9s rugalmas alapot a Java alkalmaz\u00e1sok fejleszt\u00e9s\u00e9hez \u00e9s telep\u00edt\u00e9s\u00e9hez.
wasce.feature.longname.ServerOnly=Csak kiszolg\u00e1l\u00f3
wasce.feature.description.ServerOnly=Ez az \u00f6sszetev\u0151 csak a kiszolg\u00e1l\u00f3t tartalmazza.
wasce.feature.longname.ServerAndSDK=Kiszolg\u00e1l\u00f3 \u00e9s IBM szoftverfejleszt\u0151-k\u00e9szlet (SDK)
wasce.feature.description.ServerAndSDK=Ez az \u00f6sszetev\u0151 tartalmazza a kiszolg\u00e1l\u00f3t \u00e9s az IBM szoftverfejleszt\u0151-k\u00e9szletet a let\u00f6lt\u00f6tt platformokhoz.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Adja meg egy t\u00e1mogatott Java k\u00f6rnyezet telep\u00edt\u00e9si k\u00f6nyvt\u00e1r\u00e1t a c\u00e9lhoszton. \
Amennyiben nem ad meg telep\u00edt\u00e9si k\u00f6nyvt\u00e1r-\u00fatvonalat, a WebSphere Application Server Community Edition telep\u00edt\u0151program megpr\u00f3b\u00e1l keresni egyet. \
Azonban a WebSphere Application Server Community Edition telep\u00edt\u00e9se meghi\u00fasul, ha a telep\u00edt\u0151program nem tal\u00e1l t\u00e1mogatott Java k\u00f6rnyezetet.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=Az al\u00e1bbi t\u00e1bl\u00e1zat jelzi az IBM Software Developer Kit (SDK), Java 2 Technology Edition telep\u00edt\u00e9si hely\u00e9t.   

wasce.sdk.default.install.loc.aix=Ez egy alap\u00e9rtelmezett telep\u00edt\u00e9si hely. Nem m\u00f3dos\u00edthat\u00f3.
wasce.sdk.default.install.loc.linux=A t\u00e9nyleges hely az adott SDK szoftvercsomagt\u00f3l f\u00fcgg. A hely el\u0151re meghat\u00e1rozott, \u00e9s nem m\u00f3dos\u00edthat\u00f3.
wasce.sdk.default.install.loc.solaris=A telep\u00edt\u00e9si hely a WebSphere Application Server Community Edition telep\u00edt\u00e9si hely\u00e9hez viszony\u00edtott. A hely el\u0151re meghat\u00e1rozott, \u00e9s nem m\u00f3dos\u00edthat\u00f3.
wasce.sdk.default.install.loc.windows=Ez egy alap\u00e9rtelmezett telep\u00edt\u00e9si hely. Nem m\u00f3dos\u00edthat\u00f3.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Ne feledje, hogy az IBM szoftverfejleszt\u0151-k\u00e9szlet (SDK) \
Windows platformra sz\u00e1nt v\u00e1ltozata nem t\u00e1vol\u00edthat\u00f3 el a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 \
seg\u00edts\u00e9g\u00e9vel. \
Ha a WebSphere Application Server Community Edition term\u00e9ket \u00e9s az IBM SDK for Windows \
term\u00e9ket k\u00e9s\u0151bb el k\u00edv\u00e1nja t\u00e1vol\u00edtani a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151vel, akkor az SDK \
fejleszt\u0151k\u00e9szletet saj\u00e1t kez\u0171leg kell elt\u00e1vol\u00edtania a c\u00e9lhosztr\u00f3l a Windows Vez\u00e9rl\u0151pult \
Programok telep\u00edt\u00e9se \u00e9s t\u00f6rl\u00e9se funkci\u00f3j\u00e1nak seg\u00edts\u00e9g\u00e9vel.

wasce.sdk.uninstall.summary.win=Ne feledje, hogy az IBM szoftverfejleszt\u0151-k\u00e9szlet (SDK) \
Windows platformra sz\u00e1nt v\u00e1ltozata nem t\u00e1vol\u00edthat\u00f3 el a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 \
seg\u00edts\u00e9g\u00e9vel. \
Az IBM SDK for Windows telep\u00edtve marad az elt\u00e1vol\u00edt\u00e1si folyamat v\u00e9grehajt\u00e1sa ut\u00e1n. \
Az SDK fejleszt\u0151k\u00e9szletet saj\u00e1t kez\u0171leg kell elt\u00e1vol\u00edtania a c\u00e9lhosztr\u00f3l a Windows Vez\u00e9rl\u0151pult \
Programok telep\u00edt\u00e9se \u00e9s t\u00f6rl\u00e9se funkci\u00f3j\u00e1nak seg\u00edts\u00e9g\u00e9vel.

wasce.uninstall.summary.all=A kiszolg\u00e1l\u00f3k elt\u00e1vol\u00edt\u00e1sa el\u0151tt le kell \u00e1ll\u00edtania minden fut\u00f3 \
WebSphere Application Server Community Edition kiszolg\u00e1l\u00f3t a c\u00e9lhosztokon. \
Az elt\u00e1vol\u00edt\u00e1si k\u00e9r\u00e9s elk\u00fcld\u00e9se el\u0151tt \u00e1ll\u00edtsa le a kiszolg\u00e1l\u00f3kat, ha azok m\u00e9g futnak.


was.maintenance.update.warning.all=Miel\u0151tt futtatn\u00e1 a WebSphere Update Installer eszk\u00f6zt a kiv\u00e1lasztott c\u00e9lokra karbantart\u00e1s telep\u00edt\u00e9s\u00e9hez vagy elt\u00e1vol\u00edt\u00e1s\u00e1hoz, a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 megh\u00edvja a c\u00e9lhosztok csom\u00f3pont\u00fcgyn\u00f6keit, hogy \u00e1ll\u00edts\u00e1k le a c\u00e9lokon fut\u00f3 kiszolg\u00e1l\u00f3 folyamatokat. \
Ha a csom\u00f3pont\u00fcgyn\u00f6k\u00f6k nem futnak a c\u00e9lhoszton, akkor gondoskodj\u00e9k r\u00f3la, hogy a kijel\u00f6lt c\u00e9lok kiszolg\u00e1l\u00f3 folyamatai le\u00e1ll\u00edt\u00e1sra ker\u00fcljenek folytat\u00e1s el\u0151tt. \
A karbantart\u00e1si friss\u00edt\u00e9s sikeres v\u00e9grehajt\u00e1sa ut\u00e1n a k\u00f6zpontos\u00edtott telep\u00edt\u00e9skezel\u0151 automatikusan \u00fajraind\u00edtja a csom\u00f3pont\u00fcgyn\u00f6k\u00f6ket a kijel\u00f6lt c\u00e9lhosztokon.



