# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=WebSphere Extended Deployment Operations Optimization \u306f\u3001\u52d5\u7684\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3001\u7ba1\u7406\u306e\u5bb9\u6613\u6027\u306e\u5f37\u5316\u306b\u3088\u308a\u3001WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u3092\u62e1\u5f35\u3057\u307e\u3059\u3002 \
\u3053\u308c\u306b\u306f\u3001PHP\u3001Compute Grid\u3001\u304a\u3088\u3073\u30cf\u30a4\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30dd\u30fc\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002

xd.61.xdagent.description=\u3053\u308c\u306f\u30aa\u30d7\u30b7\u30e7\u30f3\u306e WebSphere Extended Deployment \u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3067\u3001WebSphere Application Server \u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u306a\u3044\u30ea\u30e2\u30fc\u30c8\u30fb\u30ef\u30fc\u30af\u30b9\u30c6\u30fc\u30b7\u30e7\u30f3\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3001\u30ea\u30e2\u30fc\u30c8\u30fb\u30e2\u30cb\u30bf\u30fc\u3092\u542b\u3080\u6df7\u5408\u30b5\u30fc\u30d0\u30fc\u74b0\u5883\u30b5\u30dd\u30fc\u30c8\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002

xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid \u306f\u3001Compute Grid \u30b8\u30e7\u30d6 (\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30d0\u30c3\u30c1\u30fb\u30b8\u30e7\u30d6\u3001\u6570\u5024\u8a08\u7b97\u30b8\u30e7\u30d6\u3001\u304a\u3088\u3073\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30b8\u30e7\u30d6) \u306e\u5b9f\u884c\u30b5\u30dd\u30fc\u30c8\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u306b\u3088\u308a\u3001WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u3092\u62e1\u5f35\u3057\u307e\u3059\u3002 \
\u3053\u308c\u306b\u306f\u3001\u3053\u308c\u3089\u306e\u30b8\u30e7\u30d6\u3092\u7ba1\u7406\u3059\u308b\u305f\u3081\u306e\u30b9\u30b1\u30b8\u30e5\u30fc\u30e9\u30fc\u304a\u3088\u3073\u30b8\u30e7\u30d6\u7ba1\u7406\u6a5f\u80fd\u3082\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002

xd.61.data.grid.description=WebSphere Extended Deployment Data Grid \u306f\u3001\u30cf\u30a4\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u306b\u3088\u308a\u3001WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u3092\u62e1\u5f35\u3057\u307e\u3059\u3002 \
\u3053\u308c\u306b\u306f\u3001ObjectGrid \u304a\u3088\u3073\u533a\u5206\u5316\u6a5f\u80fd\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002

updi.61.description=Update Installer \u306f\u3001IBM WebSphere \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306b\u5bfe\u3059\u308b\u66f4\u65b0 (\u66ab\u5b9a\u4fee\u6b63\u3001\u30d5\u30a3\u30c3\u30af\u30b9\u30d1\u30c3\u30af\u3001\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30fb\u30d1\u30c3\u30af\u306a\u3069) \u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u3002 \
\u3053\u306e Update Installer \u306f\u3001WebSphere Application Server V6.1 \u30ea\u30ea\u30fc\u30b9\u7528\u3067\u3059\u3002

nd.61.fixpack.description=\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u3092\u6307\u5b9a\u3055\u308c\u305f\u30d5\u30a3\u30c3\u30af\u30b9\u30d1\u30c3\u30af\u30fb\u30ec\u30d9\u30eb\u306b\u66f4\u65b0\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u5fc5\u8981\u306a\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u7528\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u305f\u5f8c\u3001\u7ba1\u7406\u8005\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304a\u3088\u3073 WebSphere Update Installer \u3092\u4f7f\u7528\u3057\u3066\u9069\u5207\u306a\u30db\u30b9\u30c8\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u969b\u306b\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \
\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Update Installer \u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u306e\u66f4\u65b0\u306e\u305f\u3081\u306b\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u4f7f\u7528\u3059\u308b\u524d\u306b\u3001Update Installer \u306e\u30d0\u30a4\u30ca\u30ea\u30fc\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002

xd.61.fixpack.description=\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e WebSphere Extended Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u3092\u6307\u5b9a\u3055\u308c\u305f\u30d5\u30a3\u30c3\u30af\u30b9\u30d1\u30c3\u30af\u30fb\u30ec\u30d9\u30eb\u306b\u66f4\u65b0\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u5fc5\u8981\u306a\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u7528\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u305f\u5f8c\u3001\u7ba1\u7406\u8005\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304a\u3088\u3073 WebSphere Update Installer \u3092\u4f7f\u7528\u3057\u3066\u9069\u5207\u306a\u30db\u30b9\u30c8\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u969b\u306b\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \
\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Update Installer \u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u306e\u66f4\u65b0\u306e\u305f\u3081\u306b\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u4f7f\u7528\u3059\u308b\u524d\u306b\u3001Update Installer \u306e\u30d0\u30a4\u30ca\u30ea\u30fc\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002

nd.61.maintenance.description=\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Application Server Network Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u306b\u5bfe\u3059\u308b\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u96c6\u3081\u305f\u4fdd\u5b88\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u3059\u3002 \
\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001IBM Support Web \u30b5\u30a4\u30c8\u304b\u3089\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u305f\u3001\u5f53\u8a72\u88fd\u54c1\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u9078\u629e\u3057\u305f\u66ab\u5b9a\u4fee\u6b63\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304a\u3088\u3073 WebSphere Update Installer \u3092\u4f7f\u7528\u3057\u3066\u3001\u9078\u629e\u3055\u308c\u305f\u4fdd\u5b88\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u307e\u305f\u306f\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u305f\u3081\u306b\u3082\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Update Installer \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u304b\u3089\u4fee\u6b63\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u3001Update Installer \u306e\u30d0\u30a4\u30ca\u30ea\u30fc\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002

xd.61.maintenance.description=\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Extended Deployment \u30d0\u30fc\u30b8\u30e7\u30f3 6.1 \u306b\u5bfe\u3059\u308b\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u96c6\u3081\u305f\u4fdd\u5b88\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u3059\u3002 \
\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u9078\u629e\u3055\u308c\u305f\u3001IBM \u30b5\u30dd\u30fc\u30c8\u30b5\u30a4\u30c8\u304b\u3089\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3055\u308c\u305f\u5f53\u8a72\u88fd\u54c1\u7528\u66ab\u5b9a\u4fee\u6b63\u3092\u4fdd\u6301\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304a\u3088\u3073 WebSphere Update Installer \u3092\u4f7f\u7528\u3057\u3066\u3001\u9078\u629e\u3055\u308c\u305f\u4fdd\u5b88\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u307e\u305f\u306f\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u305f\u3081\u306b\u3082\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001WebSphere Update Installer \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u304b\u3089\u4fee\u6b63\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u3001Update Installer \u306e\u30d0\u30a4\u30ca\u30ea\u30fc\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002

wasce.description=WebSphere Application Server Community Edition \u306f\u3001Apache  Geronimo \u30c6\u30af\u30ce\u30ed\u30b8\u30fc\u3067\u30d3\u30eb\u30c9\u3055\u308c\u305f\u7121\u6599\u3067\u8efd\u91cf\u306e Java 2 Platform Enterprise Edition (J2EE) \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u3059\u3002 \
Java \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u958b\u767a\u304a\u3088\u3073\u30c7\u30d7\u30ed\u30a4\u306e\u305f\u3081\u3001\u7d71\u5408\u3055\u308c\u3001\u5bb9\u6613\u306b\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3067\u3001\u67d4\u8edf\u6027\u3042\u308b\u30d5\u30a1\u30a6\u30f3\u30c7\u30fc\u30b7\u30e7\u30f3\u3092\u914d\u4fe1\u3059\u308b\u305f\u3081\u306b\u3001\u30aa\u30fc\u30d7\u30f3\u30fb\u30bd\u30fc\u30b9\u30fb\u30b3\u30df\u30e5\u30cb\u30c6\u30a3\u30fc\u304b\u3089\u306e\u6700\u65b0\u306e\u30a4\u30ce\u30d9\u30fc\u30b7\u30e7\u30f3\u3092\u6d3b\u7528\u3057\u307e\u3059\u3002
wasce.feature.longname.ServerOnly=\u30b5\u30fc\u30d0\u30fc\u306e\u307f
wasce.feature.description.ServerOnly=\u3053\u306e\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306b\u306f\u30b5\u30fc\u30d0\u30fc\u306e\u307f\u304c\u542b\u307e\u308c\u307e\u3059\u3002
wasce.feature.longname.ServerAndSDK=\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073 IBM Software Developer Kit (SDK)
wasce.feature.description.ServerAndSDK=\u3053\u306e\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306b\u306f\u3001\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u305f\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u7528\u306e\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073 IBM Software Developer Kit \u304c\u542b\u307e\u308c\u307e\u3059\u3002

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u306e\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u308b Java \u74b0\u5883\u7528\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \
\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u30fb\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u306a\u3044\u3068\u3001WebSphere Application Server Community Edition \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u304c\u3053\u308c\u3092\u898b\u3064\u3051\u3088\u3046\u3068\u3057\u307e\u3059\u3002 \
\u305f\u3060\u3057\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u304c\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u308b Java \u74b0\u5883\u3092\u898b\u3064\u3051\u3089\u308c\u306a\u3044\u3068\u3001WebSphere Application Server Community Edition \u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306f\u5931\u6557\u3057\u307e\u3059\u3002

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=\u4ee5\u4e0b\u306e\u8868\u306b\u3001IBM Software Developer Kit (SDK), Java 2 Technology Edition \u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u793a\u3057\u307e\u3059\u3002   

wasce.sdk.default.install.loc.aix=\u3053\u308c\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002 \u3053\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
wasce.sdk.default.install.loc.linux=\u5b9f\u969b\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u4f7f\u7528\u3055\u308c\u308b SDK \u30d0\u30f3\u30c9\u30eb\u306b\u3088\u3063\u3066\u6c7a\u307e\u308a\u307e\u3059\u3002 \u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u4e8b\u524d\u5b9a\u7fa9\u3055\u308c\u3066\u304a\u308a\u3001\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
wasce.sdk.default.install.loc.solaris=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001WebSphere Application Server Community Edition \u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u57fa\u6e96\u306b\u3057\u3066\u3044\u307e\u3059\u3002 \u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u4e8b\u524d\u5b9a\u7fa9\u3055\u308c\u3066\u304a\u308a\u3001\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
wasce.sdk.default.install.loc.windows=\u3053\u308c\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002 \u3053\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=IBM Software Developer Kit (SDK) for Windows \u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u4f7f\u7528\u3057\u3066\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 \
\u5f8c\u3067\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u4f7f\u7528\u3057\u3066 WebSphere Application Server Community Edition \u304a\u3088\u3073 IBM SDK for Windows \u3092\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u306b\u306f\u3001Windows \u306e\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30fb\u30d1\u30cd\u30eb\u306e\u300c\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u8ffd\u52a0\u3068\u524a\u9664\u300d\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u3066\u3001\u624b\u52d5\u3067\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u304b\u3089 SDK \u3092\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

wasce.sdk.uninstall.summary.win=IBM Software Developer Kit (SDK) for Windows \u306f\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u4f7f\u7528\u3057\u3066\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 \
IBM SDK for Windows \u306f\u3001\u3053\u306e\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u51e6\u7406\u304c\u5b8c\u4e86\u3057\u3066\u3082\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u305f\u307e\u307e\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002 \
Windows \u306e\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30fb\u30d1\u30cd\u30eb\u306e\u300c\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u8ffd\u52a0\u3068\u524a\u9664\u300d\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u3066\u3001\u624b\u52d5\u3067\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u304b\u3089 SDK \u3092\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

wasce.uninstall.summary.all=\u30b5\u30fc\u30d0\u30fc\u3092\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u3067\u7a3c\u50cd\u4e2d\u306e\u3059\u3079\u3066\u306e WebSphere Application Server Community Edition \u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \
\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u8981\u6c42\u3092\u30b5\u30d6\u30df\u30c3\u30c8\u3059\u308b\u524d\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u307e\u3060\u5b9f\u884c\u4e2d\u306e\u5834\u5408\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\u3002


was.maintenance.update.warning.all=WebSphere Update Installer \u30c4\u30fc\u30eb\u3092\u5b9f\u884c\u3057\u3066\u9078\u629e\u3057\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u3067\u4fdd\u5b88\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u307e\u305f\u306f\u30a2\u30f3\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u524d\u306b\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u4e0a\u306e\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306b\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u3067\u5b9f\u884c\u4e2d\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u3092\u3059\u3079\u3066\u505c\u6b62\u3059\u308b\u3088\u3046\u8981\u6c42\u3057\u307e\u3059\u3002 \
\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u3067\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u9078\u629e\u3057\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u306e\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u304c\u505c\u6b62\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u3001\u4f5c\u696d\u3092\u7d9a\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \
\u9078\u629e\u3057\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u3067\u4fdd\u5b88\u66f4\u65b0\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3059\u308b\u3068\u3001\u96c6\u4e2d\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u81ea\u52d5\u7684\u306b\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30db\u30b9\u30c8\u4e0a\u306e\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u3092\u518d\u59cb\u52d5\u3057\u307e\u3059\u3002



