# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=WebSphere Extended Deployment Operations Optimization extinde WebSphere Application Server Network Deployment versiunea 6.1 oferind \u00eembun\u0103t\u0103\u0163iri ale opera\u0163iilor dinamice \u015fi gestionabilitate extins\u0103. \
Include suport opera\u0163ional pentru PHP, Compute Grid \u015fi aplica\u0163ii de \u00eenalt\u0103 performan\u0163\u0103.

xd.61.xdagent.description=Aceasta este o caracteristic\u0103 op\u0163ional\u0103 a WebSphere Extended Deployment care este instalat\u0103 pe sta\u0163iile de lucru cu access la distan\u0163\u0103 pe care nu este instalat WebSphere Application Server care s\u0103 asigure suport pentru un mediu eterogen de servere, incluz\u00e2nd monitorizarea la distan\u0163\u0103.

xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid extinde WebSphere Application Server Network Deployment versiunea 6.1 oferind suport pentru joburile active ale Compute Grid (job batchuri tranzac\u0163ionale, joburi de calcule intensive \u015fi joburi native). \
De asemenea, include un planificator \u015fi func\u0163ii de gestionare a joburilor pentru a controla aceste joburi.

xd.61.data.grid.description=WebSphere Extended Deployment Data Grid extinde WebSphere Application Server Network Deployment versiunea 6.1 oferind suport pentru aplica\u0163iile de \u00eenalt\u0103 performan\u0163\u0103. \
Include ObjectGrid \u015fi facilitatea de parti\u0163ionare.

updi.61.description=Update Installer instaleaz\u0103 actualiz\u0103ri, cum ar fi: corec\u0163ii temporare, pachete de corec\u0163ii \u015fi pachete de actualiz\u0103ri intermediare pentru software-ul IBM WebSphere. \
Acest Update Installer este pentru produsele lansate din familia WebSphere Application Server V6.1.

nd.61.fixpack.description=Acest pachet de instalare poate fi folosit pentru a include fi\u015fierele necesare pentru a actualiza instal\u0103rile de WebSphere Application Server Network Deployment versiunea 6.1 la nivelul pentru pachetul de corec\u0163ii specificat. \
Dup\u0103 ce fi\u015fierele pentru platformele necesare sunt desc\u0103rcate un administrator poate folosi pachetul pentru instalarea pe gazdele corespunz\u0103toare folosind managerul de instalare centralizat\u0103 \u015fi WebSphere Update Installer. \
Acest pachet de instalare este dependent de pachetul WebSphere Update Installer. \
Ca urmare, binarele pentru Update Installer trebuie desc\u0103rcate \u00eenainte de folosirea acestui pachet de instalare pentru actualizarea gazdelor \u0163int\u0103.

xd.61.fixpack.description=Acest pachet de instalare poate fi folosit pentru a include fi\u015fierele necesare pentru a actualiza instal\u0103rile de WebSphere Extended Deployment versiunea 6.1 la nivelul pentru pachetul de corec\u0163ii specificat. \
Dup\u0103 ce fi\u015fierele pentru platformele necesare sunt desc\u0103rcate un administrator poate folosi pachetul pentru instalarea pe gazdele corespunz\u0103toare folosind managerul de instalare centralizat\u0103 \u015fi WebSphere Update Installer. \
Acest pachet de instalare este dependent de pachetul WebSphere Update Installer. \
Ca urmare, binarele pentru Update Installer trebuie desc\u0103rcate \u00eenainte de folosirea acestui pachet de instalare pentru actualizarea gazdelor \u0163int\u0103.

nd.61.maintenance.description=Acest pachet de instalare este un pachet asamblat de utilizator pentru \u00eentre\u0163inerea WebSphere Application Server Network Deployment versiunea 6.1. \
Acest pachet poate con\u0163ine corec\u0163ii temporare alese de utilizator pentru produsele men\u0163ionate desc\u0103rcate de pe situl web de suport IBM. \
Acest pachet poate fi folosit \u015fi pentru instalarea sau dezinstalarea pachetele de \u00eentre\u0163inere selectate de pe gazdele \u0163int\u0103 folosind managerul de instalare centralizat\u0103 \u015fi WebSphere Update Installer. \
Acest pachet de instalare este dependent de pachetul de instalare WebSphere Update Installer. \
Ca urmare, binarele pentru Update Installer trebuie desc\u0103rcate \u00eenainte de a instala oricare dintre corec\u0163iile din acest pachet.

xd.61.maintenance.description=Acest pachet de instalare este un pachet asamblat de utilizator pentru \u00eentre\u0163inerea WebSphere Extended Server Network Deployment versiunea 6.1. \
Acest pachet poate fi folosit pentru a re\u0163ine corec\u0163ii temporare alese de utilizator pentru produsele men\u0163ionate desc\u0103rcate de pe situl web de suport IBM. \
Acest pachet poate fi folosit \u015fi pentru instalarea sau dezinstalarea pachetele de \u00eentre\u0163inere selectate de pe gazdele \u0163int\u0103 folosind managerul de instalare centralizat\u0103 \u015fi WebSphere Update Installer. \
Acest pachet de instalare este dependent de pachetul de instalare WebSphere Update Installer. \
Ca urmare, binarele pentru Update Installer trebuie desc\u0103rcate \u00eenainte de a instala oricare dintre corec\u0163iile din acest pachet.

wasce.description=WebSphere Application Server Community Edition este un server de aplica\u0163ii gratuit pe platform\u0103 de categorie u\u015foar\u0103 Java 2 Platform, Enterprise Edition (J2EE) dezvoltat pe tehnologie Apache Geronimo. \
Gestioneaz\u0103 ultimele inova\u0163ii din comunitatea open source pentru a oferi o baz\u0103 integrat\u0103, u\u015for accesibil\u0103 \u015fi flexibil\u0103 pentru dezvoltarea \u015fi implementarea aplica\u0163iilor Java.
wasce.feature.longname.ServerOnly=Numai server
wasce.feature.description.ServerOnly=Aceast\u0103 caracteristic\u0103 include doar serverul.
wasce.feature.longname.ServerAndSDK=Server \u015fi SDK (kit dezvoltare software) IBM
wasce.feature.description.ServerAndSDK=Aceast\u0103 caracteristic\u0103 include serverul \u015fi kitul dezvoltare software IBM pentru platformele pe care le-a\u0163i desc\u0103rcat.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Specifica\u0163i directorul de instalare pentru un mediu Java suportat pe gazda \u0163int\u0103. \
Dac\u0103 nu specifica\u0163i calea directorului de instalare, programul de instalare WebSphere Application Server Community Edition va \u00eencerca sa localizeze una. \
Totu\u015fi, instalarea WebSphere Application Server Community Edition va e\u015fua dac\u0103 un mediu Java suportat nu poate fi localizat de programul de instalare.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=Urm\u0103torul tabel afi\u015feaz\u0103 loca\u0163ia de instalare pentru SDK (kit dezvoltare software)IBM, Java 2 Technology Edition.   

wasce.sdk.default.install.loc.aix=Aceasta este loca\u0163ia de instalare implicit\u0103. Aceast\u0103 loca\u0163ie nu poate fi modificat\u0103.
wasce.sdk.default.install.loc.linux=Loca\u0163ia real\u0103 depinde de bundle-ul specific SDK folosit. Loca\u0163ia este predefinit\u0103 \u015fi nu poate fi modificat\u0103.
wasce.sdk.default.install.loc.solaris=Loca\u0163ia de instalare este relativ\u0103 la loca\u0163ia de instalare pentru WebSphere Application Server Community Edition. Loca\u0163ia este predefinit\u0103 \u015fi nu poate fi modificat\u0103.
wasce.sdk.default.install.loc.windows=Aceasta este loca\u0163ia de instalare implicit\u0103. Aceast\u0103 loca\u0163ie nu poate fi modificat\u0103.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Re\u0163ine\u0163i c\u0103 SDK (kit dezvoltare software) IBM pentru Windows nu poate fi dezinstalat folosind managerul de instalare centralizat\u0103. \
Pentru a dezinstala WebSphere Application Server Community Edition \u015fi SDK IBM pentru Windows mai t\u00e2rziu folosind managerul de instalare centralizat\u0103 trebuie s\u0103 dezinstala\u0163i manual SDK de pe gazda \u0163int\u0103 folosind func\u0163ia Windows Add/Remove Progams din control panel.

wasce.sdk.uninstall.summary.win=Re\u0163ine\u0163i c\u0103 SDK (kit dezvoltare software) IBM pentru Windows nu poate fi dezinstalat folosind managerul de instalare centralizat\u0103. \
IBM SDK pentru Windows va r\u0103m\u00e2ne instalat dup\u0103 ce acest proces de dezinstalare este finalizat. \
Trebuie s\u0103 dezinstala\u0163i manual SDK de pe gazda \u0163int\u0103 folosind func\u0163ia Windows Add/Remove Progams din control panel.

wasce.uninstall.summary.all=Trebuie s\u0103 opri\u0163i toate serverele WebSphere Application Server Community Edition care ruleaz\u0103 pe gazdele \u0163int\u0103 \u00eenainte de dezinstalarea serverelor. \
Opri\u0163i serverele dac\u0103 acestea \u00eenc\u0103 mai ruleaz\u0103 \u00eenainte de lansarea cererii de dezinstalare.


was.maintenance.update.warning.all=\u00cenainte de a rula unealta WebSphere Update Installer pentru instalarea sau dezinstalarea pachetelor de \u00eentre\u0163inere pe \u0163intele vizate, managerul de instalare centralizat\u0103 apeleaz\u0103 agen\u0163ii de nod ai gazdelor \u0163int\u0103 s\u0103 opreasc\u0103 procesele serverelor active pe \u0163inte. \
Dac\u0103 agen\u0163ii de nod nu ruleaz\u0103 pe gazda \u0163int\u0103 trebuie s\u0103 v\u0103 asigura\u0163i c\u0103 toate procesele serverului de pe \u0163intele selectate sunt oprite \u00eenainte a continua. \
Dup\u0103 finalizarea cu succes a actualiz\u0103rii cu pachetul de \u00eentre\u0163inere pe \u0163inta vizat\u0103, managerul de instalare centralizat\u0103 va reporni automat agentul de nod pe gazda \u0163int\u0103.



