# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=Produkt WebSphere Extended Deployment Operations Optimization rozszerza produkt WebSphere Application Server Network Deployment 6.1 poprzez zapewnienie ulepsze\u0144 w zakresie operacji dynamicznych i rozszerzonych mo\u017cliwo\u015bci zarz\u0105dzania. \
Obejmuje to obs\u0142ug\u0119 operacji dla j\u0119zyka PHP, produktu Compute Grid i aplikacji o wysokiej wydajno\u015bci.

xd.61.xdagent.description=Jest to opcjonalny sk\u0142adnik produktu WebSphere Extended Deployment, kt\u00f3ry mo\u017cna zainstalowa\u0107 na zdalnych stacjach roboczych bez zainstalowanego serwera WebSphere Application Server w celu zapewnienia obs\u0142ugi \u015brodowiska z\u0142o\u017conego z r\u00f3\u017cnych serwer\u00f3w, w\u0142\u0105cznie ze zdalnym monitorowaniem.

xd.61.compute.grid.description=Produkt WebSphere Extended Deployment Compute Grid rozszerza produkt WebSphere Application Server Network Deployment 6.1 poprzez zapewnienie obs\u0142ugi w celu uruchamiania zada\u0144 Compute Grid (transakcyjnych zada\u0144 wsadowych, zada\u0144 intensywnie wykonuj\u0105cych obliczenia i zada\u0144 rodzimych). \
Obejmuje to program planuj\u0105cy i funkcje zarz\u0105dzania zadaniami w celu sterowania tymi zadaniami.

xd.61.data.grid.description=Produkt WebSphere Extended Deployment Data Grid rozszerza produkt WebSphere Application Server Network Deployment 6.1 poprzez zapewnienie obs\u0142ugi aplikacji o wysokiej wydajno\u015bci. \
Obejmuje to narz\u0119dzie ObjectGrid i narz\u0119dzie do partycjonowania.

updi.61.description=Narz\u0119dzie Update Installer instaluje aktualizacje, takie jak poprawki tymczasowe, pakiety poprawek i pakiety aktualizacyjne, dla oprogramowania IBM WebSphere. \
To narz\u0119dzie Update Installer jest przeznaczone dla produktu WebSphere Application Server 6.1.

nd.61.fixpack.description=W tym pakiecie instalacji mo\u017cna umie\u015bci\u0107 pliki wymagane do aktualizacji produktu WebSphere Application Server Network Deployment 6.1 do okre\u015blonego poziomu pakietu poprawek. \
Po pobraniu plik\u00f3w dla wymaganych platform administrator mo\u017ce u\u017cy\u0107 pakietu do instalacji na odpowiednich hostach przy u\u017cyciu scentralizowanego mened\u017cera instalacji i narz\u0119dzia WebSphere Update Installer. \
Ten pakiet instalacji jest zale\u017cny od pakietu WebSphere Update Installer. \
Oznacza to, \u017ce pliki binarne dla narz\u0119dzia Update Installer musz\u0105 zosta\u0107 pobrane przed u\u017cyciem tego pakietu instalacji do aktualizacji host\u00f3w docelowych.

xd.61.fixpack.description=W tym pakiecie instalacji mo\u017cna umie\u015bci\u0107 pliki wymagane do aktualizacji instalacji produktu WebSphere Extended Deployment 6.1 do okre\u015blonego poziomu pakietu poprawek. \
Po pobraniu plik\u00f3w dla wymaganych platform administrator mo\u017ce u\u017cy\u0107 pakietu do instalacji na odpowiednich hostach przy u\u017cyciu scentralizowanego mened\u017cera instalacji i narz\u0119dzia WebSphere Update Installer. \
Ten pakiet instalacji jest zale\u017cny od pakietu WebSphere Update Installer. \
Oznacza to, \u017ce pliki binarne dla narz\u0119dzia Update Installer musz\u0105 zosta\u0107 pobrane przed u\u017cyciem tego pakietu instalacji do aktualizacji host\u00f3w docelowych.

nd.61.maintenance.description=Ten pakiet instalacji to stworzony przez u\u017cytkownika pakiet serwisowy dla produktu WebSphere Application Server Network Deployment 6.1. \
W tym pakiecie mo\u017cna umie\u015bci\u0107 wybrane przez u\u017cytkownika poprawki tymczasowe dla wspomnianego produktu, kt\u00f3re zosta\u0142y pobrane z serwisu WWW wsparcia IBM. \
Za pomoc\u0105 tego pakietu mo\u017cna tak\u017ce instalowa\u0107 i deinstalowa\u0107 wybrane poprawki serwisowe na hostach docelowych przy u\u017cyciu scentralizowanego mened\u017cera instalacji i narz\u0119dzia WebSphere Update Installer. \
Ten pakiet instalacji jest zale\u017cny od pakietu instalacji WebSphere Update Installer. \
Oznacza to, \u017ce pliki binarne dla narz\u0119dzia Update Installer musz\u0105 zosta\u0107 pobrane przed zainstalowaniem jakichkolwiek poprawek z tego pakietu.

xd.61.maintenance.description=Ten pakiet instalacji to stworzony przez u\u017cytkownika pakiet serwisowy dla produktu WebSphere Extended Deployment 6.1. \
W tym pakiecie mo\u017cna umie\u015bci\u0107 wybrane przez u\u017cytkownika poprawki tymczasowe dla wspomnianego produktu, kt\u00f3re zosta\u0142y pobrane z serwisu wsparcia IBM. \
Za pomoc\u0105 tego pakietu mo\u017cna tak\u017ce instalowa\u0107 i deinstalowa\u0107 wybrane poprawki serwisowe na hostach docelowych przy u\u017cyciu scentralizowanego mened\u017cera instalacji i narz\u0119dzia WebSphere Update Installer. \
Ten pakiet instalacji jest zale\u017cny od pakietu instalacji WebSphere Update Installer. \
Oznacza to, \u017ce pliki binarne dla narz\u0119dzia Update Installer musz\u0105 zosta\u0107 pobrane przed zainstalowaniem jakichkolwiek poprawek z tego pakietu.

wasce.description=WebSphere Application Server Community Edition to bezp\u0142atny, uproszczony serwer aplikacji dla \u015brodowiska Java 2 Platform, Enterprise Edition (J2EE), kt\u00f3ry zosta\u0142 stworzony na podstawie technologii Apache Geronimo. \
Produkt ten korzysta z najnowszych innowacji wsp\u00f3lnoty Open Source w celu zapewnienia zintegrowanej, \u0142atwo dost\u0119pnej i elastycznej podstawy do projektowania i wdra\u017cania aplikacji Java.
wasce.feature.longname.ServerOnly=Tylko serwer
wasce.feature.description.ServerOnly=Ten sk\u0142adnik obejmuje tylko serwer.
wasce.feature.longname.ServerAndSDK=Serwer i pakiet tworzenia oprogramowania IBM (SDK)
wasce.feature.description.ServerAndSDK=Ten sk\u0142adnik obejmuje serwer i pakiet tworzenia oprogramowania IBM dla pobranych platform.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Okre\u015bl katalog instalacyjny dla obs\u0142ugiwanego \u015brodowiska Java na ho\u015bcie docelowym. \
Je\u015bli nie zostanie okre\u015blona \u015bcie\u017cka do katalogu instalacyjnego, program instalacyjny produktu WebSphere Application Server Community Edition wykona pr\u00f3b\u0119 znalezienia tej \u015bcie\u017cki. \
Instalacja produktu WebSphere Application Server Community Edition si\u0119 jednak nie powiedzie, je\u015bli program instalacyjny nie znajdzie obs\u0142ugiwanego \u015brodowiska Java.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=Poni\u017csza tabela zawiera po\u0142o\u017cenie instalacji dla pakietu IBM Software Developer Kit (SDK), Java 2 Technology Edition.   

wasce.sdk.default.install.loc.aix=Jest to domy\u015blne po\u0142o\u017cenie instalacji. Nie mo\u017cna modyfikowa\u0107 tego po\u0142o\u017cenia.
wasce.sdk.default.install.loc.linux=Rzeczywiste po\u0142o\u017cenie jest zale\u017cne od u\u017cytego pakietu SDK. Po\u0142o\u017cenie jest wst\u0119pnie zdefiniowane i nie mo\u017cna go modyfikowa\u0107.
wasce.sdk.default.install.loc.solaris=Po\u0142o\u017cenie instalacji jest wzgl\u0119dne wobec po\u0142o\u017cenia instalacji produktu WebSphere Application Server Community Edition. Po\u0142o\u017cenie jest wst\u0119pnie zdefiniowane i nie mo\u017cna go modyfikowa\u0107.
wasce.sdk.default.install.loc.windows=Jest to domy\u015blne po\u0142o\u017cenie instalacji. Nie mo\u017cna modyfikowa\u0107 tego po\u0142o\u017cenia.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Pakietu tworzenia oprogramowania IBM (SDK) dla systemu Windows nie mo\u017cna zdeinstalowa\u0107 przy u\u017cyciu scentralizowanego mened\u017cera instalacji. \
Aby p\u00f3\u017aniej zdeinstalowa\u0107 produkt WebSphere Application Server Community Edition i pakiet IBM SDK dla systemu Windows przy u\u017cyciu scentralizowanego mened\u017cera instalacji, nale\u017cy r\u0119cznie odinstalowa\u0107 pakiet SDK z hosta docelowego za pomoc\u0105 funkcji panelu sterowania Dodaj lub usu\u0144 programy w systemie Windows.

wasce.sdk.uninstall.summary.win=Pakietu tworzenia oprogramowania IBM (SDK) dla systemu Windows nie mo\u017cna zdeinstalowa\u0107 przy u\u017cyciu scentralizowanego mened\u017cera instalacji. \
Pakiet IBM SDK dla systemu Windows pozostanie zainstalowany po zako\u0144czeniu dzia\u0142ania przez proces deinstalacji. \
Nale\u017cy r\u0119cznie odinstalowa\u0107 pakiet SDK z hosta docelowego za pomoc\u0105 funkcji panelu sterowania Dodaj lub usu\u0144 programy w systemie Windows.

wasce.uninstall.summary.all=Przed zdeinstalowaniem serwer\u00f3w nale\u017cy zatrzyma\u0107 wszystkie serwery WebSphere Application Server Community Edition, kt\u00f3re dzia\u0142aj\u0105 na hostach docelowych. \
Je\u015bli serwery ci\u0105gle dzia\u0142aj\u0105, nale\u017cy je zatrzyma\u0107 przed wprowadzeniem \u017c\u0105dania deinstalacji.


was.maintenance.update.warning.all=Przed uruchomieniem narz\u0119dzia \
instalatora aktualizacji produktu WebSphere w celu zainstalowania lub \
zdeinstalowania pakietu serwisowego na wybranych serwerach docelowych mened\u017cer scentralizowanej instalacji wywo\u0142uje agenty w\u0119z\u0142\u00f3w na hostach docelowych, aby \
zatrzyma\u0107 wszystkie dzia\u0142aj\u0105ce tam procesy. \
Je\u015bli agenty w\u0119z\u0142\u00f3w nie dzia\u0142aj\u0105 na ho\u015bcie docelowym, przed kontynuowaniem \
nale\u017cy upewni\u0107 si\u0119, \u017ce wszystkie procesy serwera na wybranych serwerach \
docelowych zosta\u0142y zatrzymane. \
Po pomy\u015blnym zako\u0144czeniu aktualizacji pakietu serwisowego na wybranym \
serwerze docelowym mened\u017cer scentralizowanej instalacji automatycznie \
zrestartuje agent w\u0119z\u0142a na ho\u015bcie docelowym.



