# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=WebSphere Extended Deployment Operations Optimization erweitert WebSphere Application Server Network Deployment Version 6.1 und stellt Erweiterungen f\u00fcr dynamische Operationen und erweiterte Verwaltbarkeit bereit. \
Das Feature enth\u00e4lt Operationsunterst\u00fctzung f\u00fcr PHP-, Compute-Grid- und Hochleistungsanwendungen.

xd.61.xdagent.description=Dieses optionale Feature von WebSphere Extended Deployment wird zur Unterst\u00fctzung einer heterogene Serverumgebung (einschlie\u00dflich ferner \u00dcberwachung) auf fernen Workstations installiert, auf denen WebSphere Application Server nicht installiert ist.

xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid erweitert WebSphere Application Server Network Deployment Version 6.1 und stellt die Unterst\u00fctzung f\u00fcr die Ausf\u00fchrung von Compute-Grid-Jobs (transaktionsorientierten Batch-Jobs, rechenintensiven Jobs und nativen Jobs) bereit.\
Au\u00dferdem stellt dieses Feature einen Scheduler und Jobverwaltungsfunktionen f\u00fcr die Steuerung dieser Jobs bereit.

xd.61.data.grid.description=WebSphere Extended Deployment Data Grid erweitert WebSphere Application Server Network Deployment Version 6.1 und stellt die Unterst\u00fctzung f\u00fcr Hochleistungsanwendungen bereit.\
Dieses Feature enth\u00e4lt ObjectGrid und die Partitionierungsfunktion.

updi.61.description=Update Installer installiert Aktualisierungen, wie z. B. vorl\u00e4ufige Fixes, Fixpacks und Refresh-Packs f\u00fcr IBM WebSphere-Software. \
Dieser Update Installer ist f\u00fcr Releases von WebSphere Application Server Version 6.1 bestimmt.

nd.61.fixpack.description=In dieses Installationspaket k\u00f6nnen die Dateien gepackt werden, die erforderlich sind, um Installationen von WebSphere Application Server Network Deployment Version 6.1 auf den angegebenen Fixpack-Stand zu aktualisieren. \
Nach dem Herunterladen der Dateien f\u00fcr die erforderlichen Plattformen kann ein Administrator das Paket unter Verwendung von Centralized Installation Manager und des WebSphere-Programms Update Installer f\u00fcr die Installation auf geeigneten Hosts verwenden. \
Dieses Installationspaket ist vom Paket des WebSphere-Programms Update Installer abh\u00e4ngig. \
Deshalb m\u00fcssen die Bin\u00e4rdateien f\u00fcr Update Installer heruntergeladen werden, bevor dieses Installationspaket f\u00fcr die Aktualisierung von Zielhosts verwendet wird.

xd.61.fixpack.description=In dieses Installationspaket k\u00f6nnen die Dateien gepackt werden, die erforderlich sind, um Installationen von WebSphere Extended Deployment Version 6.1 auf den angegebenen Fixpack-Stand zu aktualisieren. \
Nach dem Herunterladen der Dateien f\u00fcr die erforderlichen Plattformen kann ein Administrator das Paket unter Verwendung von Centralized Installation Manager und des WebSphere-Programms Update Installer f\u00fcr die Installation auf geeigneten Hosts verwenden. \
Dieses Installationspaket ist vom Paket des WebSphere-Programms Update Installer abh\u00e4ngig. \
Deshalb m\u00fcssen die Bin\u00e4rdateien f\u00fcr Update Installer heruntergeladen werden, bevor dieses Installationspaket f\u00fcr die Aktualisierung von Zielhosts verwendet wird.

nd.61.maintenance.description=Dieses Installationspaket ist ein vom Benutzer assembliertes Wartungspaket f\u00fcr WebSphere Application Server Network Deployment Version 6.1. \
In dieses Paket k\u00f6nnen vom Benutzer ausgew\u00e4hlte vorl\u00e4ufige Fixes f\u00fcr das genannte Produkt, die von der IBM Unterst\u00fctzungswebsite heruntergeladen werden, gepackt werden. \
Au\u00dferdem kann dieses Paket unter Verwendung von Centralized Installation Manager und des WebSphere-Programms Update Installer f\u00fcr die Installation und Deinstallation ausgew\u00e4hlter Wartungspakete verwendet werden. \
Dieses Installationspaket ist vom Installationspaket des WebSphere-Programms Update Installer abh\u00e4ngig. \
Deshalb m\u00fcssen die Bin\u00e4rdateien f\u00fcr Update Installer heruntergeladen werden, bevor Fixes aus diesem Paket installiert werden.

xd.61.maintenance.description=Dieses Installationspaket ist ein vom Benutzer assembliertes Wartungspaket f\u00fcr WebSphere Extended Deployment Version 6.1. \
In dieses Paket k\u00f6nnen vom Benutzer ausgew\u00e4hlte vorl\u00e4ufige Fixes f\u00fcr das genannte Produkt, die von der IBM Unterst\u00fctzungssite heruntergeladen werden, gepackt werden. \
Au\u00dferdem kann dieses Paket unter Verwendung von Centralized Installation Manager und des WebSphere-Programms Update Installer f\u00fcr die Installation und Deinstallation ausgew\u00e4hlter Wartungspakete verwendet werden. \
Dieses Installationspaket ist vom Installationspaket des WebSphere-Programms Update Installer abh\u00e4ngig. \
Deshalb m\u00fcssen die Bin\u00e4rdateien f\u00fcr Update Installer heruntergeladen werden, bevor Fixes aus diesem Paket installiert werden.

wasce.description=WebSphere Application Server Community Edition ist ein kostenloser, schlanker J2EE-Anwendungsserver (Java 2 Platform, Enterprise Edition), der auf der Technologie Apache Geronimo basiert. \
Das Produkt nutzt die aktuellen Innovationen aus der Open-Source-Community und ist eine integrierte, leicht zug\u00e4ngliche und flexible Grundlage f\u00fcr die Entwicklung und Implementierung von Java-Anwendungen.
wasce.feature.longname.ServerOnly=Nur Server
wasce.feature.description.ServerOnly=Dieses Feature enth\u00e4lt nur den Server.
wasce.feature.longname.ServerAndSDK=Server und IBM Software Developer Kit (SDK)
wasce.feature.description.ServerAndSDK=Dieses Feature enth\u00e4lt den Server und IBM Software Developer Kit f\u00fcr die heruntergeladenen Plattformen.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Geben Sie das Installationsverzeichnis f\u00fcr eine unterst\u00fctzte Java-Umgebung auf dem Zielhost an.\
Wenn Sie den Installationsverzeichnispfad nicht angeben, versucht das Installationsprogramm von WebSphere Application Server Community Edition, einen Pfad zu finden. \
Die Installation von WebSphere Application Server Community Edition schl\u00e4gt jedoch fehl, wenn das Installationsprogramm keine unterst\u00fctzte Java-Umgebung findet.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=In der folgenden Tabelle wird die Installationsposition f\u00fcr IBM Software Developer Kit (SDK), Java 2 Technology Edition angezeigt. 

wasce.sdk.default.install.loc.aix=Dies ist die Standardinstallationsposition. Diese Position kann nicht ge\u00e4ndert werden.
wasce.sdk.default.install.loc.linux=Die tats\u00e4chliche Position richtet sich nach dem jeweiligen SDK-Paket, das verwendet wird. Die Position ist vordefiniert und kann nicht ge\u00e4ndert werden.
wasce.sdk.default.install.loc.solaris=Die Installationsposition ist relativ zur Installationsposition f\u00fcr WebSphere Application Server Community Edition. Die Position ist vordefiniert und kann nicht ge\u00e4ndert werden.
wasce.sdk.default.install.loc.windows=Dies ist die Standardinstallationsposition. Diese Position kann nicht ge\u00e4ndert werden.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Beachten Sie, dass IBM Software Developer Kit (SDK) for Windows nicht \u00fcber Centralized Installation Manager deinstalliert werden kann.\
Wenn Sie WebSphere Application Server Community Edition und IBM SDK for Windows sp\u00e4ter mit Centralized Installation Manager deinstallieren m\u00f6chten, m\u00fcssen Sie das SDK manuell mit der Funktion "Programme \u00e4ndern/entfernen" in der Windows-Systemsteuerung vom Zielhost entfernen.

wasce.sdk.uninstall.summary.win=Beachten Sie, dass IBM Software Developer Kit (SDK) for Windows nicht \u00fcber Centralized Installation Manager deinstalliert werden kann.\
IBM SDK for Windows bleibt auch nach Abschluss des Deinstallationsprozesses installiert.\
Sie m\u00fcssen das SDK \u00fcber die Funktion "Programme \u00e4ndern/entfernen" in der Windows-Systemsteuerung manuell vom Zielhost deinstallieren.

wasce.uninstall.summary.all=Sie m\u00fcssen alle Server von WebSphere Application Server Community Edition, die auf den Zielhosts ausgef\u00fchrt werden, vor dem Deinstallieren der Server stoppen. \
Stoppen Sie die Server, wenn sie noch aktiv sind, bevor Sie die Deinstallationsanforderung \u00fcbergeben.


was.maintenance.update.warning.all=Vor der Ausf\u00fchrung des Tools WebSphere Update Installer f\u00fcr die Installation bzw. Deinstallation von Wartungspaketen in den ausgew\u00e4hlten Zielen weist Centralized Installation Manager die Node Agents auf den Zielhosts an, alle aktiven Serverprozesse in den Zielen zu stoppen.\
Wenn die Node Agents auf dem Zielhost nicht aktiv sind, m\u00fcssen Sie sicherstellen, dass alle Serverprozesse in den ausgew\u00e4hlten Zielen gestoppt sind, bevor die Operation fortgesetzt wird.\
Nach erfolgreichem Abschluss der Wartungsaktualisierung im ausgew\u00e4hlten Ziel startet Centralized Installation Manager den Node Agent auf dem Zielhost automatisch erneut.



