# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=WebSphere Extended Deployment Operations Optimization \u00e9tend WebSphere Application Server Network Deployment Version 6.1 en am\u00e9liorant les op\u00e9rations dynamiques et la gestion. \
Cette fonction inclut la prise en charge des op\u00e9rations pour PHP, Compute Grid, ainsi que des applications hautes performances.

xd.61.xdagent.description=Il s'agit d'une fonction facultative de WebSphere Extended Deployment install\u00e9e sur des machines distantes sur lesquelles WebSphere Application Server ne se trouve pas, qui permet la prise en charge d'un environnement de serveur mixte, ainsi qu'un agent de contr\u00f4le distant.

xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid am\u00e9liore WebSphere Application Server Network Deployment Version 6.1, avec la prise en charge de l'ex\u00e9cution de travaux Compute Grid (travaux transactionnels par lots, calculs et travaux natifs). \
Cette application comprend \u00e9galement un planificateur ainsi que des fonctions de gestion des travaux permettant de contr\u00f4ler ces travaux.

xd.61.data.grid.description=WebSphere Extended Deployment Data Grid am\u00e9liore WebSphere Application Server Network Deployment Version 6.1, avec la prise en charge d'applications hautes performances. \
Cette fonction inclut l'\u00e9l\u00e9ment ObjectGrid et l'outil de partitionnement.

updi.61.description=L'utilitaire d'installation des mises \u00e0 jour installe les mises \u00e0 jour, telles que les correctifs temporaires, les groupes de correctifs et les groupes de mises \u00e0 jour pour IBM WebSphere. \
Cet utilitaire est destin\u00e9 aux \u00e9ditions de WebSphere Application Server V6.1.

nd.61.fixpack.description=Ce package d'installation peut contenir les fichiers n\u00e9cessaires \u00e0 la mise \u00e0 jour des installations de WebSphere Application Server Network Deployment Version 6.1 vers le niveau de groupe de correctifs indiqu\u00e9. \
Une fois les fichiers destin\u00e9s aux plate-formes requises t\u00e9l\u00e9charg\u00e9s, un administrateur peut utiliser le package pour installer les fichiers sur les h\u00f4tes correspondants \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e et de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
Ce package d'installation d\u00e9pend du package de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
A ce titre, les fichiers binaires de l'utilitaire d'installation de mises \u00e0 jour doivent \u00eatre t\u00e9l\u00e9charg\u00e9s avant d'utiliser ce package d'installation pour la mise \u00e0 jour des h\u00f4tes cible.

xd.61.fixpack.description=Ce package d'installation peut contenir les fichiers n\u00e9cessaires \u00e0 la mise \u00e0 jour des installations de WebSphere Extended Deployment Version 6.1 vers le niveau de groupe de correctifs indiqu\u00e9. \
Une fois les fichiers destin\u00e9s aux plate-formes requises t\u00e9l\u00e9charg\u00e9s, un administrateur peut utiliser le package pour installer les fichiers sur les h\u00f4tes correspondants \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e et de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
Ce package d'installation d\u00e9pend du package de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
A ce titre, les fichiers binaires de l'utilitaire d'installation de mises \u00e0 jour doivent \u00eatre t\u00e9l\u00e9charg\u00e9s avant d'utiliser ce package d'installation pour la mise \u00e0 jour des h\u00f4tes cible.

nd.61.maintenance.description=Ce package d'installation est un kit de maintenance assembl\u00e9 par l'utilisateur pour WebSphere Application Server Network Deployment Version 6.1. \
Il peut \u00eatre utilis\u00e9 pour contenir les correctifs temporaires s\u00e9lectionn\u00e9s par l'utilisateur pour le produit en question et qui sont t\u00e9l\u00e9charg\u00e9s sur le site Web de Support technique IBM. \
Ce package peut \u00e9galement \u00eatre utilis\u00e9 pour installer ou d\u00e9sinstaller la maintenance s\u00e9lectionn\u00e9e \u00e0 partir des h\u00f4tes cible \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e et de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
Ce package d'installation d\u00e9pend du package d'installation de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
A ce titre, les fichiers binaires de l'utilitaire d'installation de mises \u00e0 jour doivent \u00eatre t\u00e9l\u00e9charg\u00e9s avant d'installer l'un des correctifs de ce package.

xd.61.maintenance.description=Ce package d'installation est un kit de maintenance assembl\u00e9 par l'utilisateur pour WebSphere Extended Deployment Version 6.1. \
Il peut \u00eatre utilis\u00e9 pour contenir les correctifs temporaires s\u00e9lectionn\u00e9s par l'utilisateur pour le produit en question et qui sont t\u00e9l\u00e9charg\u00e9s sur le site de Support technique IBM. \
Ce package peut \u00e9galement \u00eatre utilis\u00e9 pour installer ou d\u00e9sinstaller la maintenance s\u00e9lectionn\u00e9e \u00e0 partir des h\u00f4tes cible \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e et de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
Ce package d'installation d\u00e9pend du package d'installation de l'utilitaire d'installation de mises \u00e0 jour de WebSphere. \
A ce titre, les fichiers binaires de l'utilitaire d'installation de mises \u00e0 jour doivent \u00eatre t\u00e9l\u00e9charg\u00e9s avant d'installer l'un des correctifs de ce package.

wasce.description=WebSphere Application Server Community Edition est un serveur d'applications J2EE (Java 2 Platform Enterprise Edition) simple, bas\u00e9 sur la technologie Apache Geronimo. \
Il exploite les innovations les plus r\u00e9centes de la communaut\u00e9 Open Source pour fournir une base int\u00e9gr\u00e9e, facilement accessible et flexible pour le d\u00e9veloppement et le d\u00e9ploiement d'applications Java.
wasce.feature.longname.ServerOnly=Serveur uniquement
wasce.feature.description.ServerOnly=Cette fonction inclut le serveur uniquement.
wasce.feature.longname.ServerAndSDK=Serveur et IBM Software Developer Kit (SDK)
wasce.feature.description.ServerAndSDK=Cette fonction inclut le serveur et l'IBM Software Developer Kit pour les plateformes que vous avez t\u00e9l\u00e9charg\u00e9es.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Indiquez le r\u00e9pertoire d'installation pour un environnement Java pris en charge sur l'h\u00f4te cible. \
Si vous ne renseignez pas le chemin d'acc\u00e8s au r\u00e9pertoire d'installation, le programme d'installation de WebSphere Application Server Community Edition tentera d'en trouver un. \
Cependant, l'installation de WebSphere Application Server Community Edition \u00e9chouera si aucun environnement Java pris en charge ne peut \u00eatre localis\u00e9 par le programme d'installation.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=Le tableau suivant montre l'emplacement d'installation pour l'IBM Software Developer Kit (SDK), Java 2 Technology Edition.   

wasce.sdk.default.install.loc.aix=Il s'agit de l'emplacement d'installation par d\u00e9faut. Cet emplacement ne peut pas \u00eatre modifi\u00e9.
wasce.sdk.default.install.loc.linux=L'emplacement r\u00e9el d\u00e9pend du groupe particulier de SDK utilis\u00e9. L'emplacement est pr\u00e9d\u00e9fini et ne peut pas \u00eatre modifi\u00e9.
wasce.sdk.default.install.loc.solaris=L'emplacement d'installation est relatif \u00e0 celui de WebSphere Application Server Community Edition. L'emplacement est pr\u00e9d\u00e9fini et ne peut pas \u00eatre modifi\u00e9.
wasce.sdk.default.install.loc.windows=Il s'agit de l'emplacement d'installation par d\u00e9faut. Cet emplacement ne peut pas \u00eatre modifi\u00e9.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Notez qu'IBM Software Developer Kit (SDK) pour Windows ne peut pas \u00eatre d\u00e9sinstall\u00e9 \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e. \
Pour d\u00e9sinstaller WebSphere Application Server Community Edition et l'IBM SDK pour Windows ult\u00e9rieurement \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e, vous devez d\u00e9sinstaller le SDK manuellement de l'h\u00f4te cible \u00e0 l'aide de la fonction Ajout/Suppression de programmes du Panneau de configuration Windows.

wasce.sdk.uninstall.summary.win=Notez qu'IBM Software Developer Kit (SDK) pour Windows ne peut pas \u00eatre d\u00e9sinstall\u00e9 \u00e0 l'aide du gestionnaire d'installation centralis\u00e9e. \
IBM SDK pour Windows restera install\u00e9 une fois le processus de d\u00e9sinstallation termin\u00e9. \
Vous devez d\u00e9sinstaller le SDK manuellement de l'h\u00f4te cible \u00e0 l'aide de la fonction Ajout/Suppression de programmes du Panneau de configuration Windows.

wasce.uninstall.summary.all=Vous devez arr\u00eater tous les serveurs WebSphere Application Server Community Edition s'ex\u00e9cutant sur les h\u00f4tes cibles avant de d\u00e9sinstaller les serveurs. \
Si les serveurs sont toujours en cours d'ex\u00e9cution, arr\u00eatez-les avant de soumettre la demande de d\u00e9sinstallation.


was.maintenance.update.warning.all=Aant d'ex\u00e9cuter WebSphere Update Installer pour installer ou d\u00e9sinstaller de la maintenance sur les cibles s\u00e9lectionn\u00e9es, le gestionnaire d'installation centralis\u00e9e contacte tous les agents de noeuds sur les h\u00f4tes cibles pour arr\u00eater tous les processus serveurs en cours d'ex\u00e9cution sur les cibles. \
Si les agents de noeuds ne sont pas en cours d'ex\u00e9cution sur l'h\u00f4te cible, avant de continuer, vous devez vous assurer que la totalit\u00e9 des processus serveurs ont bien \u00e9t\u00e9 arr\u00eat\u00e9s sur les cibles s\u00e9lectionn\u00e9es. \
Une fois que la mise \u00e0 jour de maintenance aura \u00e9t\u00e9 install\u00e9e de mani\u00e8re satisfaisante, le gestionnaire d'installation centralis\u00e9e red\u00e9marrera automatiquement l'agent de noeud sur l'h\u00f4te cible.



