# COPYRIGHT_START***********************************************************
#
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 2007, 2008
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#NLS_ENCODING=UNICODE
#
xd.61.operations.optimizer.description=WebSphere Extended Deployment Operations Optimization ampl\u00eda WebSphere Application Server Network Deployment Versi\u00f3n 6.1, proporcionando mejoras en las operaciones din\u00e1micas y ampliando las posibilidades de gesti\u00f3n. \
Incluye soporte de operaciones para PHP, Compute Grid y aplicaciones de alto rendimiento.

xd.61.xdagent.description=Se trata de una caracter\u00edstica opcional de WebSphere Extended Deployment que se instala en estaciones de trabajo remotas en las que WebSphere Application Server no est\u00e1 instalado para proporcionar soporte para un entorno mixto de servidores y que incluye el agente de supervisi\u00f3n remota.

xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid ampl\u00eda WebSphere Application Server Network Deployment Versi\u00f3n 6.1, proporcionando soporte para ejecutar trabajos de Compute Grid (trabajos por lotes transaccionales, trabajos de c\u00e1lculo intensivo y trabajos nativos). \
Tambi\u00e9n incluye un planificador y funciones de gesti\u00f3n de trabajo para controlar los trabajos.

xd.61.data.grid.description=WebSphere Extended Deployment Data Grid ampl\u00eda WebSphere Application Server Network Deployment Versi\u00f3n 6.1, proporcionando soporte para aplicaciones de alto rendimiento. \
Incluye ObjectGrid y el recurso de particionamiento.

updi.61.description=Update Installer instala actualizaciones, como arreglos temporales, fixpacks y paquetes de renovaci\u00f3n, para el software IBM WebSphere. \
Update Installer es para los releases de WebSphere Application Server V6.1.

nd.61.fixpack.description=Este paquete de instalaci\u00f3n se puede utilizar para que contenga los archivos necesarios para actualizar las instalaciones de WebSphere Application Server Network Deployment Versi\u00f3n 6.1 a un nivel de fixpack concreto. \
Despu\u00e9s de descargar los archivos para las plataformas que se precisen, un administrador puede utilizar el paquete para instalarlo en los hosts que corresponda mediante el gestor de instalaci\u00f3n centralizada y WebSphere Update Installer. \
Este paquete de instalaci\u00f3n depende del paquete de WebSphere Update Installer. \
Por ello, hay que descargar los binarios para Update Installer antes de utilizar este paquete de instalaci\u00f3n para actualizar hosts de destino.

xd.61.fixpack.description=Este paquete de instalaci\u00f3n se puede utilizar para que contenga los archivos necesarios para actualizar las instalaciones de WebSphere Extended Deployment Versi\u00f3n 6.1 a un nivel de fixpack concreto. \
Despu\u00e9s de descargar los archivos para las plataformas que se precisen, un administrador puede utilizar el paquete para instalarlo en los hosts que corresponda mediante el gestor de instalaci\u00f3n centralizada y WebSphere Update Installer. \
Este paquete de instalaci\u00f3n depende del paquete de WebSphere Update Installer. \
Por ello, hay que descargar los binarios para Update Installer antes de utilizar este paquete de instalaci\u00f3n para actualizar hosts de destino.

nd.61.maintenance.description=Este paquete de instalaci\u00f3n es un paquete ensamblado por el usuario para mantener WebSphere Application Server Network Deployment Versi\u00f3n 6.1. \
Este paquete se puede utilizar para que contenga arreglos temporales seleccionados por el usuario para el producto que se ha descargado desde el sitio web de soporte de IBM. \
Este paquete tambi\u00e9n se puede utilizar para instalar o desinstalar mantenimiento seleccionado de hosts de destino con el gestor de instalaci\u00f3n centralizada y WebSphere Update Installer. \
Este paquete de instalaci\u00f3n depende del paquete de instalaci\u00f3n WebSphere Update Installer. \
Por ello, hay que descargar los binarios para Update Installer antes de instalar cualquiera de los arreglos de este paquete.

xd.61.maintenance.description=Este paquete de instalaci\u00f3n es un paquete ensamblado por el usuario para mantener WebSphere Extended Deployment Versi\u00f3n 6.1. \
Este paquete se puede utilizar para mantener arreglos temporales seleccionados por el usuario para el producto que se ha descargado desde el sitio de soporte de IBM. \
Este paquete tambi\u00e9n se puede utilizar para instalar o desinstalar mantenimiento seleccionado de hosts de destino con el gestor de instalaci\u00f3n centralizada y WebSphere Update Installer. \
Este paquete de instalaci\u00f3n depende del paquete de instalaci\u00f3n WebSphere Update Installer. \
Por ello, hay que descargar los binarios para Update Installer antes de instalar cualquiera de los arreglos de este paquete.

wasce.description=WebSphere Application Server Community Edition es un servidor de aplicaciones gratuito y ligero de Java 2 Platform Enterprise Edition (J2EE) que se basa en la tecnolog\u00eda de Apache Geronimo. \
Utiliza las \u00faltimas innovaciones de la comunidad de c\u00f3digo abierto para ofrecer una base flexible, accesible con rapidez e integrada para desarrollar y desplegar aplicaciones Java.
wasce.feature.longname.ServerOnly=S\u00f3lo servidor
wasce.feature.description.ServerOnly=Esta caracter\u00edstica incluye \u00fanicamente el servidor.
wasce.feature.longname.ServerAndSDK=Servidor e IBM SDK (Software Developer Kit)
wasce.feature.description.ServerAndSDK=Esta caracter\u00edstica incluye el servidor e IBM SKD (Software Developer Kit) de las plataformas que se hayan descargado.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Especifique el directorio de instalaci\u00f3n para el entorno Java soportado en el host de destino. \
Si no se especifica la v\u00eda de acceso al directorio de instalaci\u00f3n, el programa de instalaci\u00f3n de WebSphere Application Server Community Edition intentar\u00e1 encontrar una. \
Sin embargo, no se podr\u00e1 instalar WebSphere Application Server Community Edition si el programa de instalaci\u00f3n no puede encontrar el entorno soportado de Java.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=La siguiente tabla muestra la ubicaci\u00f3n de instalaci\u00f3n para IBM Software Developer Kit (SDK), Java 2 Technology Edition.   

wasce.sdk.default.install.loc.aix=Esta es la ubicaci\u00f3n de instalaci\u00f3n por omisi\u00f3n. Esta ubicaci\u00f3n no se puede modificar.
wasce.sdk.default.install.loc.linux=La ubicaci\u00f3n concreta depende del paquete de SDK que se utiliza. La ubicaci\u00f3n est\u00e1 definida con anterioridad y no se puede modificar.
wasce.sdk.default.install.loc.solaris=La ubicaci\u00f3n de instalaci\u00f3n es relativa a la ubicaci\u00f3n de instalaci\u00f3n de WebSphere Application Server Community Edition. La ubicaci\u00f3n est\u00e1 definida con anterioridad y no se puede modificar.
wasce.sdk.default.install.loc.windows=Esta es la ubicaci\u00f3n de instalaci\u00f3n por omisi\u00f3n. Esta ubicaci\u00f3n no se puede modificar.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Tenga en cuenta que IBM SDK (Software Developer Kit) para Windows no se puede desinstalar con el gestor de instalaci\u00f3n centralizada. \
Si desea desinstalar WebSpehere Application Server Community Edition e IBM SDK para Windows m\u00e1s tarde mediante el gestor de instalaci\u00f3n centralizada, hay que desinstalar SDK de forma manual del host de destino utilizando la funci\u00f3n del panel de control de Agregar o quitar programas de Windows.

wasce.sdk.uninstall.summary.win=Tenga en cuenta que IBM SDK (Software Developer Kit) para Windows no se puede desinstalar con el gestor de instalaci\u00f3n centralizada. \
IBM SDK para Windows permanecer\u00e1 instalado despu\u00e9s que se complete este proceso de desinstalaci\u00f3n. \
Hay que desinstalar SDK de forma manual del host de destino utilizando la funci\u00f3n del panel de control de Agregar o quitar programas de Windows.

wasce.uninstall.summary.all=Es necesario detener todos los servidores de WebSphere Application Server Community Edition en ejecuci\u00f3n en los hosts de destino antes de desinstalar los servidores. \
Detenga a los servidores si todav\u00eda est\u00e1n en ejecuci\u00f3n antes de someter la petici\u00f3n de desinstalaci\u00f3n.


was.maintenance.update.warning.all=Antes de ejecutar la herramienta WebSphere Update Installer para instalar o desinstalar mantenimiento en destinos seleccionados, el gestor de instalaci\u00f3n centralizado invoca los agentes de nodo en los host de destino para detener todos los procesos de servidor en ejecuci\u00f3n en los destinos. \
Si los agentes de nodo no est\u00e1n en ejecuci\u00f3n en el host de destino, antes de continuar, debe asegurarse de que todos los procesos de servidor en los destinos seleccionados se detienen. \
Una vez terminada correctamente la actualizaci\u00f3n de mantenimiento en el destino seleccionado, el gestor centralizado de instalaci\u00f3n reiniciar\u00e1 autom\u00e1ticamente el agente de nodo en el host de destino.



