<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: A(z) {0} elem felold&#225;sa megosztott tartalom &#233;rv&#233;nytelen f&#252;gg&#337;s&#233;geit jelzi az alkalmaz&#225;startalomban: {1}
  </MsgText>
  <Explanation>
    Az alkalmaz&#225;scsomagok nem ny&#250;jthatnak csomagokat vagy szolg&#225;ltat&#225;sokat megosztott csomagoknak. Ezenk&#237;v&#252;l a csomagokat nem szabad megosztott vagy alkalmaz&#225;scsomagk&#233;nt telep&#237;teni. Minden alkalmaz&#225;scsomagt&#243;l f&#252;gg&#337; megosztott csomagokat ig&#233;nyl&#337; telep&#237;t&#233;s &#233;rv&#233;nytelen.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;snak sz&#252;ks&#233;ge van-e az &#246;sszes &#233;rv&#233;nytelen megosztott csomagra. Ha igen, &#252;gyeljen r&#225;, hogy azok ne f&#252;ggjek az alkalmaz&#225;startalomt&#243;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: A rendszer nem tudja olvasni a(z) {0} JAR f&#225;jlhoz tartoz&#243; csomagle&#237;r&#243;t a(z) {1} EBA f&#225;jlban.
  </MsgText>
  <Explanation>
    IOException t&#246;rt&#233;nt, mik&#246;zben a rendszer egy v&#225;llalati bundle-arch&#237;vumban (EBA) l&#233;v&#337; JAR f&#225;jl le&#237;r&#243;j&#225;t kereste. A f&#225;jl esetleg s&#233;r&#252;lt vagy nem olvashat&#243;.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a f&#225;jl a megfelel&#337; enged&#233;lyekkel rendelkezik-e, &#233;s hogy a megfelel&#337; form&#225;tumban van!
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} telep&#237;t&#337; szolg&#225;ltat&#225;s nem el&#233;rhet&#337;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: A(z) {1} &#252;zleti szint&#369; alkalmaz&#225;sban tal&#225;lhat&#243; {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gbe telep&#237;tett OSGi alkalmaz&#225;s ind&#237;t&#225;sa meghi&#250;sult.
  </MsgText>
  <Explanation>
    Kiv&#233;tel t&#246;rt&#233;nt az ind&#237;t&#225;si m&#369;velet sor&#225;n.
  </Explanation>
  <UserResponse>
    Vizsg&#225;lja meg a kiv&#233;telt megel&#337;z&#337; kiszolg&#225;l&#243;napl&#243;kat a probl&#233;ma r&#233;szletesebb diagnosztiz&#225;l&#225;sa c&#233;lj&#225;b&#243;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: A(z) {1} v&#225;llalati csomagarch&#237;vum (EBA) f&#225;jl a(z) {0} k&#246;nyvt&#225;rat tartalmazza, ami nem t&#225;mogatott.
  </MsgText>
  <Explanation>
    A megadott EBA f&#225;jl egy byValue vagy byReference elnevez&#233;s&#369; k&#246;nyvt&#225;rat tartalmaz. Ezeknek a k&#246;nyvt&#225;rneveknek az egyike sem t&#225;mogatott az EBA f&#225;jl gy&#246;k&#233;rk&#246;nyvt&#225;r&#225;ban.
  </Explanation>
  <UserResponse>
    Vagy t&#225;vol&#237;tsa el, vagy nevezze &#225;t az illet&#337; k&#246;nyvt&#225;rat.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: A megadott {0} szerep nem l&#233;tezik.
  </MsgText>
  <Explanation>
    Felhaszn&#225;l&#243;kat vagy csoportokat olyan biztons&#225;gi szerephez k&#237;s&#233;reltek meg hozz&#225;rendelni, amely nem l&#233;tezik.
  </Explanation>
  <UserResponse>
    Gy&#337;z&#337;dj&#246;n meg arr&#243;l, hogy a megadott biztons&#225;gi szerep l&#233;tezik, vagy hozza l&#233;tre a szerepet az alkalmaz&#225;sban!
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: Az import&#225;land&#243; telep&#237;t&#233;sle&#237;r&#243; nem megfelel&#337; a(z) {0} eszk&#246;zh&#246;z, mert nem teljes&#237;ti az alkalmaz&#225;sle&#237;r&#243;ban l&#233;v&#337; k&#246;vetelm&#233;nyeket.
  </MsgText>
  <Explanation>
    A DEPLOYMENT.MF telep&#237;t&#233;si le&#237;r&#243; nem kompatibilis az eszk&#246;z alkalmaz&#225;sle&#237;r&#243;j&#225;val (APPLICATION.MF).
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze az &#250;j telep&#237;t&#233;si le&#237;r&#243; f&#225;jlt a k&#246;vetkez&#337;kkel kapcsolatban:
   1. A DEPLOYMENT.MF &#225;llom&#225;nyban l&#233;v&#337; Application-SymbolicName &#233;s Application-Version bejegyz&#233;seknek meg kell egyezni&#252;k a nekik megfelel&#337;, APPLICATION.MF &#225;llom&#225;nyban l&#233;v&#337; bejegyz&#233;seknek!
 2. A DEPLOYMENT.MF &#225;llom&#225;ny Deployed-Content fejl&#233;c&#233;ben felsorolt bundle elemeknek meg kell egyezni&#252;k az APPLICATION.MF &#225;llom&#225;nyban l&#233;v&#337; Application-Content felsorolt bundle elemekkel.
   3. A DEPLOYMENT.MF &#225;llom&#225;ny Deployed-Content fejl&#233;c&#233;ben l&#233;v&#337; bundle-verzi&#243;nak az APPLICATION.MF &#225;llom&#225;nyban l&#233;v&#337;, ennek megfelel&#337; bundle verzi&#243;tartom&#225;nyban kell lennie. 
   4. A DEPLOYMENT.MF &#225;llom&#225;ny Deployed-Use-Bundle fejl&#233;c&#233;ben felsorolt bundle elemeket fel  kell sorolni az APPLICATION.MF &#225;llom&#225;ny Use-Bundle fejl&#233;c&#233;ben is.
   5. A DEPLOYMENT.MF &#225;llom&#225;ny Deployed-Use-Bundle fejl&#233;c&#233;ben l&#233;v&#337; csomagv&#225;ltozatnak az APPLICATION.MF &#225;llom&#225;ny Use-Bundle fejl&#233;c&#233;ben l&#233;v&#337;, ennek megfelel&#337; csomag v&#225;ltozattartom&#225;ny&#225;ban kell lennie.
 Ne szerkessze a telep&#237;t&#233;sle&#237;r&#243;t manu&#225;lisan. Sz&#252;ks&#233;g eset&#233;n t&#225;vol&#237;tsa el a telep&#237;t&#233;sle&#237;r&#243;t az EBA f&#225;jlb&#243;l. Emiatt a term&#233;k friss telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt fog el&#337;&#225;ll&#237;tani az EBA import&#225;l&#225;sakor.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: A kiv&#225;lasztott csomagv&#225;ltozatok nem oldhat&#243;k fel vagy nem &#246;sszef&#233;r&#337;k.
  </MsgText>
  <Explanation>
    A rendszer nem tudja feloldani a kiv&#225;lasztott bundle verzi&#243;kat. El&#337;fordulhat, hogy a bundle elemnek hi&#225;nyz&#243; f&#252;gg&#337;s&#233;gei vannak, &#246;sszef&#233;rhetetlen, vagy nem l&#233;tezik.
  </Explanation>
  <UserResponse>
    M&#243;dos&#237;tsa a bemeneti bundle elemek k&#233;szlet&#233;t, majd pr&#243;b&#225;lja &#250;jra! Az adminisztr&#225;ci&#243;s kezel&#337;pult haszn&#225;lat&#225;val megjelen&#237;theti az eszk&#246;z &#225;llapot&#225;t vagy annak el&#337;n&#233;zet&#233;t.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: A(z) {0} felhaszn&#225;l&#243; nem egy lek&#233;pezett felhaszn&#225;l&#243;, vagy nem egy lek&#233;pezett csoport tagja a(z) {1} szerephez.
  </MsgText>
  <Explanation>
    B&#225;rmilyen megadott felhaszn&#225;l&#243; vagy nyomon k&#246;vetett kell, hogy legyen a biztons&#225;gi szerepen, vagy egy nyomon k&#246;vetett csoport tagj&#225;nak kell lennie a biztons&#225;gi szerepen. A megadott felhaszn&#225;l&#243; nem felelt meg ezen k&#246;vetelm&#233;nyek egyik&#233;nek sem.
  </Explanation>
  <UserResponse>
    Vagy &#225;ll&#237;tsa be a biztons&#225;gi szerepet felhaszn&#225;l&#243;/csoport lek&#233;pez&#233;sekre, hogy el&#233;rhet&#337;v&#233; tegye az adott szerepet az adott felhaszn&#225;l&#243;nak, vagy v&#225;lasszon ki egy m&#225;sik felhaszn&#225;l&#243;t, aki m&#225;r rendelkezik a sz&#252;ks&#233;ges jogosults&#225;gokkal.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: A(z) {0} alkalmaz&#225;s egy vagy t&#246;bb {1} &#246;sszetett csomagarch&#237;vumot (CBA) tartalmaz az Application-Content fejl&#233;c&#233;ben. Ez nem t&#225;mogatott a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomagj&#225;n.
  </MsgText>
  <Explanation>
    A CBA arch&#237;vumok a 8-as &#233;s k&#233;s&#337;bbi v&#225;ltozat&#250; WebSphere Application Server kiszolg&#225;l&#243;k Application-Content fejl&#233;c&#233;ben t&#225;mogatottak.
  </Explanation>
  <UserResponse>
    Nincs teend&#337;. Ha az alkalmaz&#225;st a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomagj&#225;n kell futtatni, &#237;rja &#225;t az alkalmaz&#225;st &#250;gy, hogy ne legyenek CBA arch&#237;vumok az Application-Content fejl&#233;cben.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: IOException t&#246;rt&#233;nt, mikor a rendszer a(z) {0} v&#225;llalati csomagarch&#237;vum (EBA) alkalmaz&#225;sle&#237;r&#243; f&#225;jlj&#225;t olvasta. El&#337;fordulhat, hogy a f&#225;jl &#233;rv&#233;nytelen, s&#233;r&#252;lt vagy olvashatatlan.
  </MsgText>
  <Explanation>
    IOException t&#246;rt&#233;nt, mik&#246;zben a rendszer v&#225;llalati bundle-arch&#237;vum (EBA) alkalmaz&#225;sle&#237;r&#243; f&#225;jlt olvasott. El&#337;fordulhat, hogy a f&#225;jl &#233;rv&#233;nytelen, s&#233;r&#252;lt vagy olvashatatlan.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;sle&#237;r&#243; f&#225;jl, az APPLICATION.MF, megfelel-e a le&#237;r&#243;f&#225;jlok meghat&#225;roz&#225;s&#225;nak.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Bels&#337; hiba t&#246;rt&#233;nt. A Plugin Config File URI form&#225;tuma nem megfelel&#337; ({0}).
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Bels&#337; hiba t&#246;rt&#233;nt. Helytelen eredm&#233;ny &#233;rkezett vissza a(z) {0} v&#225;llalati bundle-arch&#237;vum (EBA) telep&#237;t&#233;se sor&#225;n, a maxim&#225;lis verzi&#243;nak ({1}) ugyanannyinak kellett volna lennie, mint a minim&#225;lis verzi&#243;nak ({2}).
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: A(z) {0} alkalmaz&#225;s nem telep&#237;thet&#337; a cella minden csom&#243;pontja eset&#233;n. Az alkalmaz&#225;st csak olyan 7-as v&#225;ltozat&#250; csom&#243;ponton lehet telep&#237;teni, amely az OSGi alkalmaz&#225;sok szolg&#225;ltat&#225;scsomagot futtatja. A felold&#225;si hiba a k&#246;vetkez&#337;: {1}.
  </MsgText>
  <Explanation>
    Az import&#225;lt alkalmaz&#225;s sikeresen telep&#237;tve lett a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomaghoz, de nem siker&#252;lt telep&#237;teni a 8-as v&#225;ltozat&#250; WebSphere Application Server kiszolg&#225;l&#243;n.
  </Explanation>
  <UserResponse>
    Nincs teend&#337;. Azonban ez a figyelmeztet&#233;s jelzi, hogy az alkalmaz&#225;s t&#250;ls&#225;gosan szigor&#250;, v&#225;ltozattal kapcsolatos k&#246;vetelm&#233;nyeket tartalmazhat. A felold&#225;si hib&#225;ban tal&#225;lhat&#243; inform&#225;ci&#243;kat haszn&#225;lva m&#243;dos&#237;thatja az alkalmaz&#225;st &#250;gy, hogy az telep&#237;thet&#337; legyen a 8-es v&#225;ltozat&#250; csom&#243;pontokon.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: Nem lehet l&#233;trehozni egy f&#252;rttagot a(z) {0} csom&#243;ponton, mert a(z) {1} OSGi alkalmaz&#225;s(ok) &quot;Futtat&#225;s mint&quot; szerep(ek)k&#233;nt van(nak) megadva.
  </MsgText>
  <Explanation>
    Minden f&#252;rttagnak futtatnia kell tudni ugyanazokat az alkalmaz&#225;sokat, de az &#250;j f&#252;rttag nem tudja t&#225;mogatni az OSGi alkalmaz&#225;sokat, amelyek &quot;Futtat&#225;s mint&quot; szerepk&#233;nt vannak megadva.
  </Explanation>
  <UserResponse>
    V&#225;lasszon ki egy 8-as v&#225;ltozat&#250; csom&#243;pontot a f&#252;rttag elhelyez&#233;s&#233;hez, vagy m&#243;dos&#237;tsa az alkalmaz&#225;s konfigur&#225;ci&#243;kat &#250;gy, hogy azok ne hat&#225;rozzanak meg t&#246;bb&#233; &quot;Futtat&#225;s mint&quot; szerepeket.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: A(z) {0} alkalmaz&#225;s {1} v&#225;ltozat&#225;nak telep&#237;t&#233;sle&#237;r&#243;ja ugyanazzal a szimbolikus n&#233;vvel &#233;s v&#225;ltozattal rendelkez&#337; tartalmat sorol fel, mint az alkalmaz&#225;s.
  </MsgText>
  <Explanation>
    Mivel az alkalmaz&#225;sok, csomagok &#233;s &#246;sszetett csomagok ugyanazon a n&#233;vt&#233;ren osztoznak, &#237;gy egyedi azonos&#237;t&#243;val kell rendelkezni&#252;k azon n&#233;vt&#233;ren bel&#252;l. Az alkalmaz&#225;s telep&#237;t&#233;s&#233;nek &#233;rv&#233;nyes&#237;t&#233;se sor&#225;n a fut&#225;sidej&#369; k&#246;rnyezet egy csomaghivatkoz&#225;st tal&#225;lt ugyanazzal a szimbolikus n&#233;vvel &#233;s v&#225;ltozattal, mint az alkalmaz&#225;s&#233;.
  </Explanation>
  <UserResponse>
    Jav&#237;tsa ki a csomag, az &#246;sszetett csomag vagy az alkalmaz&#225;s szimbolikus nev&#233;t, hogy ne legyen t&#246;bb&#233; &#252;tk&#246;z&#233;s a n&#233;vt&#233;rben.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: A(z) {0} inform&#225;ci&#243;tulajdon nem oldhat&#243; fel. Egy, a(z) {2} csomaghoz tartoz&#243; import&#225;l&#225;s {1} jellemz&#337;je nem el&#233;g&#237;thet&#337; ki telep&#237;t&#233;skor.
  </MsgText>
  <Explanation>
    Az APPLICATION.MF Application-Content  fejl&#233;c&#233;ben felsorolt bundle elemek eset&#233;n minden csomag import&#225;l&#225;snak olyan jellemz&#337;kkel kell rendelkeznie, amelyek a telep&#237;t&#233;skor kiel&#233;g&#237;thet&#337;k.
  </Explanation>
  <UserResponse>
    V&#225;ltoztassa meg az alkalmaz&#225;s csomagol&#225;s&#225;t vagy konfigur&#225;ci&#243;j&#225;t &#250;gy, hogy az Application-Content fejl&#233;cben felsorolt &#246;sszes bundle telep&#237;t&#233;skor kiel&#233;g&#237;thet&#337; import&#225;l&#225;sokkal rendelkezzen!
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem k&#233;pes megtal&#225;lni a(z) {0} elem kibont&#225;s&#225;hoz sz&#252;ks&#233;ges be&#225;ll&#237;t&#225;si adatokat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Kiv&#233;tel t&#246;rt&#233;nt a(z) {0} csomag modellez&#233;se sor&#225;n : {1}
  </MsgText>
  <Explanation>
    A megadott kiv&#233;tel t&#246;rt&#233;nt a megadott csomag modellez&#233;se k&#246;zben.
  </Explanation>
  <UserResponse>
    A megadott kiv&#233;tel tanulm&#225;nyoz&#225;s&#225;val pr&#243;b&#225;lja meg kider&#237;teni a probl&#233;ma ok&#225;t, majd jav&#237;tsa azt.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem k&#233;pes a(z) {0} War f&#225;jlban l&#233;v&#337; web.xml zip bejegyz&#233;shez tartoz&#243; InputStream objektumot leh&#237;vni.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: Nem tal&#225;lhat&#243; a(z) {0} n&#233;vnek megfelel&#337; MDB figyel&#337; hiteles&#237;t&#233;si &#225;ln&#233;v a(z) {1} c&#233;lon a(z) {4} verzi&#243;j&#250; {3} k&#246;tegben l&#233;v&#337; {2} komponens &#225;ltal haszn&#225;lt er&#337;forr&#225;shoz.
  </MsgText>
  <Explanation>
    A megadott hiteles&#237;t&#233;si &#225;ln&#233;v nem l&#233;tezik vagy az alkalmaz&#225;s sz&#225;m&#225;ra nem l&#225;that&#243;.
  </Explanation>
  <UserResponse>
    Konfigur&#225;lja a sz&#252;ks&#233;ges hiteles&#237;t&#233;si &#225;lnevet, vagy gy&#337;z&#337;dj&#246;n meg r&#243;la, hogy az alkalmaz&#225;shoz megfelel&#337; hat&#243;k&#246;rben van konfigur&#225;lva.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: A(z) {0} inform&#225;ci&#243;tulajdon nem oldhat&#243; fel. A(z){1} bundle-ra van sz&#252;ks&#233;ge, amely nem szerepel az alkalmaz&#225;sle&#237;r&#243;, (APPLICATION.MF), Application-Content fejl&#233;c&#233;ben. Ez a bundle a(z) {2} szolg&#225;ltat&#225;st haszn&#225;lja az Application-Content fejl&#233;cben felsorolt {3} bundle elemb&#337;l.
  </MsgText>
  <Explanation>
    Az alkalmaz&#225;st nem konfigur&#225;lt&#225;k helyesen. Megosztott bundle nem haszn&#225;lhat lev&#225;lasztott bundle elemb&#337;l sz&#225;rmaz&#243; szolg&#225;ltat&#225;st. Az Application-Content fejl&#233;cben felsorolt bundle elemek le vannak v&#225;lasztva &#233;s csak az Application-ExportService elj&#225;r&#225;ssal export&#225;lhatnak szolg&#225;ltat&#225;sokat egy&#233;b alkalmaz&#225;sok sz&#225;m&#225;ra.
  </Explanation>
  <UserResponse>
    V&#225;ltoztassa meg az alkalmaz&#225;s csomagol&#225;s&#225;t vagy konfigur&#225;ci&#243;j&#225;t &#250;gy, hogy a Use-Bundle fejl&#233;cben felsorolt vagy a felold&#243; &#225;ltal hozz&#225;adott bundle elemek ne ig&#233;nyeljenek olyan szolg&#225;ltat&#225;sokat, amelyeket az Application-Content fejl&#233;cben szerepl&#337; bundle elemek biztos&#237;tanak!
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: A(z) {0} eszk&#246;z k&#252;ls&#337; let&#246;lt&#233;seket ig&#233;nyel, miel&#337;tt telep&#237;thet&#337; lenne egy &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gre.
  </MsgText>
  <Explanation>
    Az &#250;j vagy friss&#237;tett eszk&#246;z egy vagy t&#246;bb csomag let&#246;lt&#233;s&#233;t ig&#233;nyli a t&#225;rr&#243;l, miel&#337;tt hozz&#225;adhat&#243; lenne egy &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez vagy friss&#237;thet&#337; lenne egy &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gben.
  </Explanation>
  <UserResponse>
    A csomag let&#246;lt&#233;si folyamat&#225;nak elind&#237;t&#225;s&#225;hoz mentse a v&#225;ltoz&#225;sokat a f&#337; konfigur&#225;ci&#243;ba. Az eszk&#246;z bundle let&#246;lt&#233;s&#233;nek &#225;llapot&#225;t megtekintheti az adminisztr&#225;ci&#243;s kezel&#337;pult eszk&#246;z r&#233;szletek panelj&#225;n. Miut&#225;n a csomaglet&#246;lt&#233;sek befejez&#337;dtek, pr&#243;b&#225;lja meg &#250;jra az eszk&#246;z hozz&#225;ad&#225;s&#225;t vagy friss&#237;t&#233;s&#233;t egy &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gben.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: A(z) {1} EBA f&#225;jlban l&#233;v&#337; {0} WAR f&#225;jl WAB f&#225;jll&#225; t&#246;rt&#233;n&#337; konvert&#225;l&#225;sa nem fejez&#337;d&#246;tt be sikeresen.
  </MsgText>
  <Explanation>
    A v&#225;llalati csomagarch&#237;vumban (EBA) l&#233;v&#337; webalkalmaz&#225;s-arch&#237;vum (WAR) f&#225;jlokat &#225;t kell konvert&#225;lni webalkalmaz&#225;s csomagokk&#225; (WAB), miel&#337;tt telep&#237;teni lehetne azokat. A konvert&#225;l&#225;si folyamat nem fejez&#337;d&#246;tt be sikeresen.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a WAR f&#225;jl &#233;rv&#233;nyes-e!
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Bels&#337; hiba t&#246;rt&#233;nt. A RepositoryAdminSupport szolg&#225;ltat&#225;s nem &#233;rhet&#337; el az OSGi szolg&#225;ltat&#225;s-nyilv&#225;ntart&#225;sban.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: A(z) {0} hiteles&#237;t&#233;si &#225;ln&#233;v nem l&#233;tezik a(z) {1} c&#233;l {2} biztons&#225;gi tartom&#225;ny&#225;ban.
  </MsgText>
  <Explanation>
    A glob&#225;lis vagy c&#233;l biztons&#225;gi tartom&#225;nyban l&#233;teznie kell hiteles&#237;t&#233;si &#225;ln&#233;vnek, amikor a rendszer Blueprint er&#337;forr&#225;s-hivatkoz&#225;sokat k&#246;t.
  </Explanation>
  <UserResponse>
    V&#225;lasszon olyan hiteles&#237;t&#233;si &#225;lnevet, amely l&#233;tezik a glob&#225;lis vagy c&#233;l biztons&#225;gi tartom&#225;nyban, vagy hozzon l&#233;tre megfelel&#337; hiteles&#237;t&#233;si &#225;lnevet!
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: Nem lehet l&#233;trehozni egy f&#252;rttagot a(z) {0} csom&#243;ponton, mert a(z) {1} OSGi alkalmaz&#225;s(ok) &#246;sszetett k&#246;teg arch&#237;vumot (CBA) tartalmaz(nak) az Application-Content fejl&#233;cben.
  </MsgText>
  <Explanation>
    Minden f&#252;rttagnak futtatnia kell tudni ugyanazokat az alkalmaz&#225;sokat, de az &#250;j f&#252;rttag nem tudja t&#225;mogatni az OSGi alkalmaz&#225;sokat, amelyeknek CBA arch&#237;vumok vannak az Application-Content fejl&#233;c&#233;ben.
  </Explanation>
  <UserResponse>
    V&#225;lasszon ki egy 8-as v&#225;ltozat&#250; csom&#243;pontot a f&#252;rttag elhelyez&#233;s&#233;hez, vagy m&#243;dos&#237;tsa az alkalmaz&#225;s(ok)at &#250;gy, hogy azok ne tartalmazzanak tov&#225;bb CBA arch&#237;vumokat az Application-Content fejl&#233;cben.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: A(z) {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;g nem egyezik egy OSGi alkalmaz&#225;ssal.
  </MsgText>
  <Explanation>
    A megh&#237;vott m&#369;velet egy OSGi alkalmaz&#225;shoz tartoz&#243; &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gen m&#369;k&#246;dik. A kiv&#225;lasztott &#246;ssze&#225;ll&#237;t&#225;si egys&#233;g nem tartalmaz OSGi alkalmaz&#225;st.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a kiv&#225;lasztott &#246;ssze&#225;ll&#237;t&#225;si egys&#233;get t&#225;mogatja-e egy &quot;EBA,version=1.0&quot; t&#237;pus&#250; inform&#225;ci&#243; elem.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Bels&#337; hiba t&#246;rt&#233;nt. Nem lehetett a telep&#237;t&#233;sle&#237;r&#243; r&#233;szt kivonni a(z) {0} eszk&#246;z bin&#225;ris f&#225;jlb&#243;l.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Bels&#337; hiba t&#246;rt&#233;nt. A ModelledResourceManager szolg&#225;ltat&#225;s nem &#233;rhet&#337; el az OSGi szolg&#225;ltat&#225;s-nyilv&#225;ntart&#225;sban.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {1} verzi&#243;sz&#225;m&#250; {0} CBA-csomag nem modellezhet&#337;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: A Java EE alkalmaz&#225;sle&#237;r&#243; f&#225;jl nem tal&#225;lhat&#243; a(z) {0} EBA f&#225;jlban. A le&#237;r&#243; f&#225;jl n&#233;lk&#252;l a rendszer a WAR f&#225;jlokhoz tartoz&#243; kontextusgy&#246;kereket az alap&#233;rtelmezett &#233;rt&#233;kekre &#225;ll&#237;tja be.
  </MsgText>
  <Explanation>
    A rendszer egy webalkalmaz&#225;s-arch&#237;vumot (WAR) a hozz&#225; tartoz&#243;, a kontextusgy&#246;kereket megad&#243; alkalmaz&#225;sle&#237;r&#243; f&#225;jl, az application.xml, n&#233;lk&#252;l dolgozott fel. A k&#246;lt&#246;ztetett WAR f&#225;jlhoz tartoz&#243; kontextusgy&#246;kereket a rendszer az alap&#233;rtelmezett &#233;rt&#233;kekre &#225;ll&#237;tja be.
  </Explanation>
  <UserResponse>
    Ha alkalmaz&#225;sle&#237;r&#243; f&#225;jlra van sz&#252;ks&#233;g, ellen&#337;rizze, hogy az rendelkez&#233;sre &#225;ll-e &#233;s megfelel&#337;en csomagolt&#225;k-e be a v&#225;llalati bundle-arch&#237;vum (EBA) f&#225;jlba!
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Nem lehet feldolgozni az err&#337;l a helyr&#337;l ({0}) sz&#225;rmaz&#243; alkalmaz&#225;s &#225;ltal ny&#250;jtott telep&#237;t&#233;sle&#237;r&#243;t.
  </MsgText>
  <Explanation>
    Telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt tartalmaz&#243; EBA f&#225;jlt pr&#243;b&#225;lt meg import&#225;lni. Ennek a f&#225;jlnak a feldolgoz&#225;sa nem siker&#252;lt.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;skiszolg&#225;l&#243;nak van-e jogosults&#225;ga a f&#225;jlhoz, &#233;s az nem s&#233;r&#252;lt-e. Ne szerkessze a telep&#237;t&#233;sle&#237;r&#243;t manu&#225;lisan. Sz&#252;ks&#233;g eset&#233;n t&#225;vol&#237;tsa el a telep&#237;t&#233;sle&#237;r&#243;t az EBA f&#225;jlb&#243;l. Emiatt a rendszer friss telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt fog el&#337;&#225;ll&#237;tani az EBA import&#225;l&#225;sakor.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} szolg&#225;ltat&#225;s nem &#233;rhet&#337; el az OSGi szolg&#225;ltat&#225;s-nyilv&#225;ntart&#225;sban.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: A(z) {0} k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </MsgText>
  <Explanation>
    A megadott k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy l&#233;tezik-e a t&#225;rol&#225;si hely, &#233;s hogy a term&#233;k rendelkezik-e a k&#246;nyvt&#225;r l&#233;trehoz&#225;s&#225;hoz sz&#252;ks&#233;ges enged&#233;lyekkel!
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} modul nem v&#225;rt t&#237;pus&#250;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: A(z) {0} EBA f&#225;jl telep&#237;t&#233;se hib&#225;kkal befejez&#337;d&#246;tt.
  </MsgText>
  <Explanation>
    A v&#225;llalati csomagarch&#237;vum (EBA) ellen&#337;rz&#233;se &#233;s telep&#237;t&#233;se hib&#225;kkal befejez&#337;d&#246;tt.
  </Explanation>
  <UserResponse>
    Tov&#225;bbi inform&#225;ci&#243;k&#233;rt tekintse &#225;t a kapcsol&#243;d&#243; hiba&#252;zeneteket a SystemOut.log f&#225;jlban!
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Nem hozhat&#243; l&#233;tre alap&#233;rtelmezett k&#246;t&#233;s a(z) {0} EJB-hivatkoz&#225;shoz a(z) {2} v&#225;ltozat&#250;, {3} fel&#252;lettel rendelkez&#337; {1} csomagban, mivel az alkalmaz&#225;sban nincs megfelel&#337; EJB-komponens.
  </MsgText>
  <Explanation>
    Az alap&#233;rtelmezett k&#246;t&#233;seket lev&#225;lasztott EJB hivatkoz&#225;sokhoz kell l&#233;trehozni. Nem tal&#225;lhat&#243; olyan EJB-komponens, amelyhez ezt a hivatkoz&#225;st k&#246;tni lehetne.
  </Explanation>
  <UserResponse>
    K&#246;sse a hivatkoz&#225;st ismert JNDI helyhez, vagy jav&#237;tsa az alkalmaz&#225;st.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem tal&#225;lja a(z) {0} eszk&#246;zh&#246;z tartoz&#243; konfigur&#225;ci&#243;s eszk&#246;z objektumot.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: A rendszer nem tal&#225;lt {0} JNDI-n&#233;vvel &#233;s {1} t&#237;pussal megegyez&#337; er&#337;forr&#225;s-hivatkoz&#225;st a(z) {2} c&#233;lon a(z) {3} EJB er&#337;forr&#225;s-hivatkoz&#225;shoz, amelyet a(z) {5} v&#225;ltozat&#250; {4} csomagban adtak meg.
  </MsgText>
  <Explanation>
    Az EJB-modulban l&#233;v&#337; er&#337;forr&#225;s-hivatkoz&#225;sokat tartalmaz&#243; v&#225;llalati csomagarch&#237;vum (EBA) JNDI nevet ad meg egy olyan er&#337;forr&#225;s-hivatkoz&#225;shoz, amely nem l&#233;tezik a JNDI n&#233;vt&#233;rben.
  </Explanation>
  <UserResponse>
    Ha az er&#337;forr&#225;s-hivatkoz&#225;snak a JNDI n&#233;vter&#252;leten kellene lennie, vagy k&#246;ss&#246;n objektumot a n&#233;vhez, vagy jav&#237;tsa az er&#337;forr&#225;s-hivatkoz&#225;st &#233;s friss&#237;tse az EBA-t!
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: A(z) {1} &#252;zleti szint&#369; alkalmaz&#225;sban tal&#225;lhat&#243; {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gbe telep&#237;tett OSGi alkalmaz&#225;s le&#225;ll&#237;t&#225;sa meghi&#250;sult.
  </MsgText>
  <Explanation>
    Kiv&#233;tel t&#246;rt&#233;nt a le&#225;ll&#237;t&#225;si m&#369;velet sor&#225;n.
  </Explanation>
  <UserResponse>
    Vizsg&#225;lja meg a kiv&#233;telt megel&#337;z&#337; kiszolg&#225;l&#243;napl&#243;kat a probl&#233;ma r&#233;szletesebb diagnosztiz&#225;l&#225;sa c&#233;lj&#225;b&#243;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: A(z) {0} szerep nem &#233;rv&#233;nyes szerep.
  </MsgText>
  <Explanation>
    A megadott szerep nem lett be&#225;ll&#237;tva.
  </Explanation>
  <UserResponse>
    &#193;ll&#237;tsa be a megadott szerepet.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: A(z) {0} f&#252;rttagot nem eg&#233;sz&#237;tett&#233;k ki a(z) {1} OSGi alkalmaz&#225;s &#225;ltal ig&#233;nyelt {2} funkci&#243;kkal.
  </MsgText>
  <Explanation>
    Ahhoz, hogy a rendszer egy OSGi alkalmaz&#225;st telep&#237;tsen egy f&#252;rtre, a f&#252;rt minden tagj&#225;nak rendelkeznie kell az alkalmaz&#225;s &#225;ltal ig&#233;nyelt &#246;sszes funkci&#243;val. &#218;j f&#252;rttag hozz&#225;ad&#225;sa eset&#233;n annak a tagnak a f&#252;rt&#246;n telep&#237;tett &#246;sszes OSGi alkalmaz&#225;s &#225;ltal ig&#233;nyelt &#246;sszes funkci&#243;val rendelkeznie kell.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a f&#252;rt javasolt tagja rendelkezik-e a hiba&#252;zenetben felsorolt OSGi alkalmaz&#225;s &#225;ltal ig&#233;nyelt funkci&#243;kkal.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: A(z) {0} k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </MsgText>
  <Explanation>
    A megadott k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy l&#233;tezik-e a t&#225;rol&#225;si hely, &#233;s hogy a term&#233;k rendelkezik-e a k&#246;nyvt&#225;r l&#233;trehoz&#225;s&#225;hoz sz&#252;ks&#233;ges enged&#233;lyekkel!
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: A telep&#237;t&#233;sle&#237;r&#243; tartalma helytelen. A k&#246;vetkez&#337; bundle elemek sz&#252;ks&#233;gtelenek: {0}.
  </MsgText>
  <Explanation>
    Az import&#225;land&#243; telep&#237;t&#233;sle&#237;r&#243; a v&#225;llalati csomagarch&#237;vum (EBA) eszk&#246;z felold&#225;s&#225;hoz nem sz&#252;ks&#233;ges csomagokat is tartalmaz.
  </Explanation>
  <UserResponse>
    Biztos&#237;tsa, hogy az &#250;j telep&#237;t&#233;si le&#237;r&#243; (DEPLOYMENT.MF) ne tartalmazza a kiv&#233;tel&#252;zenetben tal&#225;lhat&#243; csomagokat. Ne szerkessze a telep&#237;t&#233;sle&#237;r&#243;t manu&#225;lisan. Sz&#252;ks&#233;g eset&#233;n t&#225;vol&#237;tsa el a telep&#237;t&#233;sle&#237;r&#243;t az EBA f&#225;jlb&#243;l. Emiatt a term&#233;k friss telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt fog el&#337;&#225;ll&#237;tani az EBA import&#225;l&#225;sakor.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: A megadott {0} csoport nem &#233;rv&#233;nyes.
  </MsgText>
  <Explanation>
    Biztons&#225;gi szerepet k&#237;s&#233;reltek meg hozz&#225;rendelni egy &#233;rv&#233;nytelen csoporthoz.
  </Explanation>
  <UserResponse>
    Gy&#337;z&#337;dj&#246;n meg r&#243;la, hogy a megadott csoport l&#233;tezik!
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszergazdai szolg&#225;ltat&#225;s bejegyz&#233;se nem t&#246;rt&#233;nt meg.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Egy kiterjeszt&#233;s hozz&#225;ad&#225;sa a(z) {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez k&#252;ls&#337; let&#246;lt&#233;seket ig&#233;nyel.
  </MsgText>
  <Explanation>
    L&#233;trehozott vagy friss&#237;tett egy &#246;sszetett csomagarch&#237;vumot (CBA), hogy kiterjeszt&#233;sk&#233;nt haszn&#225;lja egy &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez. Ez a kiterjeszt&#233;s megk&#246;veteli, hogy egy vagy t&#246;bb csomagot t&#246;lts&#246;n le a t&#225;rb&#243;l, miel&#337;tt a kiterjeszt&#233;st hozz&#225;adhatn&#225; az &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez.
  </Explanation>
  <UserResponse>
    A let&#246;lt&#233;si folyamat elind&#237;t&#225;s&#225;hoz mentse a v&#225;ltoz&#225;sokat a f&#337; konfigur&#225;ci&#243;ba!  A csomag let&#246;lt&#233;s&#233;nek &#225;llapot&#225;t megtekintheti az adminisztr&#225;ci&#243;s kezel&#337;pult &#246;ssze&#225;ll&#237;t&#225;si egys&#233;g r&#233;szletei panel&#233;n. V&#225;rja meg, hogy a csomag let&#246;lt&#233;se befejez&#337;dj&#246;n, majd adja hozz&#225; a kiterjeszt&#233;st az &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: Egyetlen kiszolg&#225;l&#243; vagy f&#252;rt sem rendelkezik a(z) {1} eszk&#246;zh&#246;z telep&#237;tett sz&#252;ks&#233;ges {0} szolg&#225;ltat&#225;ssal.
  </MsgText>
  <Explanation>
    A sz&#252;ks&#233;ges szolg&#225;ltat&#225;s nem tal&#225;lhat&#243; meg egyetlen kiszolg&#225;l&#243;n sem.
  </Explanation>
  <UserResponse>
    Telep&#237;tse a sz&#252;ks&#233;ges szolg&#225;ltat&#225;st legal&#225;bb az egyik kiszolg&#225;l&#243;ra!
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} v&#225;llalati bundle-arch&#237;vum (EBA) f&#225;jlb&#243;l hi&#225;nyoznak a k&#246;vetkez&#337; bundle elemek: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: Nem lehet a(z) {0} eszk&#246;zt ebbe az &#252;zleti szint&#369; alkalmaz&#225;sba felvenni, mivel m&#225;r hozz&#225;adt&#225;k a k&#246;vetkez&#337; &#252;zleti szint&#369; alkalmaz&#225;shoz: {1}
  </MsgText>
  <Explanation>
    V&#225;llalati bundle-arch&#237;vum (EBA) eszk&#246;z csak egyetlen &#252;zleti szint&#369; alkalmaz&#225;sban (BLA) lehet.
  </Explanation>
  <UserResponse>
    Hozzon l&#233;tre &#250;j alkalmaz&#225;st ugyanazzal a tartalommal, de elt&#233;r&#337; szimbolikus alkalmaz&#225;sn&#233;v be&#225;ll&#237;t&#225;ssal! Import&#225;lja az &#250;j alkalmaz&#225;st EBA eszk&#246;zk&#233;nt, majd adja hozz&#225; ehhez a BLA-hoz!
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: A(z) {0} alkalmaz&#225;s telep&#237;t&#233;se elt&#233;r&#337; eredm&#233;nyt hozott a 8-as v&#225;ltozat&#250; WebSphere Application Server &#233;s a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomag eset&#233;n. A rendszer 8-as v&#225;ltozat eset&#233;ben kapott eredm&#233;nyt haszn&#225;lja
  </MsgText>
  <Explanation>
    Az import&#225;lt alkalmaz&#225;s sikeresen telep&#237;tve lett a 8-as v&#225;ltozat&#250; WebSphere Application Server kiszolg&#225;l&#243;n &#233;s a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomagon. Azonban a k&#233;t telep&#237;t&#233;si m&#369;velet elt&#233;r&#337; eredm&#233;nyt hozott. Nem futtathatja ugyanazt az alkalmaz&#225;st k&#252;l&#246;nb&#246;z&#337; telep&#237;t&#233;sekkel.
  </Explanation>
  <UserResponse>
    Semmit sem kell tennie.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: A(z) {1} elemet hozz&#225;rendelte a rendszer a(z) {0} k&#246;nyvt&#225;rhoz.
  </MsgText>
  <Explanation>
    Egy v&#225;llalati csomagarch&#237;vum (EBA) elemet egy &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez adnak hozz&#225;. Annak &#233;rdek&#233;ben, hogy be tudja &#225;ll&#237;tani az EBA &#225;ltal tartalmazott webalkalmaz&#225;st, a rendszer egy k&#246;nyvt&#225;rt rendelt hozz&#225; a webalkalmaz&#225;shoz.
  </Explanation>
  <UserResponse>
    Nincs
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem tudja olvasni a(z) {0} v&#225;llalati bundle-arch&#237;vumhoz (EBA) tartoz&#243; alkalmaz&#225;sle&#237;r&#243; vagy telep&#237;t&#233;sle&#237;r&#243; elemet.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} l&#233;p&#233;s nem tal&#225;lhat&#243;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: A(z) {0} eszk&#246;z olyan JAR f&#225;jlt ({1}) tartalmaz, amely nem csomag, &#233;s amely nem lesz &#225;talak&#237;tva. Ha az alkalmaz&#225;s m&#225;s r&#233;szei ett&#337;l a f&#225;jlt&#243;l f&#252;ggenek, az alkalmaz&#225;s hib&#225;san fog m&#369;k&#246;dni futtat&#225;skor.
  </MsgText>
  <Explanation>
    Seg&#233;dprogram Java arch&#237;vum (JAR) f&#225;jlok &#233;s Enterprise JavaBeans (EJB) JAR f&#225;jlok &#225;talak&#237;t&#225;sa nem t&#225;mogatott.
  </Explanation>
  <UserResponse>
    Gy&#337;z&#337;dj&#246;n meg arr&#243;l, hogy egyetlen csomag &#233;s webalkalmaz&#225;s-csomag (WAB) sem f&#252;gg a JAR f&#225;jlban l&#233;v&#337; oszt&#225;lyokt&#243;l. Ha el k&#237;v&#225;nja ker&#252;lni a figyelmeztet&#337; &#252;zenetet, t&#225;vol&#237;tsa el a JAR &#225;llom&#225;nyt a v&#225;llalati bundle-arch&#237;vumb&#243;l (EBA)!
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem tudja olvasni a(z) {0} v&#225;llalati bundle-arch&#237;vumhoz (EBA) tartoz&#243; alkalmaz&#225;sle&#237;r&#243; vagy telep&#237;t&#233;sle&#237;r&#243; elemet.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: A(z) {3} v&#225;ltozat&#250; {2} csomagban l&#233;v&#337; {1} EJB-komponens {0} EJB-fel&#252;lete nem k&#246;thet&#337; a(z) {4} helyhez. A helyileg el&#233;rhet&#337; EJB-fel&#252;leteket az ejblocal: n&#233;vt&#233;rhez kell k&#246;tni.
  </MsgText>
  <Explanation>
    EJB-komponens helyi, &quot;Nincs fel&#252;let&quot; &#233;s &quot;Helyi alapk&#246;nyvt&#225;r&quot; n&#233;zetei csak helyileg el&#233;rhet&#337; JNDI fel&#252;lethez k&#246;thet&#337;k. Ez azt jelenti, hogy a k&#246;t&#233;si nev&#252;knek az &quot;ejblocal:&quot; karaktersorozattal kell kezd&#337;dnie.
  </Explanation>
  <UserResponse>
    Igaz&#237;tsa az &#246;sszes helyileg el&#233;rhet&#337; EJB-n&#233;zet k&#246;t&#233;si nev&#233;t &#250;gy, hogy az ejblocal: n&#233;vt&#233;r-el&#337;tagot haszn&#225;lja.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: A CompUnitStatusStep param&#233;ter azt jelzi, hogy a(z) {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;get friss&#237;teni kell a(z) {1} eszk&#246;zb&#337;l el&#233;rhet&#337; leg&#250;jabb telep&#237;t&#233;si v&#225;ltozattal. Azonban a(z) {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;g naprak&#233;sz.
  </MsgText>
  <Explanation>
    Miel&#337;tt friss&#237;thetn&#233; az &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gen bel&#252;l telep&#237;tett eszk&#246;zt, rendelkez&#233;s&#233;re kell, hogy &#225;lljon az eszk&#246;z egy friss&#237;tett v&#225;ltozata &#233;s a friss&#237;tett eszk&#246;z &#225;ltal ig&#233;nyelt &#246;sszes csomag let&#246;lt&#233;s&#233;nek be kell fejez&#337;dnie.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy rendelkez&#233;sre &#225;ll-e az eszk&#246;z egy k&#233;s&#337;bbi v&#225;ltozata, &#233;s hogy az &#246;sszes csomag let&#246;lt&#233;se befejez&#337;d&#246;tt-e ahhoz az eszk&#246;zh&#246;z.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem k&#233;pes &#246;ssze&#225;ll&#237;t&#225;si egys&#233;get tal&#225;lni a(z) {0} elemhez.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: Nem lehet l&#233;trehozni egy f&#252;rttagot a(z) {0} csom&#243;ponton, mert a(z) {1} OSGi alkalmaz&#225;s(ok) ki lett(ek) terjesztve.
  </MsgText>
  <Explanation>
    Minden f&#252;rttagnak futtatnia kell tudni ugyanazokat az alkalmaz&#225;sokat, de az &#250;j f&#252;rttag nem tudja t&#225;mogatni az OSGi alkalmaz&#225;s kiterjeszt&#233;seket.
  </Explanation>
  <UserResponse>
    V&#225;lasszon ki egy 8-as v&#225;ltozat&#250; csom&#243;pontot a f&#252;rttag elhelyez&#233;s&#233;hez, vagy t&#225;vol&#237;tsa el a kiterjeszt&#233;s(eke)t az alkalmaz&#225;sb&#243;l, hogy az futhasson a kiv&#225;lasztott csom&#243;pontot haszn&#225;lva.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: A(z) {1} &#246;sszetev&#337;ben szerepl&#337; {0} csomag nem friss&#237;thet&#337;, mivel m&#225;r van egy egyez&#337; szibmolikus n&#233;vvel rendelkez&#337;, &#252;tk&#246;z&#337; b&#337;v&#237;tm&#233;ny.
  </MsgText>
  <Explanation>
    A CBA csomag nem friss&#237;thet&#337; a k&#233;rt v&#225;ltozatra, mivel m&#225;r van egyez&#337; szimbolikus n&#233;vvel rendelkez&#337; b&#337;v&#237;tm&#233;ny az adott v&#225;ltozaton.
  </Explanation>
  <UserResponse>
    T&#225;vol&#237;tsa el a b&#337;v&#237;tm&#233;nyt, vagy m&#243;dos&#237;tsa azon csomag v&#225;ltozat&#225;t, melyre friss&#237;teni pr&#243;b&#225;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: Nem tal&#225;lhat&#243; a(z) {0} JNDI n&#233;vnek megfelel&#337; MDB Activation Spec a(z) {1} c&#233;lon a(z) {4} verzi&#243;j&#250; {3} k&#246;tegben l&#233;v&#337; {2} komponens &#225;ltal haszn&#225;lt er&#337;forr&#225;shoz.
  </MsgText>
  <Explanation>
    A megadott MDB figyel&#337; k&#246;t&#233;si ActivationSpec hivatkoz&#225;s JNDI neve nem l&#233;tezik.
  </Explanation>
  <UserResponse>
    Ha a hivatkoz&#225;snak a JNDI n&#233;vter&#252;leten kellene lennie, vagy k&#246;ss&#246;n objektumot a n&#233;vhez, vagy jav&#237;tsa a hivatkoz&#225;st &#233;s friss&#237;tse az EBA-t!
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} eszk&#246;z tartalm&#225;t nem lehetett lek&#233;rdezni.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: A(z) {0} alkalmaz&#225;s egy {1} &#246;sszetett csomagot tartalmaz az alkalmaz&#225;startalomban. Ez nem t&#225;mogatott.
  </MsgText>
  <Explanation>
    Az Application-Content fejl&#233;c haszn&#225;lat&#225;val nem foglalhat be csomagarch&#237;vumokat k&#246;zvetlen&#252;l EBA f&#225;jlban.
  </Explanation>
  <UserResponse>
    T&#225;vol&#237;tsa el az &#246;sszetett csomagot az alkalmaz&#225;startalomb&#243;l. Az egyes csomagokat vagy az Application-Content fejl&#233;cbe foglalhatja bele, vagy telep&#237;theti az &#246;sszetett csomagot egy csomagt&#225;rba megoszt&#225;s c&#233;lj&#225;b&#243;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Bels&#337; hiba t&#246;rt&#233;nt. A bundle gyors&#237;t&#243;t&#225;rban tal&#225;lhat&#243; n&#233;v megfelel&#337;, de nem tartalmazza a v&#225;rt bundle elemet: {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: Nem tal&#225;lhat&#243; a(z) {0} JNDI-nev&#369;, {1} t&#237;pus&#250; &#252;zenetc&#237;mzett-hivatkoz&#225;s vagy er&#337;forr&#225;sk&#246;rnyezet-hivatkoz&#225;s a(z) {5} v&#225;ltozat&#250;, {4} csomagban meghat&#225;rozott {3} EJB &#252;zenetc&#237;mzett-hivatkoz&#225;s vagy er&#337;forr&#225;sk&#246;rnyezet-hivatkoz&#225;s {2} c&#233;lj&#225;n.
  </MsgText>
  <Explanation>
    Az EJB-modulban l&#233;v&#337; &#252;zenetc&#237;mzett-hivatkoz&#225;sok vagy er&#337;forr&#225;sk&#246;rnyezet-hivatkoz&#225;sokat tartalmaz&#243; v&#225;llaati csomagarch&#237;vum (EBA) &#225;llom&#225;ny olyan &#252;zenetc&#237;mzett-hivatkoz&#225;s vagy er&#337;forr&#225;sk&#246;rnyezet-hivatkoz&#225;s JNDI nev&#233;t adja meg, amely nem l&#233;tezik a JNDI n&#233;vt&#233;rben.
  </Explanation>
  <UserResponse>
    Ha az &#252;zenetc&#237;mzett-hivatkoz&#225;snak vagy er&#337;forr&#225;sk&#246;rnyezet-hivatkoz&#225;snak a JNDI n&#233;vt&#233;rben kellene lennie, k&#246;ss&#246;n objektumot a n&#233;vhez, vagy jav&#237;tsa az &#252;zenetc&#237;mzett-hivatkoz&#225;st vagy er&#337;forr&#225;sk&#246;rnyezet-hivatkoz&#225;st, &#233;s friss&#237;tse az EBA-t!
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: A(z) {0} OSGi alkalmaz&#225;s &#233;rv&#233;nytelen, mivel szimbolikus neve k&#233;t egym&#225;st k&#246;vet&#337; pontot tartalmaz.
  </MsgText>
  <Explanation>
    OSGi alkalmaz&#225;s szimbolikus neve nem tartalmazhatja a &quot;..&quot; karaktersorozatot (azaz k&#233;t egym&#225;st k&#246;vet&#337; pontot).
  </Explanation>
  <UserResponse>
    M&#243;dos&#237;tsa az OSGi alkalmaz&#225;s szimbolikus nev&#233;t.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: A rendszer nem tudja olvasni a(z) {0} EBA f&#225;jlt.
  </MsgText>
  <Explanation>
    IOException t&#246;rt&#233;nt, mik&#246;zben a rendszer v&#225;llalati bundle-arch&#237;vumot (EBA) olvasott. A f&#225;jl esetleg s&#233;r&#252;lt vagy nem olvashat&#243;.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a f&#225;jl a megfelel&#337; enged&#233;lyekkel rendelkezik-e, &#233;s hogy a megfelel&#337; form&#225;tumban van!
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Bels&#337; hiba t&#246;rt&#233;nt. A SecurityAdmin fel&#252;gyelt komponens bejegyz&#233;se nem t&#246;rt&#233;nt meg.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: A(z) {0} Composite Bundle Archive (CBA) tartalm&#225;ban tal&#225;lhat&#243; szolg&#225;ltat&#225;shivatkoz&#225;sok nem oldhat&#243;k fel. Ha ezen szolg&#225;ltat&#225;sokat olyan csomagok biztos&#237;tj&#225;k, amelyek nem a CBA r&#233;szei, a CBA-arch&#237;vumnak import&#225;lnia kell azokat. A k&#246;vetkez&#337; szolg&#225;ltat&#225;sf&#252;gg&#337;s&#233;geket a rendszer nem oldotta fel: {1}
  </MsgText>
  <Explanation>
    Ha egy CBA-arch&#237;vumban tal&#225;lhat&#243; csomag olyan szolg&#225;ltat&#225;st haszn&#225;l, amely a csomagban nem tal&#225;lhat&#243; meg vagy a CBA egy m&#225;sik csomagja export&#225;lta, a CBA-arch&#237;vumnak import&#225;lnia kell a szolg&#225;ltat&#225;st.
  </Explanation>
  <UserResponse>
    Jav&#237;tsa ki a COMPOSITEBUNDLE.MF &#246;sszetett le&#237;r&#243;f&#225;jlt, hogy a CBA import&#225;ljon minden, a CBA csomagjai &#225;ltal haszn&#225;lt, &#233;s a CBA-arch&#237;vumon bel&#252;l m&#225;sk&#233;nt rendelkez&#233;sre nem &#225;ll&#243; szolg&#225;ltat&#225;st.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: A rendszer nem tudja &#237;rni a k&#246;lt&#246;ztetett EBA f&#225;jlt ({0}).
  </MsgText>
  <Explanation>
    IOException t&#246;rt&#233;nt, mik&#246;zben a rendszer v&#225;llalati bundle-arch&#237;vumot (EBA) k&#246;lt&#246;ztetett.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a term&#233;k rendelkezik-e a sz&#252;ks&#233;ges enged&#233;lyekkel, hogy &#237;rni tudjon a megfelel&#337; k&#246;nyvt&#225;rba, a c&#233;l&#225;llom&#225;ny nem z&#225;rolt, &#233;s hogy a t&#225;rol&#243;hely el&#233;rhet&#337;!
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: A(z) {0} alkalmaz&#225;s nem telep&#237;thet&#337; a cella minden csom&#243;pontja eset&#233;n. Az alkalmaz&#225;st csak 8-as v&#225;ltozat&#250; csom&#243;ponton lehet telep&#237;teni. A felold&#225;si hiba a k&#246;vetkez&#337;: {1}.
  </MsgText>
  <Explanation>
    Az import&#225;lt alkalmaz&#225;s sikeresen telep&#237;tve lett a 8-as v&#225;ltozat&#250; WebSphere Application Server kiszolg&#225;l&#243;ra, de nem siker&#252;lt telep&#237;teni az OSGi alkalmaz&#225;sok szolg&#225;ltat&#225;scsomaghoz a 7-es v&#225;ltozat&#250; WebSphere Application Server kiszolg&#225;l&#243;n.
  </Explanation>
  <UserResponse>
    Nincs teend&#337;. Azonban a felold&#225;si hib&#225;ban tal&#225;lhat&#243; inform&#225;ci&#243;kat haszn&#225;lva m&#243;dos&#237;thatja az alkalmaz&#225;st &#250;gy, hogy az telep&#237;thet&#337; legyen a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomaghoz is.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Helyi gazdag&#233;pn&#233;v haszn&#225;lata gazdan&#233;vk&#233;nt a(z) {0}.{1} kiszolg&#225;l&#243;hoz tartoz&#243; &#225;tvitel sor&#225;n. A k&#233;r&#233;s &#250;tv&#225;laszt&#225;sa abban az esetben fog m&#369;k&#246;dni, ha a webkiszolg&#225;l&#243; &#233;s az alkalmaz&#225;skiszolg&#225;l&#243; ugyanazon a csom&#243;ponton van.
  </MsgText>
  <Explanation>
    Az &#225;tvitelhez megadott alkalmaz&#225;skiszolg&#225;l&#243; gazdanev&#233;t helyi gazdag&#233;pn&#233;vk&#233;nt oldotta fel a rendszer.
  </Explanation>
  <UserResponse>
    Ha a webkiszolg&#225;l&#243; &#233;s az alkalmaz&#225;skiszolg&#225;l&#243; k&#252;l&#246;nb&#246;z&#337; csom&#243;ponton van, der&#237;tse ki, hogy mi&#233;rt helyi gazdag&#233;pn&#233;vk&#233;nt oldotta fel a rendszer az alkalmaz&#225;skiszolg&#225;l&#243; gazdanev&#233;t.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: A(z) {0} EBA f&#225;jl nem telep&#237;thet&#337;. Az EBA {1} Application-SymbolicName elem&#233;t m&#225;r haszn&#225;lja a(z) {2} eszk&#246;z.
  </MsgText>
  <Explanation>
    Megk&#237;s&#233;relt telep&#237;teni egy EBA f&#225;jlt, de van egy m&#225;sik l&#233;tez&#337; eszk&#246;z, amely ugyanazt a szimbolikus nevet haszn&#225;lja.
  </Explanation>
  <UserResponse>
    Vagy v&#225;ltoztassa meg a telep&#237;tend&#337; EBA szimbolikus nev&#233;t vagy t&#225;vol&#237;tsa el a megl&#233;v&#337; elemet.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: Nem lehet l&#233;trehozni egy f&#252;rttagot a(z) {0} csom&#243;ponton, mert a(z) {1} OSGi alkalmaz&#225;s(ok) nem telep&#237;thet&#337;(k) rajta. A felold&#225;si hiba a k&#246;vetkez&#337;: {2}.
  </MsgText>
  <Explanation>
    Minden f&#252;rttagnak futtatnia kell tudni ugyanazokat az alkalmaz&#225;sokat, de az &#250;j f&#252;rttag nem tudja futtatni a megnevezett OSGi alkalmaz&#225;sokat.
  </Explanation>
  <UserResponse>
    V&#225;lasszon ki egy m&#225;sik kompatibilis csom&#243;pontot a f&#252;rttag elhelyez&#233;s&#233;hez, vagy m&#243;dos&#237;tsa az alkalmaz&#225;st &#250;gy, hogy az futhasson a kiv&#225;lasztott csom&#243;pontot haszn&#225;lva.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: Nem lehet a(z) {1} v&#225;llalati csomagarch&#237;vum (EBA) f&#225;jl {0} f&#225;jlj&#225;t &#233;rtelmezni.
  </MsgText>
  <Explanation>
    A kijel&#246;lt &#225;llom&#225;ny nem &#233;rtelmezhet&#337;.
  </Explanation>
  <UserResponse>
    Gy&#337;z&#337;dj&#246;n meg arr&#243;l, hogy az &#225;llom&#225;ny helyesen van-e form&#225;zva &#233;s nem s&#233;r&#252;lt-e!
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem tudja olvasni a(z) {0} v&#225;llalati bundle-arch&#237;vumhoz (EBA) tartoz&#243; alkalmaz&#225;sle&#237;r&#243; vagy telep&#237;t&#233;sle&#237;r&#243; elemet.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: F&#225;jl nem hozhat&#243; l&#233;tre: {0}
  </MsgText>
  <Explanation>
    Hiba t&#246;rt&#233;nt az elem export&#225;l&#225;sa sor&#225;n a sz&#252;ks&#233;ges &#250;tvonaln&#233;v l&#233;trehoz&#225;sa k&#246;zben.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;skiszolg&#225;l&#243;nak van-e jogosults&#225;ga az &#250;tvonaln&#233;v l&#233;trehoz&#225;s&#225;hoz.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: A WAS v7 UpdateAppContentVersionStep parancsa helyett a WAS V8 UpdateAppContentVersions parancsa haszn&#225;lhat&#243;.
  </MsgText>
  <Explanation>
    A WAS v7 UpdateAppContentVersionStep parancsa helyett a WAS V8 UpdateAppContentVersions parancsa haszn&#225;lhat&#243;. Tov&#225;bbi inform&#225;ci&#243;k&#233;rt n&#233;zze meg az Inform&#225;ci&#243;s k&#246;zpontot.
  </Explanation>
  <UserResponse>
    M&#243;dos&#237;tsa a parancsf&#225;jlt &#250;gy, hogy az  UpdateAppContentVersions parancsot haszn&#225;lja.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} v&#225;llalati bundle-arch&#237;vum (EBA) felold&#225;sakor nem tal&#225;lhat&#243; telep&#237;thet&#337; tartalom.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: A rendszer nem tudja feloldani az EBA f&#225;jlt. Kiv&#233;tel: {0}.
  </MsgText>
  <Explanation>
    A rendszer nem tudja feloldani a v&#225;llalati bundle-arch&#237;vumot (EBA) alkot&#243; alkalmaz&#225;s bundle elemek helyeit (a megfelel&#337; verzi&#243;kban).
  </Explanation>
  <UserResponse>
    Tov&#225;bbi inform&#225;ci&#243;&#233;rt tekintse meg a kiv&#233;telt!
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszer nem tudja feloldani a(z) {0} v&#225;llalati bundle-arch&#237;vumot (EBA), mert a(z) {1} szolg&#225;ltat&#225;s nem el&#233;rhet&#337;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: A megadott {0} felhaszn&#225;l&#243; nem &#233;rv&#233;nyes.
  </MsgText>
  <Explanation>
    Biztons&#225;gi szerepet k&#237;s&#233;reltek meg hozz&#225;rendelni egy &#233;rv&#233;nytelen felhaszn&#225;l&#243;hoz.
  </Explanation>
  <UserResponse>
    Gy&#337;z&#337;dj&#246;n meg r&#243;la, hogy a megadott felhaszn&#225;l&#243; l&#233;tezik!
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Bels&#337; hiba t&#246;rt&#233;nt. A rendszernek nem siker&#252;lt fel&#252;gyelt komponenst tal&#225;lnia a(z) {0} profil BundleCacheManager elem&#233;hez.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: A(z) {0} k&#246;t&#233;s a(z) {1} EJB-hivatkoz&#225;shoz a(z) {3} v&#225;ltozat&#250;, {4} fel&#252;lettel rendelkez&#337; {2} csomagban az alkalmaz&#225;s hib&#225;s m&#369;k&#246;d&#233;s&#233;t okozhatja friss&#237;t&#233;s ut&#225;n.
  </MsgText>
  <Explanation>
    A java:global/alkalmaz&#225;sn&#233;v/moduln&#233;v/ejb_n&#233;v vagy java:app/moduln&#233;v/ejb_n&#233;v kikeres&#233;si hivatkoz&#225;sok megv&#225;ltozhatnak egy OSGi alkalmaz&#225;s friss&#237;t&#233;se ut&#225;n, ez&#233;rt a hivatkoz&#225;sokat megfelel&#337;en m&#243;dos&#237;tani kell, ami miatt ez a megk&#246;zel&#237;t&#233;s nem praktikus.
  </Explanation>
  <UserResponse>
    Haszn&#225;ljon OSGi szolg&#225;ltat&#225;sokat az EJB f&#252;gg&#337;s&#233;gek be&#225;ll&#237;t&#225;s&#225;hoz, vagy deklar&#225;ljon egy EJB hivatkoz&#225;st, &#233;s k&#233;pezze le az EJB JNDI nev&#233;re.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Nem lehet kibontani a(z){0} v&#225;llalati csomagarch&#237;vum (EBA) f&#225;jlt, a(z) {1} k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </MsgText>
  <Explanation>
    A megadott EBA f&#225;jl kibont&#225;sa sor&#225;n egy sz&#252;ks&#233;ges k&#246;nyvt&#225;rt nem siker&#252;lt l&#233;trehozni.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;skiszolg&#225;l&#243;nak van-e jogosults&#225;ga a megadott k&#246;nyvt&#225;r l&#233;trehoz&#225;s&#225;hoz.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: A(z) {0} inform&#225;ci&#243;tulajdon nem oldhat&#243; fel. &#214;sszef&#233;rhetetlen verzi&#243;k&#246;vetelm&#233;nyei vannak a k&#246;vetkez&#337; csomagokkal kapcsolatban: {1}.
  </MsgText>
  <Explanation>
    Az APPLICATION.MF &#225;llom&#225;nyban l&#233;v&#337; Application-Content fejl&#233;cben felsorolt bundle elemek eset&#233;n egy adott programcsomaghoz tartoz&#243; minden importnak &#246;sszef&#233;r&#337; verzi&#243;k&#246;vetelm&#233;nyekkel kell rendelkeznie.
  </Explanation>
  <UserResponse>
    V&#225;ltoztassa meg az alkalmaz&#225;s csomagol&#225;s&#225;t vagy konfigur&#225;ci&#243;j&#225;t &#250;gy, hogy az Application-Content fejl&#233;cben felsorolt &#246;sszes bundle &#246;sszef&#233;r&#337; verzi&#243;k&#246;vetelm&#233;nnyel rendelkezzen!
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: A &quot;Futtat&#225;s mint&quot; szerepek nem konfigur&#225;lhat&#243;ak a 8-as v&#225;ltozat&#250;n&#225;l kor&#225;bbi WebSphere Application Server csom&#243;pontok eset&#233;n. A rendszer minden konfigur&#225;ci&#243;t figyelmen k&#237;v&#252;l fog hagyni.
  </MsgText>
  <Explanation>
    A &quot;Futtat&#225;s mint&quot; szerepek csak a 8-as &#233;s k&#233;s&#337;bbi v&#225;ltozat&#250; WebSphere Application Server kiszolg&#225;l&#243;kon konfigur&#225;lhat&#243;ak. Nem konfigur&#225;lhat&#243;ak olyan &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez, amely 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomag c&#233;lokra lett telep&#237;tve.
  </Explanation>
  <UserResponse>
    Nincs teend&#337;. Ha &quot;Futtat&#225;s mint&quot; szerepeket is kell konfigur&#225;lni, akkor t&#225;vol&#237;tson el minden c&#233;l lek&#233;pez&#233;st a 7-es v&#225;ltozat&#250; WebSphere Application Server OSGi alkalmaz&#225;s szolg&#225;ltat&#225;scsomag csom&#243;pontjai eset&#233;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: A felhaszn&#225;l&#243;i azonos&#237;t&#243; vagy a jelsz&#243; helytelen.
  </MsgText>
  <Explanation>
    Egy helytelen felhaszn&#225;l&#243;i azonos&#237;t&#243; vagy jelsz&#243; lett megadva.
  </Explanation>
  <UserResponse>
    Pr&#243;b&#225;lja &#250;jra a m&#369;veletet a helyes felhaszn&#225;l&#243;i azonos&#237;t&#243;t &#233;s jelsz&#243;t haszn&#225;lva.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: A(z) {1} &#252;zleti szint&#369; alkalmaz&#225;sban tal&#225;lhat&#243; {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;gbe telep&#237;tett OSGi alkalmaz&#225;s friss&#237;t&#233;si m&#369;velete nem siker&#252;lt.
  </MsgText>
  <Explanation>
    Kiv&#233;tel t&#246;rt&#233;nt a friss&#237;t&#233;si m&#369;velet sor&#225;n.
  </Explanation>
  <UserResponse>
    Vizsg&#225;lja meg a kiv&#233;telt megel&#337;z&#337; kiszolg&#225;l&#243;napl&#243;kat a probl&#233;ma r&#233;szletesebb diagnosztiz&#225;l&#225;sa c&#233;lj&#225;b&#243;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Bels&#337; hiba t&#246;rt&#233;nt. A(z) {0} v&#225;llalati bundle-arch&#237;vumban (EBA) l&#233;v&#337; alkalmaz&#225;sle&#237;r&#243; r&#233;sz Application-Content bejegyz&#233;se &#252;res, &#237;gy a rendszer egyetlen bundle elemet sem telep&#237;t.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: A rendszer nem tudja olvasni a(z) {0} EBA f&#225;jlban l&#233;v&#337; Java EE alkalmaz&#225;sle&#237;r&#243; f&#225;jlt.
  </MsgText>
  <Explanation>
    IOException t&#246;rt&#233;nt, mik&#246;zben a rendszer v&#225;llalati bundle-arch&#237;vumban (EBA) l&#233;v&#337; Java EE alkalmaz&#225;sle&#237;r&#243; f&#225;jlt olvasott.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;sle&#237;r&#243; f&#225;jl nem s&#233;r&#252;lt-e, olvashat&#243;-e, &#233;s hogy a megfelel&#337; enged&#233;lyek vannak-e hozz&#225; be&#225;ll&#237;tva!
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: A rendszer nem tal&#225;lt {0} JNDI n&#233;vvel &#233;s {1} t&#237;pussal megegyez&#337; er&#337;forr&#225;s-hivatkoz&#225;st a(z) {2} c&#233;lon a(z) {3} webmodul er&#337;forr&#225;s-hivatkoz&#225;shoz, amelyet a(z) {5} v&#225;ltozat&#250; {4} csomagban adtak meg.
  </MsgText>
  <Explanation>
    A webalkalmaz&#225;s-arch&#237;vumban (WAR) l&#233;v&#337; er&#337;forr&#225;s-hivatkoz&#225;sokat tartalmaz&#243; v&#225;llalati csomagarch&#237;vum (EBA) JNDI nevet ad meg egy olyan er&#337;forr&#225;s-hivatkoz&#225;shoz, amely nem l&#233;tezik a JNDI n&#233;vt&#233;rben.
  </Explanation>
  <UserResponse>
    Ha az er&#337;forr&#225;s-hivatkoz&#225;snak a JNDI n&#233;vter&#252;leten kellene lennie, vagy k&#246;ss&#246;n objektumot a n&#233;vhez, vagy jav&#237;tsa az er&#337;forr&#225;s-hivatkoz&#225;st &#233;s friss&#237;tse az EBA-t!
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Nem hozhat&#243; l&#233;tre alap&#233;rtelmezett k&#246;t&#233;s a(z) {0} EJB-hivatkoz&#225;shoz a(z) {2} v&#225;ltozat&#250;, {3} fel&#252;lettel rendelkez&#337; {1} csomagban, mivel kett&#337; vagy t&#246;bb lehets&#233;ges k&#246;t&#233;s l&#233;tezik. A hivatkoz&#225;s a k&#246;vetkez&#337; EJB-komponensekhez k&#246;thet&#337;: {4}.
  </MsgText>
  <Explanation>
    Az alap&#233;rtelmezett k&#246;t&#233;seket lev&#225;lasztott EJB hivatkoz&#225;sokhoz kell l&#233;trehozni. A rendszer t&#246;bb olyan EJB-komponenst is tal&#225;lt, amelyhez ez a hivatkoz&#225;s k&#246;thet&#337; lenne.
  </Explanation>
  <UserResponse>
    K&#246;sse a hivatkoz&#225;st adott EJB-komponenshez, vagy jav&#237;tsa az alkalmaz&#225;st.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: A(z) {0} hiteles&#237;t&#233;si &#225;ln&#233;v konfigur&#225;l&#225;sa nem megfelel&#337;. Nem lehet alkalmaz&#225;s hiteles&#237;t&#233;si t&#237;pussal rendelkez&#337; &#225;lnevet hivatkoz&#225;shoz k&#246;tni.
  </MsgText>
  <Explanation>
    Alkalmaz&#225;s hiteles&#237;t&#233;si t&#237;pussal rendelkez&#337; hiteles&#237;t&#233;si &#225;lneveket nem lehet Blueprint er&#337;forr&#225;s-hivatkoz&#225;shoz k&#246;tni.
  </Explanation>
  <UserResponse>
    T&#225;vol&#237;tsa el a hiteles&#237;t&#233;si &#225;lnevet a kapcsol&#243;d&#243; er&#337;forr&#225;s-hivatkoz&#225;sb&#243;l!
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: A(z) {1} csomaghoz megadott {0} virtu&#225;lis gazdag&#233;p nem l&#233;tezik.
  </MsgText>
  <Explanation>
    A rendszer egy webalkalmaz&#225;s csomagot (WAB) olyan virtu&#225;lis gazdag&#233;pre k&#237;s&#233;relt meg lek&#233;pezni, amely nem &#233;rv&#233;nyes.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy a megadott virtu&#225;lis gazdag&#233;p l&#233;tezik-e.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: Az EBA f&#225;jl {0} alkalmaz&#225;sle&#237;r&#243;ja olyan csomagokat sorol fel az Application-Content fejl&#233;cben, amelyek a Use-Bundle fejl&#233;cben is szerepelnek.
  </MsgText>
  <Explanation>
    Az APPLICATION.MF Application-Content fejl&#233;c&#233;ben felsorolt bundle neveket nem lehet a Use-Bundle fejl&#233;cben is felsorolni a bundle verzi&#243;kt&#243;l f&#252;ggetlen&#252;l.
  </Explanation>
  <UserResponse>
    V&#225;ltoztassa meg a v&#225;llalati bundle-arch&#237;vum (EBA) csomagol&#225;s&#225;t &#250;gy, hogy a bundle nevek ne szerepeljenek megkett&#337;zve az Application-Content &#233;s Use-Bundle fejl&#233;cekben!
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: A(z) {0} Composite Bundle Archive (CBA) &#233;rv&#233;nytelen. A CBA csomagjai &#225;ltal import&#225;lt csomagok hi&#225;nyoznak a CBA le&#237;r&#243;f&#225;jl Import-Package fejl&#233;c&#233;b&#337;l. A k&#246;vetkez&#337; probl&#233;m&#225;kat jelentette a rendszer: {1}
  </MsgText>
  <Explanation>
    Ha egy CBA-arch&#237;vumban tal&#225;lhat&#243; csomag olyan szoftvercsomagot haszn&#225;l, amely a csomagban nem tal&#225;lhat&#243; meg vagy a CBA egy m&#225;sik csomagja export&#225;lta, a CBA-arch&#237;vumnak import&#225;lnia kell a szoftvercsomagot.
  </Explanation>
  <UserResponse>
    Jav&#237;tsa ki a COMPOSITEBUNDLE.MF &#246;sszetett le&#237;r&#243;f&#225;jlt, hogy a CBA import&#225;ljon minden, a CBA csomagjai &#225;ltal haszn&#225;lt, &#233;s a CBA-arch&#237;vumon bel&#252;l m&#225;sk&#233;nt rendelkez&#233;sre nem &#225;ll&#243; szoftvercsomagot.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: A(z) {2} v&#225;ltozat&#250; {1} csomagban l&#233;v&#337; {0} EJB-komponens t&#246;bb lek&#233;pez&#233;ssel is rendelkezik a(z) {3} fel&#252;letre k&#246;t&#233;si f&#225;jlj&#225;ban. A lek&#233;pez&#233;sek a(z) {4} &#233;s a(z) {5}.
  </MsgText>
  <Explanation>
    A csomagban szerepl&#337; EJB k&#246;t&#233;si f&#225;jl f&#233;lre&#233;rthet&#337; lek&#233;pez&#233;si konfigur&#225;ci&#243;s inform&#225;ci&#243;kat tartalmaz egy EJB-fel&#252;lethez.
  </Explanation>
  <UserResponse>
    Jav&#237;tsa a k&#246;t&#233;si f&#225;jlt &#250;gy, hogy csak egy konfigur&#225;lt lek&#233;pez&#233;s legyen minden egyes EJB-fel&#252;lethez.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: A(z) nev&#369; {0} &#246;ssze&#225;ll&#237;t&#225;si egys&#233;g nem tal&#225;lhat&#243; az aktu&#225;lis cell&#225;ban.
  </MsgText>
  <Explanation>
    A megadott n&#233;v nem egyezik egy l&#233;tez&#337; &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ggel sem.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze az &#246;ssze&#225;ll&#237;t&#225;si egys&#233;g nev&#233;t.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: A(z) {0} EBA f&#225;jlban tal&#225;lhat&#243; egyik MANIFEST.MF f&#225;jl Extension-List fejl&#233;cet tartalmaz. Ennek a fejl&#233;cnek a konvert&#225;l&#225;sa nem t&#225;mogatott.
  </MsgText>
  <Explanation>
    Megpr&#243;b&#225;lt &#225;talak&#237;tani egy nagyv&#225;llalati arch&#237;vum (EAR) f&#225;jlt v&#225;llalati bundle-arch&#237;vum (EBA) f&#225;jll&#225;, azonban az EAR olyan MANIFEST.MF le&#237;r&#243;t tartalmaz, amely Extension-List fejl&#233;cet tartalmaz, amelynek konvert&#225;l&#225;sa nem t&#225;mogatott. Az EAR f&#225;jl az Extension-List fejl&#233;ccel azonos&#237;tja azokat a k&#252;ls&#337; JAR arch&#237;vumokat, amelyekre a fut&#225;s sor&#225;n sz&#252;ks&#233;ge van.
  </Explanation>
  <UserResponse>
    Gy&#337;z&#337;dj&#246;n meg r&#243;la, hogy az Extension-List MANIFEST.MF fejl&#233;cben szerepl&#337; k&#252;ls&#337; JAR f&#225;jlok bundle form&#225;ban el&#233;rhet&#337;k a bundle-t&#225;rban.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: A(z) {0} inform&#225;ci&#243;tulajdon nem oldhat&#243; fel. A(z){1} bundle-ra van sz&#252;ks&#233;ge, amely nem szerepel az alkalmaz&#225;sle&#237;r&#243;, (APPLICATION.MF), Application-Content fejl&#233;c&#233;ben. Ez a bundle a(z) {2} csomagot import&#225;lja a(z) {3} bundle-b&#337;l, amely az Application-Content fejl&#233;cben van felsorolva.
  </MsgText>
  <Explanation>
    Az alkalmaz&#225;st nem konfigur&#225;lt&#225;k helyesen. Megosztott bundle nem import&#225;lhat csomagot lev&#225;lasztott bundle elemb&#337;l. Az Application-Content fejl&#233;cben felsorolt bundle elemek le vannak v&#225;lasztva &#233;s csak az abban a fejl&#233;cben szerepl&#337; egy&#233;b bundle elemeknek biztos&#237;thatnak programcsomagokat.
  </Explanation>
  <UserResponse>
    V&#225;ltoztassa meg az alkalmaz&#225;s csomagol&#225;s&#225;t vagy konfigur&#225;ci&#243;j&#225;t &#250;gy, hogy a Use-Bundle fejl&#233;cben felsorolt vagy a felold&#243; &#225;ltal hozz&#225;adott bundle elemek ne ig&#233;nyeljenek programcsomagokat az Application-Content fejl&#233;cben felsorolt bundle elemekt&#337;l!
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): az EJBMappingsStep nem futott, &#233;s el kell v&#233;gezni.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: A(z) {0} eszk&#246;zt nem lehet sem a(z) {2} biztons&#225;gi tartom&#225;nyban l&#233;v&#337; {1} c&#233;lra, sem {4} biztons&#225;gi tartom&#225;nyban l&#233;v&#337; {3} c&#233;lra telep&#237;teni.
  </MsgText>
  <Explanation>
    Ahhoz, hogy eszk&#246;zt egyn&#233;l t&#246;bb c&#233;lra lehessen telep&#237;teni, minden c&#233;lnak ugyanabban a biztons&#225;gi tartom&#225;nyban kell lennie.
  </Explanation>
  <UserResponse>
    V&#225;ltoztassa a telep&#237;t&#233;si c&#233;lokat &#250;gy, hogy olyan halmazt v&#225;laszt ki, amely egyetlen biztons&#225;gi tartom&#225;nyba esik!
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: A(z) {0} CBA (Composite Bundle Archive) &#246;sszetett le&#237;r&#243;ja tartalmaz CompositeBundle-ExportService fejl&#233;cet, azonban a CBA csomagban meghat&#225;rozott szolg&#225;ltat&#225;sok egyik  sem illeszkedik erre a sz&#369;r&#337;re.
  </MsgText>
  <Explanation>
    Az &#246;sszetett csomag le&#237;r&#243;f&#225;jlja meghat&#225;roz egyCompositeBundle-ExportService fejl&#233;cet, azonban egy Blueprint szolg&#225;ltat&#225;sdeklar&#225;ci&#243; sem illeszkedik erre a sz&#369;r&#337;re.
  </Explanation>
  <UserResponse>
    Vagy adja hozz&#225; a hi&#225;nyz&#243; Blueprint szolg&#225;ltat&#225;sdeklar&#225;ci&#243;kat a CBA tartalm&#225;hoz, vagy jav&#237;tsa a CompositeBundle-ExportService fejl&#233;cet a csomagle&#237;r&#243;f&#225;jlj&#225;ban (COMPOSITEBUNDLE.MF).
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: A(z) {2} v&#225;ltozat&#250; {1} csomagban l&#233;v&#337; {0} EJB-komponensben meg van hat&#225;rozva egy egyszer&#369; lek&#233;pez&#233;si n&#233;v, de rendelkezik specifikus lek&#233;pez&#233;sekkel is k&#246;t&#233;si f&#225;jlj&#225;ban.
  </MsgText>
  <Explanation>
    A csomag &#225;ltal tartalmazott EJB k&#246;t&#233;si f&#225;jl &#233;rv&#233;nytelen lek&#233;pez&#233;si konfigur&#225;ci&#243;t tartalmaz egy EJB-komponenshez.
  </Explanation>
  <UserResponse>
    Jav&#237;tsa a k&#246;t&#233;sig f&#225;jlt &#250;gy, hogy csak egy egyszer&#369; lek&#233;pez&#233;si nevet vagy specifikus lek&#233;pez&#233;si konfigur&#225;ci&#243; inform&#225;ci&#243;kat tartalmazzon, de ne mindkett&#337;t.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Bels&#337; hiba t&#246;rt&#233;nt. Nem lehet elt&#225;vol&#237;tani a(z) {0} egy lev&#233;lk&#246;nyvt&#225;r&#225;t annak &#233;rdek&#233;ben, hogy lehet&#337;v&#233; v&#225;ljon egy k&#246;nyvt&#225;r &#225;tnevez&#233;se.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Bels&#337; hiba t&#246;rt&#233;nt. Nem lehet kibontani a v&#225;llalati csomagarch&#237;vumot (EBA), nem adtak meg kibont&#225;si k&#246;nyvt&#225;rat a(z) {0} elemhez tartoz&#243; konfigur&#225;ci&#243;ban.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: Megk&#237;s&#233;relte egy OSGi alkalmaz&#225;seszk&#246;z friss&#237;t&#233;s&#233;t. Ez nem t&#225;mogatott. Az OSGi alkalmaz&#225;seszk&#246;z&#246;k friss&#237;t&#233;se az OSGi alkalmaz&#225;seszk&#246;z&#246;k konfigur&#225;ci&#243;s oldal&#225;n tal&#225;lhat&#243; &quot;Az alkalmaz&#225;sban tal&#225;lhat&#243; csomagelemek verzi&#243;inak friss&#237;t&#233;se&quot; panel haszn&#225;lat&#225;val hajthat&#243; v&#233;gre.
  </MsgText>
  <Explanation>
    Az OSGi alkalmaz&#225;seszk&#246;z&#246;k friss&#237;t&#233;se &#250;j bin&#225;ris f&#225;jllal nem t&#225;mogatott.
  </Explanation>
  <UserResponse>
    Ha a l&#233;tez&#337; eszk&#246;z&#246;n bel&#252;li csomagv&#225;ltozatok friss&#237;t&#233;s&#233;n&#233;l t&#246;bbre van sz&#252;ks&#233;g, el kell t&#225;vol&#237;tania az eszk&#246;zt, miel&#337;tt import&#225;ln&#225; azt az eszk&#246;zt, amelyre lecser&#233;li. Alternat&#237;v megold&#225;sk&#233;nt &#250;j csomagokat is adhat egy l&#233;tez&#337; alkalmaz&#225;shoz &#250;gy, hogy becsomagolja azokat egy &#246;sszetett csomagarch&#237;vumm&#225; (CBA) &#233;s ezt a CBA arch&#237;vumot kiterjeszt&#233;sk&#233;nt adja hozz&#225; az &#246;ssze&#225;ll&#237;t&#225;si egys&#233;ghez.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Nincs MDB ActivationSpec JNDI n&#233;v be&#225;ll&#237;tva a(z) {0} komponenshez a(z) {2} verzi&#243;j&#250; {1} k&#246;tegben, a(z) {3} c&#233;lon.
  </MsgText>
  <Explanation>
    Az MDB figyel&#337; k&#246;t&#233;si ActivationSpec JNDI neve nincs be&#225;ll&#237;tva.
  </Explanation>
  <UserResponse>
    Be kell &#225;ll&#237;tani egy ActivationSpec JNDI hivatkoz&#225;st az MDB-hez.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Nem lehet &#225;tnevezni a(z) {0} f&#225;jlt {1} n&#233;vre a(z){2} v&#225;llalati csomagarch&#237;vum f&#225;jl kibont&#225;s&#225;nak r&#233;szek&#233;nt.
  </MsgText>
  <Explanation>
    A megadott EBA f&#225;jl kibont&#225;s&#225;nak befejez&#233;s&#233;hez egy f&#225;jlt &#225;t kell nevezni. Ez az &#225;tnevez&#233;s nem j&#225;rt sikerrel.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;skiszolg&#225;l&#243;nak van-e jogosults&#225;ga a f&#225;jl &#225;tnevez&#233;s&#233;hez.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: A(z) {0} Composite Bundle Archive (CBA) &#233;rv&#233;nytelen. A k&#246;vetkez&#337;, az &#246;sszetett le&#237;r&#243;f&#225;jlban felsorolt export&#225;lt szoftvercsomagokat nem a CBA-arch&#237;vumban tal&#225;lhat&#243; csomagok export&#225;lt&#225;k: {1}
  </MsgText>
  <Explanation>
    Egy CBA csak olyan szoftvercsomagokat k&#233;pes export&#225;lni, amelyeket a CBA-arch&#237;vumban tal&#225;lhat&#243; csomagok export&#225;ltak.
  </Explanation>
  <UserResponse>
    Adja hozz&#225; a hi&#225;nyz&#243; export&#225;l&#225;si szoftvercsomagokat a CBA csomagjaihoz, vagy t&#225;vol&#237;tsa el a nem kiel&#233;g&#237;t&#337; export&#225;l&#225;sok r&#233;szleteit a COMPOSITEBUNDLE.MF &#246;sszetett le&#237;r&#243;f&#225;jlb&#243;l.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: A rendszer nem tudja hozz&#225;adni a(z) {0} eszk&#246;zt, mivel az &#225;ltala ig&#233;nyelt csomagokat nem t&#246;lt&#246;tt&#233;k le. A bundle let&#246;lt&#233;s&#233;hez mentse el a f&#337; konfigur&#225;ci&#243;ban tett m&#243;dos&#237;t&#225;sokat az eszk&#246;z import&#225;l&#225;sa ut&#225;n!
  </MsgText>
  <Explanation>
    Olyan eszk&#246;zt k&#237;s&#233;relt meg felvenni, amelyhez egy vagy t&#246;bb bundle elemet kell let&#246;lteni egy t&#225;rb&#243;l. Vagy nem kezd&#337;d&#246;tt el a let&#246;lt&#233;s, vagy m&#233;g nem fejez&#337;d&#246;tt be.
  </Explanation>
  <UserResponse>
    Ha nem mentette el a m&#243;dos&#237;t&#225;sokat az eszk&#246;z import&#225;l&#225;sa ut&#225;n, mentse el azokat most! V&#225;rja meg, hogy a bundle let&#246;lt&#233;s befejez&#337;dj&#246;n, majd pr&#243;b&#225;lja meg &#250;jra felvenni az eszk&#246;zt az &#252;zleti szint&#369; alkalmaz&#225;sba (BLA)! Az eszk&#246;z bundle let&#246;lt&#233;s&#233;nek &#225;llapot&#225;t megtekintheti az adminisztr&#225;ci&#243;s kezel&#337;pult eszk&#246;z r&#233;szletek panelj&#225;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: A telep&#237;t&#233;sle&#237;r&#243; tartalma helytelen. A k&#246;vetkez&#337; tov&#225;bbi bundle elemekre van sz&#252;ks&#233;g: {0}.
  </MsgText>
  <Explanation>
    Az import&#225;land&#243; telep&#237;t&#233;sle&#237;r&#243; nem tartalmazza a v&#225;llalati csomagarch&#237;vum (EBA) eszk&#246;z felold&#225;s&#225;hoz sz&#252;ks&#233;ges &#246;sszes csomagot.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az &#250;j telep&#237;t&#233;sle&#237;r&#243; (DEPLOYMENT.MF) tartalmazza-e a kiv&#233;tel&#252;zenetben felsorolt &#246;sszes csomagot. Ne szerkessze a telep&#237;t&#233;sle&#237;r&#243;t manu&#225;lisan. Sz&#252;ks&#233;g eset&#233;n t&#225;vol&#237;tsa el a telep&#237;t&#233;sle&#237;r&#243;t az EBA f&#225;jlb&#243;l. Emiatt a rendszer friss telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt fog el&#337;&#225;ll&#237;tani az EBA import&#225;l&#225;sakor.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: A(z) {0} k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </MsgText>
  <Explanation>
    A megadott k&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy l&#233;tezik-e a t&#225;rol&#225;si hely, &#233;s hogy a term&#233;k rendelkezik-e a k&#246;nyvt&#225;r l&#233;trehoz&#225;s&#225;hoz sz&#252;ks&#233;ges enged&#233;lyekkel!
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: Nem lehet export&#225;lni a(z) {0} elemet, mert az &#225;ltala ig&#233;nyelt {1} csomag nem t&#246;lt&#337;d&#246;tt le teljesen.
  </MsgText>
  <Explanation>
    Olyan elemet pr&#243;b&#225;lt export&#225;lni, amely egy vagy t&#246;bb csomag t&#225;rb&#243;l val&#243; let&#246;lt&#233;s&#233;t ig&#233;nyli. Vagy nem kezd&#337;d&#246;tt el a let&#246;lt&#233;s, vagy m&#233;g nem fejez&#337;d&#246;tt be.
  </Explanation>
  <UserResponse>
    Ha nem mentette a v&#225;ltoz&#225;sokat az elem import&#225;l&#225;sa ut&#225;n, mentse &#337;ket most. V&#225;rja meg, hogy a csomag let&#246;lt&#233;se befejez&#337;dj&#246;n, majd pr&#243;b&#225;lja meg &#250;jra export&#225;lni az elemet.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Bels&#337; hiba t&#246;rt&#233;nt. A DeploymentManifestManager szolg&#225;ltat&#225;s nem &#233;rhet&#337; el az OSGi szolg&#225;ltat&#225;s-nyilv&#225;ntart&#225;sban.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: A rendszer nem tudja feloldani az EBA f&#225;jlt. A mell&#233;kelt telep&#237;t&#233;sle&#237;r&#243; nem &#233;rv&#233;nyes ezen a rendszeren. Kiv&#233;tel: {0}.
  </MsgText>
  <Explanation>
    A telep&#237;t&#233;sle&#237;r&#243; a sz&#252;ks&#233;ges csomagok v&#225;ltozat&#225;t sorolja fel. A rendszer nem tudja feloldani ezeket a csomagv&#225;ltozatokat. Ha egy telep&#237;t&#233;sle&#237;r&#243; egy EBA f&#225;jl r&#233;sze, a felold&#243; csak a le&#237;r&#243;ban megadott csomagv&#225;ltozatokat haszn&#225;lja. A rendszeren rendelkez&#233;sre &#225;llhatnak egy&#233;b &#233;rv&#233;nyes csomagv&#225;ltozatok, azonban a rendszer nem haszn&#225;lja fel azokat, mert nincsenek megadva a telep&#237;t&#233;sle&#237;r&#243;ban.
  </Explanation>
  <UserResponse>
    Ha az alkalmaz&#225;snak telep&#237;t&#233;sle&#237;r&#243;t kell haszn&#225;lnia, p&#233;ld&#225;ul annak biztos&#237;t&#225;s&#225;ra, hogy pontosan ugyanaz a csomag konfigur&#225;ci&#243; fusson t&#246;bb k&#252;l&#246;nb&#246;z&#337; k&#246;rnyezeten, haszn&#225;lja a kiv&#233;telben megadott inform&#225;ci&#243;t a sz&#252;ks&#233;ges csomagv&#225;ltozat azonos&#237;t&#225;s&#225;ra, majd tegye ezeket el&#233;rhet&#337;v&#233; a rendszer sz&#225;m&#225;ra. Ha az adott alkalmaz&#225;snak nincs sz&#252;ks&#233;ge a fel&#252;gyeletnek erre a tov&#225;bbi szintj&#233;re, t&#225;vol&#237;tsa el a telep&#237;t&#233;sle&#237;r&#243;t. Ne szerkessze a telep&#237;t&#233;sle&#237;r&#243;t manu&#225;lisan.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: Az alkalmaz&#225;s le&#237;r&#243;f&#225;jlj&#225;nak verzi&#243;sz&#225;mak&#233;nt megadott {0} &#233;rt&#233;k nem t&#225;mogatott. A t&#225;mogatott v&#225;ltozat: {1}.
  </MsgText>
  <Explanation>
    Az APPLICATION.MF f&#225;jlban azApplication-ManifestVersion fejl&#233;c sz&#225;m&#225;ra megadott &#233;rt&#233;k helytelen.
  </Explanation>
  <UserResponse>
    Jav&#237;tsa az Application-ManifestVersion &#233;rt&#233;k&#233;t az APPLICATION.MF f&#225;jlban.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Az EBA f&#225;jlon bel&#252;l tal&#225;lhat&#243; telep&#237;t&#233;sle&#237;r&#243; &#225;ltal megadott k&#246;vetelm&#233;nyek nem el&#233;g&#237;thet&#337;ek ki. Az el&#337;&#225;ll&#237;tott kiv&#233;tel: {0}.
  </MsgText>
  <Explanation>
    Telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt tartalmaz&#243; EBA f&#225;jlt pr&#243;b&#225;lt meg import&#225;lni. A f&#225;jl &#225;ltal megadott k&#246;vetelm&#233;nyeket nem lehetett kiel&#233;g&#237;teni.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze a telep&#237;t&#233;sle&#237;r&#243; f&#225;jl tartalm&#225;t, &#233;s ellen&#337;rizze, hogy kompatibilis-e az a rendszer, amelyre az EBA f&#225;jlt telep&#237;ti. Ellen&#337;rizze, hogy minden sz&#252;ks&#233;ges bels&#337; vagy k&#252;ls&#337; csomagt&#225;rat be&#225;ll&#237;tottak-e. Ne szerkessze a telep&#237;t&#233;sle&#237;r&#243;t manu&#225;lisan. Sz&#252;ks&#233;g eset&#233;n t&#225;vol&#237;tsa el a telep&#237;t&#233;sle&#237;r&#243;t az EBA f&#225;jlb&#243;l. Emiatt a rendszer friss telep&#237;t&#233;sle&#237;r&#243; f&#225;jlt fog el&#337;&#225;ll&#237;tani az EBA import&#225;l&#225;sakor.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: A(z) {0} EBA f&#225;jl Application-Content elemet ad meg alkalmaz&#225;sle&#237;r&#243; f&#225;jlj&#225;ban, de a bejegyz&#233;s &#252;res.
  </MsgText>
  <Explanation>
    A v&#225;llalati bundle-arch&#237;vum (EBA) &#252;res Application-Content fejl&#233;cet ad meg az alkalmaz&#225;sle&#237;r&#243; f&#225;jlj&#225;ban (application.mf). Ha meg van adva, a bejegyz&#233;snek legal&#225;bb egy &#233;rv&#233;nyes bundle elemet kell tartalmaznia.
  </Explanation>
  <UserResponse>
    M&#243;dos&#237;tsa az Application-Content fejl&#233;cet az application.mf f&#225;jlban!
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: Nem tal&#225;lhat&#243; a(z) {0} JNDI n&#233;vnek megfelel&#337; MDB c&#233;l a(z) {1} c&#233;lon a(z) {4} verzi&#243;j&#250; {3} k&#246;tegben l&#233;v&#337; {2} komponens &#225;ltal haszn&#225;lt er&#337;forr&#225;shoz.
  </MsgText>
  <Explanation>
    A megadott MDB figyel&#337; k&#246;t&#233;si c&#233;l hivatkoz&#225;s JNDI neve nem l&#233;tezik.
  </Explanation>
  <UserResponse>
    Ha a hivatkoz&#225;snak a JNDI n&#233;vter&#252;leten kellene lennie, vagy k&#246;ss&#246;n objektumot a n&#233;vhez, vagy jav&#237;tsa a hivatkoz&#225;st &#233;s friss&#237;tse az EBA-t!
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: A(z) {0} EBA f&#225;jl nem ad meg Application-Content r&#233;szt &#233;s nem tartalmaz &#233;rv&#233;nyes csomagokat.
  </MsgText>
  <Explanation>
    A v&#225;llalati csomagarch&#237;vum (EBA) f&#225;jlnak tartalmaznia kell legal&#225;bb egy &#233;rv&#233;nyes OSGi csomagot vagy webalkalmaz&#225;s-arch&#237;vum (WAR) f&#225;jlt, vagy fel kell soroljon legal&#225;bb egy OSGi csomagot az alkalmaz&#225;sle&#237;r&#243; f&#225;jlj&#225;nak Application-Content fejl&#233;c&#233;ben.
  </Explanation>
  <UserResponse>
    M&#243;dos&#237;tsa az EBA f&#225;jlt &#250;gy, hogy legal&#225;bb egy &#233;rv&#233;nyes bundle elemet vagy WAR f&#225;jlt tartalmazzon (&#233;rt&#233;k szerint belefoglalva), vagy soroljon fel legal&#225;bb egy bundle elemet az alkalmaz&#225;sle&#237;r&#243; f&#225;jlj&#225;nak, application.mf, Application-Content fejl&#233;c&#233;ben (hivatkoz&#225;s &#250;tj&#225;n belefoglalva).
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: K&#246;nyvt&#225;r nem hozhat&#243; l&#233;tre: {0}
  </MsgText>
  <Explanation>
    Hiba t&#246;rt&#233;nt az elem export&#225;l&#225;sa sor&#225;n a sz&#252;ks&#233;ges &#250;tvonaln&#233;v l&#233;trehoz&#225;sa k&#246;zben.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az alkalmaz&#225;skiszolg&#225;l&#243;nak van-e jogosults&#225;ga az &#250;tvonaln&#233;v l&#233;trehoz&#225;s&#225;hoz.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
