<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: Bels&#337; hiba t&#246;rt&#233;nt. Az &#246;sszetettcsomag-le&#237;r&#243;nak pontosan egy Bundle-SymbolicName bejegyz&#233;st kell tartalmaznia. A rendszer a k&#246;vetkez&#337; bejegyz&#233;st tal&#225;lta: {0}.
  </MsgText>
  <Explanation>
    A fut&#225;sidej&#369; k&#246;rnyezet megk&#237;s&#233;relte feldolgozni egy &#246;sszetett csomag metaadatait, de nem volt k&#233;pes meg&#225;llap&#237;tani a csomag szimbolikus nev&#233;t.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: Szintaktikai hiba ordult el&#337; a(z) {1} azonos&#237;t&#243;j&#250; elem &apos;&apos;{0}&apos;&apos; tervsz&#369;r&#337; karaktersorozat&#225;nak &#233;rtelmez&#233;s&#233;re tett k&#237;s&#233;rlet sor&#225;n: {2}
  </MsgText>
  <Explanation>
    A rendszer InvalidSyntaxException kiv&#233;telt dobott a megadott azonos&#237;t&#243;j&#250; elem sz&#369;r&#337; karaktersorozat&#225;nak &#233;rtelmez&#233;s&#233;re tett k&#237;s&#233;rlet sor&#225;n.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze a megadott sz&#369;r&#337; karaktersorozat szintaktik&#225;j&#225;nak helyess&#233;g&#233;t.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: Bels&#337; hiba t&#246;rt&#233;nt. A csomagle&#237;r&#243;nak pontosan egy Bundle-SymbolicName bejegyz&#233;st kell tartalmaznia. A rendszer a k&#246;vetkez&#337; bejegyz&#233;st tal&#225;lta: {0}.
  </MsgText>
  <Explanation>
    A fut&#225;sidej&#369; k&#246;rnyezet megk&#237;s&#233;relte feldolgozni egy csomag metaadatait, de nem volt k&#233;pes meghat&#225;rozni a csomag szimbolikus nev&#233;t.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: Bels&#337; hiba t&#246;rt&#233;nt. A csomagr&#233;szle&#237;r&#243;nak pontosan egy Fragment-Host bejegyz&#233;st kell meghat&#225;roznia. A rendszer a k&#246;vetkez&#337; bejegyz&#233;st tal&#225;lta: {0}.
  </MsgText>
  <Explanation>
    A fut&#225;si k&#246;rnyezet megk&#237;s&#233;relte feldolgozni egy csomagr&#233;sz metaadatait, de nem volt k&#233;pes meg&#225;llap&#237;tani a r&#233;szt tartalmaz&#243; gazdag&#233;p csomagj&#225;t.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: Bels&#337; hiba t&#246;rt&#233;nt. Nem lehetett feldolgozni a(z) {0} szimbolikus nev&#369; &#233;s {1} le&#237;r&#243; v&#225;ltozat&#250; &#246;sszetett csomagot.
  </MsgText>
  <Explanation>
    Az &#246;sszetett csomagle&#237;r&#243;nak egy &#233;rv&#233;nyes Bundle-SymbolicName &#233;s CompositeBundle-ManifestVersion bejegyz&#233;st is tartalmaznia kell.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az &#246;sszes &#246;sszetett csomag tartalmaz-e &#233;rv&#233;nyes Bundle-SymbolicName &#233;s CompositeBundle-ManifestVersion bejegyz&#233;st is a le&#237;r&#243;f&#225;jlj&#225;ban.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: Bels&#337; hiba t&#246;rt&#233;nt. Nem lehetett feldolgozni a(z) {0} szimbolikus nev&#369; &#233;s {1} le&#237;r&#243; v&#225;ltozat&#250; csomagot.
  </MsgText>
  <Explanation>
    A csomagle&#237;r&#243;nak egy &#233;rv&#233;nyes Bundle-SymbolicName &#233;s Bundle-ManifestVersion bejegyz&#233;st is tartalmaznia kell.
  </Explanation>
  <UserResponse>
    Ellen&#337;rizze, hogy az &#246;sszes csomag tartalmaz-e &#233;rv&#233;nyes Bundle-SymbolicName &#233;s Bundle-ManifestVersion bejegyz&#233;st is a le&#237;r&#243;f&#225;jlj&#225;ban.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
