<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12399;&#12289;Bundle-SymbolicName &#12456;&#12531;&#12488;&#12522;&#12540;&#12434; 1 &#12388;&#12398;&#12415;&#21547;&#12416;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#27425;&#12398;&#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;{0}&#12290;
  </MsgText>
  <Explanation>
    &#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20966;&#29702;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: ID {1} &#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398; Blueprint &#12501;&#12451;&#12523;&#12479;&#12540;&#12539;&#12473;&#12488;&#12522;&#12531;&#12464;&#12300;{0}&#12301;&#12434;&#35299;&#26512;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12289;&#27083;&#25991;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;: {2}
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; ID &#12398;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12501;&#12451;&#12523;&#12479;&#12540;&#12539;&#12473;&#12488;&#12522;&#12531;&#12464;&#12434;&#35299;&#26512;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12289;InvalidSyntaxException &#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#25351;&#23450;&#12373;&#12428;&#12383; ID &#12398;&#12501;&#12451;&#12523;&#12479;&#12540;&#12539;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27083;&#25991;&#12364;&#27491;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12399;&#12289;Bundle-SymbolicName &#12456;&#12531;&#12488;&#12522;&#12540;&#12434; 1 &#12388;&#12398;&#12415;&#21547;&#12416;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#27425;&#12398;&#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;{0}&#12290;
  </MsgText>
  <Explanation>
    &#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12399;&#12289;&#12496;&#12531;&#12489;&#12523;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20966;&#29702;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#12289;Fragment-Host &#12456;&#12531;&#12488;&#12522;&#12540;&#12434; 1 &#12388;&#12398;&#12415;&#23450;&#32681;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#27425;&#12398;&#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;{0}&#12290;
  </MsgText>
  <Explanation>
    &#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20966;&#29702;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12398;&#12507;&#12473;&#12488;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12471;&#12531;&#12508;&#12523;&#21517;&#12364; {0} &#12391;&#12289;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364; {1} &#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12434;&#20966;&#29702;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12399;&#12289;&#26377;&#21177;&#12394; Bundle-SymbolicName &#12392; CompositeBundle-ManifestVersion &#12398;&#20001;&#26041;&#12398;&#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12391;&#12289;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#26377;&#21177;&#12394; Bundle-SymbolicName &#12456;&#12531;&#12488;&#12522;&#12540;&#12362;&#12424;&#12403; CompositeBundle-ManifestVersion &#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12471;&#12531;&#12508;&#12523;&#21517;&#12364; {0} &#12391;&#12289;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364; {1} &#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#20966;&#29702;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12399;&#12289;&#26377;&#21177;&#12394; Bundle-SymbolicName &#12392; Bundle-ManifestVersion &#12398;&#20001;&#26041;&#12398;&#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12377;&#12409;&#12390;&#12398;&#12496;&#12531;&#12489;&#12523;&#12391;&#12289;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#26377;&#21177;&#12394; Bundle-SymbolicName &#12456;&#12531;&#12488;&#12522;&#12540;&#12362;&#12424;&#12403; Bundle-ManifestVersion &#12456;&#12531;&#12488;&#12522;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
