<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bundle.download/src/com/ibm/ws/eba/bundle/download/messages/EBABundleDownloadMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAK0017E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0017E" varFormat="Java">
    BUNDLE_DOWNLOAD_0017E=CWSAK0017E: UTE &#12496;&#12531;&#12489;&#12523;&#12391;&#12354;&#12427;&#12289;&#12496;&#12531;&#12489;&#12523; {0} &#12398;&#20877;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#35201;&#27714;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290; UTE &#12496;&#12531;&#12489;&#12523;&#12399;&#20877;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    UTE &#12496;&#12531;&#12489;&#12523;&#12399;&#20877;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12371;&#12398; UTE &#12496;&#12531;&#12489;&#12523;&#12395;&#23550;&#12375;&#12390;&#20877;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#35201;&#27714;&#12373;&#12428;&#12383;&#29702;&#30001;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0001E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0001E" varFormat="Java">
    BUNDLE_DOWNLOAD_0001E=CWSAK0001E: &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#12501;&#12449;&#12452;&#12523; {1} &#12395;&#21517;&#21069;&#22793;&#26356;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12449;&#12452;&#12523;&#12399;&#21517;&#21069;&#22793;&#26356;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12364;&#26377;&#21177;&#12391;&#12289;&#12525;&#12483;&#12463;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0007E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0007E" varFormat="Java">
    BUNDLE_DOWNLOAD_0007E=CWSAK0007E: &#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12394;&#12356;&#21407;&#22240;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0010E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0010E" varFormat="Java">
    BUNDLE_DOWNLOAD_0010E=CWSAK0010E: &#12496;&#12531;&#12489;&#12523; {1} &#12364;&#20869;&#37096;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12383;&#12417;&#12289;&#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#12450;&#12475;&#12483;&#12488;&#12539;&#12522;&#12473;&#12488; {0} &#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12450;&#12475;&#12483;&#12488;&#12539;&#12522;&#12473;&#12488;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12395;&#12399;&#12289;&#23550;&#24540;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#30772;&#25613;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0016E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0016E" varFormat="Java">
    BUNDLE_DOWNLOAD_0016E=CWSAK0016E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0006E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0006E" varFormat="Java">
    BUNDLE_DOWNLOAD_0006E=CWSAK0006E: &#12525;&#12540;&#12459;&#12523;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12449;&#12452;&#12523; {0} &#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12539;&#12503;&#12525;&#12475;&#12473;&#12391;&#12525;&#12540;&#12459;&#12523;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12449;&#12452;&#12523; {0} &#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#21407;&#22240;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0019E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_DELETE_EXPANDED_DIRECTORY" varFormat="Java">
    UNABLE_TO_DELETE_EXPANDED_DIRECTORY=CWSAK0019E: &#25313;&#24373;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0018E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_EXPANDED_DIRECTORY" varFormat="Java">
    UNABLE_TO_CREATE_EXPANDED_DIRECTORY=CWSAK0018E: &#25313;&#24373;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0015E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0015E" varFormat="Java">
    BUNDLE_DOWNLOAD_0015E=CWSAK0015E: &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#12501;&#12449;&#12452;&#12523; {1} &#12395;&#21517;&#21069;&#22793;&#26356;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0005E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0005E" varFormat="Java">
    BUNDLE_DOWNLOAD_0005E=CWSAK0005E: &#12522;&#12509;&#12472;&#12488;&#12522;&#12540; URL&#12289;&#12496;&#12531;&#12489;&#12523;&#21517;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#20001;&#26041;&#12364;&#12394;&#12356;&#12383;&#12417;&#12289;&#12496;&#12531;&#12489;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12522;&#12509;&#12472;&#12488;&#12522;&#12540; URL: {0} &#12525;&#12540;&#12459;&#12523;&#12539;&#12496;&#12531;&#12489;&#12523;&#21517;: {1}
  </MsgText>
  <Explanation>
    &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26377;&#21177;&#12394;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; URL &#12362;&#12424;&#12403;&#12496;&#12531;&#12489;&#12523;&#21517;&#12364;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0014E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0014E" varFormat="Java">
    BUNDLE_DOWNLOAD_0014E=CWSAK0014E: &#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0004E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0004E" varFormat="Java">
    BUNDLE_DOWNLOAD_0004E=CWSAK0004E: &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806; {1}
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12391;&#12365;&#12394;&#12356;&#21407;&#22240;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0013E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0013E" varFormat="Java">
    BUNDLE_DOWNLOAD_0013E=CWSAK0013E: &#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12501;&#12449;&#12452;&#12523; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#20869;&#37096;&#12501;&#12449;&#12452;&#12523;&#12392;&#35242;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12471;&#12473;&#12486;&#12512;&#12395;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#26360;&#12365;&#36796;&#12415;&#27177;&#38480;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0021E" severity="E" prefix="yes">
  <MsgText pgmKey="ILLEGAL_BUNDLE_VERSION" varFormat="Java">
    ILLEGAL_BUNDLE_VERSION=CWSAK0021E: &#12471;&#12531;&#12508;&#12523;&#21517;&#12392;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12363;&#12425;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#27083;&#25991;&#35299;&#26512;&#12391;&#12365;&#12414;&#12379;&#12435;: {0}
  </MsgText>
  <Explanation>
    &#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#19979;&#32218;&#25991;&#23383;&#12364;&#22810;&#36942;&#12366;&#12427;&#12383;&#12417;&#12289;&#12471;&#12531;&#12508;&#12523;&#21517;&#12392;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12373;&#12414;&#12374;&#12414;&#12394;&#26041;&#27861;&#12391;&#27083;&#25991;&#35299;&#26512;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#19979;&#32218;&#25991;&#23383;&#12434;&#21066;&#38500;&#12375;&#12390;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#31777;&#32032;&#21270;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0023E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_EXCEPTION_DURING_REFRESH" varFormat="Java">
    RESOLVER_EXCEPTION_DURING_REFRESH=CWSAK0023E: &#12496;&#12531;&#12489;&#12523; URL &#12398;&#26368;&#26032;&#34920;&#31034;&#20013;&#12395; ResolverException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;: {0}
  </MsgText>
  <Explanation>
    &#27083;&#25104;&#28168;&#12415;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523; URL &#12398;&#26368;&#26032;&#34920;&#31034;&#12399;&#12289;&#20363;&#22806;&#12395;&#12424;&#12426;&#22833;&#25943;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12364;&#27491;&#12375;&#12367;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0003E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0003E" varFormat="Java">
    BUNDLE_DOWNLOAD_0003E=CWSAK0003E: URL {0} &#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806; {1}
  </MsgText>
  <Explanation>
    &#35201;&#27714;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12398; URL &#12364;&#27491;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0009E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0009E" varFormat="Java">
    BUNDLE_DOWNLOAD_0009E=CWSAK0009E: ThreadPool {2} &#12391;&#12289;&#12496;&#12531;&#12489;&#12523; {0} (URL: {1}) &#12398;&#26032;&#35215;&#12473;&#12524;&#12483;&#12489;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {3}
  </MsgText>
  <Explanation>
    &#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12364;&#26368;&#22823;&#12469;&#12452;&#12474;&#12395;&#36948;&#12375;&#12383;&#12383;&#12417;&#12289;&#12371;&#12428;&#20197;&#19978;&#12473;&#12524;&#12483;&#12489;&#12434;&#38283;&#22987; &#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#24433;&#38911;&#12434;&#21463;&#12369;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12399;&#12289;&#27425;&#22238;&#12450;&#12475;&#12483;&#12488;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#22987;&#21205;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#20877;&#35430;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0020E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_LOOSE_CBA" varFormat="Java">
    INVALID_LOOSE_CBA=CWSAK0020E: &#12523;&#12540;&#12474;&#12539;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12398; URL {0} &#12364;&#28961;&#21177;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0022E" severity="E" prefix="yes">
  <MsgText pgmKey="CANNOT_OBTAIN_BUNDLE_REPOSITORY_SERVICE" varFormat="Java">
    CANNOT_OBTAIN_BUNDLE_REPOSITORY_SERVICE=CWSAK0022E: &#12469;&#12540;&#12499;&#12473;&#12539;&#12524;&#12472;&#12473;&#12488;&#12522;&#12540;&#12363;&#12425; {0} &#12469;&#12540;&#12499;&#12473;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAK0012E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0012E" varFormat="Java">
    BUNDLE_DOWNLOAD_0012E=CWSAK0012E: &#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12399;&#23384;&#22312;&#12375;&#12414;&#12377;&#12364;&#12289;&#26377;&#21177;&#12394;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12289;&#26377;&#21177;&#12394;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12395;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12363;&#12425;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0002E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0002E" varFormat="Java">
    BUNDLE_DOWNLOAD_0002E=CWSAK0002E: URL {0} &#12395;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12383;&#12417;&#12289;&#12381;&#12398; URL &#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#35201;&#27714;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12398; URL &#12364;&#27491;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0008E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0008E" varFormat="Java">
    BUNDLE_DOWNLOAD_0008E=CWSAK0008E: &#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12501;&#12449;&#12452;&#12523;&#12434;&#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#20013;&#12395;&#12289;null &#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12364;&#36820;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12391;&#12365;&#12394;&#12356;&#21407;&#22240;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAK0011E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_0011E" varFormat="Java">
    BUNDLE_DOWNLOAD_0011E=CWSAK0011E: Service Tracker &#12398; Service Reference {1} &#12363;&#12425;&#12469;&#12540;&#12499;&#12473; {0} &#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    Service Tracker &#12363;&#12425;&#12469;&#12540;&#12499;&#12473;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12469;&#12540;&#12499;&#12473;&#12364;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#21407;&#22240;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
