<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.app.container.aries/src/com/ibm/ws/app/container/aries/messages/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAI0045E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_FIND_ALL_BUNDLES_TO_UPDATE" varFormat="Java">
    COULD_NOT_FIND_ALL_BUNDLES_TO_UPDATE=CWSAI0045E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#26356;&#26032;&#23550;&#35937;&#12398;&#20998;&#38626;&#12496;&#12531;&#12489;&#12523;&#12434;&#12289;&#12377;&#12409;&#12390;&#12399;&#26908;&#20986;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WAITING_FOR_QUIESCE" varFormat="Java">
    EXCEPTION_WHILE_WAITING_FOR_QUIESCE=CWSAI0044E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; quiesce &#12398;&#23436;&#20102;&#12434;&#24453;&#12387;&#12390;&#12356;&#12427;&#38291;&#12395;&#12289;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#20363;&#22806;&#12399; {0} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0006E" severity="E" prefix="yes">
  <MsgText pgmKey="COMPOSITE_FAILED_START_APPCONMSG0006" varFormat="Java">
    COMPOSITE_FAILED_START_APPCONMSG0006=CWSAI0006E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503; {0} &#12391;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12395;&#23550;&#12377;&#12427;&#12469;&#12540;&#12499;&#12473;&#12539;&#12497;&#12502;&#12522;&#12483;&#12471;&#12515;&#12540;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0005E" severity="E" prefix="yes">
  <MsgText pgmKey="COMPOSITE_FAILED_START_APPCONMSG0005" varFormat="Java">
    COMPOSITE_FAILED_START_APPCONMSG0005=CWSAI0005E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503; {0} &#12391;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12398;&#38283;&#22987;&#12395;&#22833;&#25943;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_PACKAGE_ADMIN" varFormat="Java">
    NO_PACKAGE_ADMIN=CWSAI0035E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; PackageAdmin &#12469;&#12540;&#12499;&#12473;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_RB" varFormat="Java">
    UNABLE_TO_FIND_RB=CWSAI0031E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523; {1} &#12391;&#24517;&#35201;&#12392;&#12373;&#12428;&#12427;&#12496;&#12531;&#12489;&#12523; {0} &#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;&#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#20381;&#23384;&#38306;&#20418;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0032E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_RB_2" varFormat="Java">
    UNABLE_TO_FIND_RB_2=CWSAI0032E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523; {1} &#12391;&#24517;&#35201;&#12392;&#12373;&#12428;&#12427;&#12496;&#12531;&#12489;&#12523; {0} &#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;&#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#20381;&#23384;&#38306;&#20418;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0047E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_INSTALL_UPDATES" varFormat="Java">
    COULD_NOT_INSTALL_UPDATES=CWSAI0047E: &#26356;&#26032;&#25805;&#20316;&#12364;&#21462;&#24471;&#12377;&#12427; 1 &#12388;&#20197;&#19978;&#12398;&#26032;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12399;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12373;&#12428;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#26032;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12398;&#12358;&#12385;&#12398;&#23569;&#12394;&#12367;&#12392;&#12418; 1 &#12388;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#20363;&#22806;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290; &#12371;&#12428;&#12425;&#12398;&#20363;&#22806;&#12399;&#12289;&#12496;&#12531;&#12489;&#12523;&#12539;&#12456;&#12521;&#12540;&#12414;&#12383;&#12399;&#12471;&#12473;&#12486;&#12512;&#12539;&#12456;&#12521;&#12540;&#12364;&#21407;&#22240;&#12398;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12525;&#12464;&#12391;&#21069;&#12398;&#12456;&#12521;&#12540;&#12392;&#20363;&#22806;&#12434;&#35519;&#12409;&#12390;&#12289;&#12496;&#12531;&#12489;&#12523;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#22833;&#25943;&#12375;&#12383;&#29702;&#30001;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#26032;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_EVENTHANDLERMSG0001" varFormat="Java">
    ARIES_APP_EVENTHANDLERMSG0001=CWSAI0014E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0017W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0003W" varFormat="Java">
    SERVICE_PUBLISHER0003W=CWSAI0017W: &#12469;&#12540;&#12499;&#12473; {0} &#12398;&#22793;&#26356;&#12434;&#35430;&#12415;&#12414;&#12375;&#12383;&#12364;&#12289;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12399;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12469;&#12540;&#12499;&#12473;&#12398;&#22793;&#26356;&#12434;&#35430;&#12415;&#12414;&#12375;&#12383;&#12364;&#12289;&#12371;&#12398; ID &#12391;&#30331;&#37682;&#12373;&#12428;&#12383;&#12469;&#12540;&#12499;&#12473;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12469;&#12540;&#12499;&#12473;&#21442;&#29031;&#12398; ID &#12364;&#27491;&#12375;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0058E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_FAILED" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_FAILED=CWSAI0058E: Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#26356;&#26032;&#20013;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#26356;&#26032;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26356;&#26032;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#26356;&#26032;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12525;&#12464;&#12391;&#12289;&#12371;&#12398;&#21839;&#38988;&#12395;&#38306;&#36899;&#12377;&#12427;&#12456;&#12521;&#12540;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#12456;&#12521;&#12540;&#12395;&#38306;&#36899;&#12377;&#12427;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20013;&#12398;&#21839;&#38988;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0024E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_REGISTRATION_FAILURE0001" varFormat="Java">
    MBEAN_REGISTRATION_FAILURE0001=CWSAI0024E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; {0} &#23550;&#24540; JMX MBeans &#12434;&#30331;&#37682;&#20013;&#12395;&#20363;&#22806;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#32154;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    JMX MBeans &#12398;&#30331;&#37682;&#20013;&#12395;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#34920;&#31034;&#12395; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12477;&#12540;&#12523;&#12539;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0050E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_START_ERROR" varFormat="Java">
    ARIES_APPLICATION_START_ERROR=CWSAI0050E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398; Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0056E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_STOPPING" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_STOPPING=CWSAI0056E: Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#20572;&#27490;&#20013;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20572;&#27490;&#12391;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12525;&#12464;&#12391;&#12289;&#12371;&#12398;&#21839;&#38988;&#12395;&#38306;&#36899;&#12377;&#12427;&#12456;&#12521;&#12540;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#12456;&#12521;&#12540;&#12395;&#38306;&#36899;&#12377;&#12427;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20013;&#12398;&#21839;&#38988;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0016W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0002W" varFormat="Java">
    SERVICE_PUBLISHER0002W=CWSAI0016W: &#12469;&#12540;&#12499;&#12473; {0} &#12398;&#30331;&#37682;&#25273;&#28040;&#12434;&#35430;&#12415;&#12414;&#12375;&#12383;&#12364;&#12289;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12399;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12469;&#12540;&#12499;&#12473;&#12398;&#30331;&#37682;&#25273;&#28040;&#12434;&#35430;&#12415;&#12414;&#12375;&#12383;&#12364;&#12289;&#12371;&#12398; ID &#12391;&#30331;&#37682;&#12373;&#12428;&#12383;&#12469;&#12540;&#12499;&#12473;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12469;&#12540;&#12499;&#12473;&#21442;&#29031;&#12398; ID &#12364;&#27491;&#12375;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0052E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_UPDATE_ERROR" varFormat="Java">
    ARIES_APPLICATION_UPDATE_ERROR=CWSAI0052E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398; Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#26356;&#26032;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0040W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_LIST_FILTER_ID" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_LIST_FILTER_ID=CWSAI0040W: Blueprint &#12496;&#12531;&#12489;&#12523; {0} &#12395;&#12399;&#12289;ID {1} &#12398;&#21442;&#29031;&#12522;&#12473;&#12488;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#21442;&#29031;&#12522;&#12473;&#12488; {2} &#12398;&#12501;&#12451;&#12523;&#12479;&#12540;&#12399;&#28961;&#21177;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20445;&#23384;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12418;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#20849;&#26377; OSGi &#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21028;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12469;&#12540;&#12499;&#12473;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#20998;&#26512;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12434;&#21028;&#21029;&#12391;&#12365;&#12394;&#12356;&#12392;&#12289;&#20351;&#29992;&#20013;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12391;&#12354;&#12387;&#12390;&#12418;&#19968;&#37096;&#21066;&#38500;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#27491;&#24120;&#12395;&#27231;&#33021;&#12375;&#12394;&#12367;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21517;&#21069;&#12364;&#20184;&#12369;&#12425;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#12394;&#12356;&#12363; Blueprint &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;&#28961;&#21177;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#22793;&#26356;&#12375;&#12390;&#27491;&#12375;&#12356;&#27083;&#25991;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0015W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0001W" varFormat="Java">
    SERVICE_PUBLISHER0001W=CWSAI0015W: &#12469;&#12540;&#12499;&#12473; {0} &#12399;&#26082;&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#26082;&#12395;&#30331;&#37682;&#28168;&#12415;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#30331;&#37682;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290; &#26032;&#35215;&#12398;&#30331;&#37682;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#30331;&#37682;&#12364;&#26082;&#23384;&#12398;&#30331;&#37682;&#12395;&#20778;&#20808;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#26082;&#23384;&#12398;&#30331;&#37682;&#12434;&#25273;&#28040;&#12377;&#12427;&#12363;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0033E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_PKG" varFormat="Java">
    UNABLE_TO_FIND_PKG=CWSAI0033E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523; {1} &#12395;&#12424;&#12387;&#12390;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472; {0} &#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;&#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#20381;&#23384;&#38306;&#20418;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0057E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_PASSED" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_PASSED=CWSAI0057E: Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#26356;&#26032;&#20013;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#26356;&#26032;&#12399;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26356;&#26032;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#26356;&#26032;&#12399;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12525;&#12464;&#12391;&#12289;&#12371;&#12398;&#21839;&#38988;&#12395;&#38306;&#36899;&#12377;&#12427;&#12456;&#12521;&#12540;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#12456;&#12521;&#12540;&#12395;&#38306;&#36899;&#12377;&#12427;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20013;&#12398;&#21839;&#38988;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0051E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_STOP_ERROR" varFormat="Java">
    ARIES_APPLICATION_STOP_ERROR=CWSAI0051E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398; Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#20572;&#27490;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0046E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_REINSTALL_BUNDLES" varFormat="Java">
    COULD_NOT_REINSTALL_BUNDLES=CWSAI0046E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#26032;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#19981;&#25104;&#21151;&#12395;&#32066;&#12431;&#12387;&#12383;&#24460;&#12289;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#21476;&#12356;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12377;&#12409;&#12390;&#12399;&#24489;&#20803;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12399;&#22833;&#25943;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0041E" severity="E" prefix="yes">
  <MsgText pgmKey="BAD_BLUEPRINT_CONTAINER_FILTER" varFormat="Java">
    BAD_BLUEPRINT_CONTAINER_FILTER=CWSAI0041E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523; {0} &#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#20998;&#26512;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0003E" severity="E" prefix="yes">
  <MsgText pgmKey="FAILED_START_APPCONMSG0003" varFormat="Java">
    FAILED_START_APPCONMSG0003=CWSAI0003E: {1} &#12398;&#12383;&#12417;&#12395;&#12496;&#12531;&#12489;&#12523; {0} &#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12434;&#38283;&#22987;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#23436;&#20840;&#12394;&#12473;&#12479;&#12483;&#12463;&#12539;&#12488;&#12524;&#12540;&#12473;&#12398;&#27161;&#28310;&#12456;&#12521;&#12540;&#20986;&#21147;&#12525;&#12464;&#12434;&#21442;&#29031;&#12375;&#12390;&#12289;&#20363;&#22806;&#12434;&#35299;&#27770;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_PKG_2" varFormat="Java">
    UNABLE_TO_FIND_PKG_2=CWSAI0034E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523; {1} &#12395;&#12424;&#12387;&#12390;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472; {0} &#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;&#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#20381;&#23384;&#38306;&#20418;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0048E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_QUIESCE_MANAGER" varFormat="Java">
    NO_QUIESCE_MANAGER=CWSAI0048E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; QuiesceManager &#12469;&#12540;&#12499;&#12473;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0049E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_SERVICE_UNAVAILABLE" varFormat="Java">
    ARIES_SERVICE_UNAVAILABLE=CWSAI0049E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398; Aries &#12521;&#12531;&#12479;&#12452;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    Aries OSGi &#12521;&#12531;&#12479;&#12452;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;&#12364;&#12469;&#12540;&#12499;&#12473;&#12539;&#12524;&#12472;&#12473;&#12488;&#12522;&#12540;&#12395;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0053I" severity="I" prefix="yes">
  <MsgText pgmKey="NO_IN_PLACE_UPDATE_ISOLATION_CHANGES" varFormat="Java">
    NO_IN_PLACE_UPDATE_ISOLATION_CHANGES=CWSAI0053I: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0}/{1} &#12434;&#26356;&#26032;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#20877;&#22987;&#21205;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#26356;&#26032;&#12395;&#12424;&#12387;&#12390;&#12289;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#31354;&#38291;&#12363;&#12425;&#21462;&#24471;&#12375;&#12383;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12539;&#12452;&#12531;&#12509;&#12540;&#12488;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12539;&#12452;&#12531;&#12509;&#12540;&#12488;&#12395;&#23550;&#12377;&#12427;&#22793;&#26356;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#19968;&#37096;&#12398;&#26356;&#26032;&#12434;&#27491;&#12375;&#12367;&#36969;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#29305;&#12395;&#12289;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12373;&#12428;&#12383;&#26032;&#35215;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12373;&#12428;&#12383;&#26032;&#35215;&#12469;&#12540;&#12499;&#12473;&#12398;&#22580;&#21512;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#23436;&#20840;&#20877;&#22987;&#21205;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399;&#26032;&#35215;&#12469;&#12540;&#12499;&#12473;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#22793;&#26356;&#12434;&#30906;&#35469;&#12377;&#12427;&#12395;&#12399;&#12289;&#26356;&#26032;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12391;&#12289;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#26032;&#35215;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399;&#21029;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31684;&#22258;&#12391;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#35519;&#12409;&#12414;&#12377;&#12290;&#12373;&#12425;&#12395;&#12289;Blueprint &#35352;&#36848;&#23376;&#12391;&#26032;&#12375;&#12356;&#12469;&#12540;&#12499;&#12473;&#21442;&#29031;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0029E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_APP" varFormat="Java">
    UNABLE_TO_FIND_APP=CWSAI0029E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;&#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#20381;&#23384;&#38306;&#20418;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0037W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_FILTER" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_FILTER=CWSAI0037W: Blueprint &#12496;&#12531;&#12489;&#12523; {0} &#12395;&#12399;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {1} &#12392;&#12392;&#12418;&#12395;&#12469;&#12540;&#12499;&#12473;&#12408;&#12398;&#21442;&#29031;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#21442;&#29031;&#12398;&#12501;&#12451;&#12523;&#12479;&#12540; {2} &#12399;&#28961;&#21177;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20445;&#23384;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12418;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#20849;&#26377; OSGi &#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21028;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12469;&#12540;&#12499;&#12473;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#20998;&#26512;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12434;&#21028;&#21029;&#12391;&#12365;&#12394;&#12356;&#12392;&#12289;&#20351;&#29992;&#20013;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12391;&#12354;&#12387;&#12390;&#12418;&#19968;&#37096;&#21066;&#38500;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#27491;&#24120;&#12395;&#27231;&#33021;&#12375;&#12394;&#12367;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21517;&#21069;&#12364;&#20184;&#12369;&#12425;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#12394;&#12356;&#12363; Blueprint &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;&#28961;&#21177;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#22793;&#26356;&#12375;&#12390;&#27491;&#12375;&#12356;&#27083;&#25991;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0012E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0012" varFormat="Java">
    ARIES_APP_CONMSG0012=CWSAI0012E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#25805;&#20316; {0} &#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0011E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0011" varFormat="Java">
    ARIES_APP_CONMSG0011=CWSAI0011E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#31478;&#21512;&#12364;&#21407;&#22240;&#12391;&#12289;&#12452;&#12531;&#12509;&#12540;&#12488;&#12539;&#12497;&#12483;&#12465;&#12540;&#12472; {0} &#12434; {1} &#12395;&#12510;&#12540;&#12472;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0010E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0010" varFormat="Java">
    ARIES_APP_CONMSG0010=CWSAI0010E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#31478;&#21512;&#12364;&#21407;&#22240;&#12391;&#12289;&#12452;&#12531;&#12509;&#12540;&#12488;&#12539;&#12497;&#12483;&#12465;&#12540;&#12472; {0} &#12434;&#32080;&#26524;&#12510;&#12483;&#12503; {1} &#12395;&#12510;&#12540;&#12472;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0036E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_UNINSTALL_ERROR" varFormat="Java">
    BUNDLE_UNINSTALL_ERROR=CWSAI0036E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523; {0} &#12434;&#21066;&#38500;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0043E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_FRAMEWORK_UNINSTALL_ERROR" varFormat="Java">
    BUNDLE_FRAMEWORK_UNINSTALL_ERROR=CWSAI0043E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; Bundle Framework Manager &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0009E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0009" varFormat="Java">
    ARIES_APP_CONMSG0009=CWSAI0009E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12473;&#12467;&#12540;&#12503; {0} &#12391;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12539;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#35336;&#31639;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0007E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0007" varFormat="Java">
    ARIES_APP_CONMSG0007=CWSAI0007E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503; {0} &#12391;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12434; OSGi &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0002E" severity="E" prefix="yes">
  <MsgText pgmKey="FAILED_INSTALL_APPCONMSG0002" varFormat="Java">
    FAILED_INSTALL_APPCONMSG0002=CWSAI0002E: {1} &#12398;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523; {0} &#12399; OSGi &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12434; OSGi &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#20363;&#22806;&#12398;&#21407;&#22240;&#12434;&#35519;&#26619;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0028E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_APP_UPDATE" varFormat="Java">
    INVALID_APP_UPDATE=CWSAI0028E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12399;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417; &#26356;&#26032;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; 1 &#12388;&#20197;&#19978;&#12398;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#26082;&#12395;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#35443;&#12375;&#12367;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </MsgText>
  <Explanation>
    &#26082;&#12395;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#26356;&#26032;&#35201;&#27714;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290; &#21069;&#22238;&#12398;&#38556;&#23475;&#20572;&#27490;&#35201;&#27714;&#12364;&#21407;&#22240;&#12398;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#21069;&#22238;&#12398;&#38556;&#23475;&#12398;&#35443;&#32048;&#12364;&#35352;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#22987;&#21205;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0023E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0003" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0003=CWSAI0023E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20006;&#34892;&#12375;&#12390;&#12450;&#12463;&#12475;&#12473;&#27177;&#24773;&#22577;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12383;&#12417;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0022E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0002" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0002=CWSAI0022E: &#35377;&#21487;&#12501;&#12449;&#12452;&#12523; {0} &#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12362;&#12424;&#12403;&#35501;&#12415;&#21462;&#12426;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806; {1}
  </MsgText>
  <Explanation>
    &#35377;&#21487;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12408;&#12450;&#12463;&#12475;&#12473;&#12362;&#12424;&#12403;&#20869;&#23481;&#12434;&#35501;&#12415;&#21462;&#12429;&#12358;&#12392;&#12375;&#12390;&#22833;&#25943;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#20363;&#22806;&#12398;&#24773;&#22577;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#35377;&#21487;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12390;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0021E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0001" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0001=CWSAI0021E: &#35377;&#21487;&#12501;&#12449;&#12452;&#12523; {0} &#12398;&#24418;&#24335;&#12364;&#21407;&#22240;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#35377;&#21487;&#12501;&#12449;&#12452;&#12523;&#12398;&#24418;&#24335;&#12364;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#35377;&#21487;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12364;&#27491;&#12375;&#12367;&#12289;&#36969;&#20999;&#12395;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0025E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_UNREGISTRATION_FAILURE0001" varFormat="Java">
    MBEAN_UNREGISTRATION_FAILURE0001=CWSAI0025E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; {0} &#23550;&#24540; JMX MBeans &#12434;&#30331;&#37682;&#25273;&#28040;&#20013;&#12395;&#20363;&#22806;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#32154;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    JMX MBeans &#12398;&#30331;&#37682;&#25273;&#28040;&#20013;&#12395;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0054I" severity="I" prefix="yes">
  <MsgText pgmKey="IN_PLACE_UPDATE_WITH_REFRESH" varFormat="Java">
    IN_PLACE_UPDATE_WITH_REFRESH=CWSAI0054I: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0}/{1} &#12395;&#23550;&#12377;&#12427;&#26356;&#26032;&#25805;&#20316;&#12398;&#19968;&#29872;&#12392;&#12375;&#12390;&#12289;&#27425;&#12395;&#31034;&#12377;&#12496;&#12531;&#12489;&#12523;&#12364;&#38745;&#27490;&#12373;&#12428;&#12390;&#12363;&#12425;&#20877;&#22987;&#21205;&#12373;&#12428;&#12414;&#12377;: {2}
  </MsgText>
  <Explanation>
    &#21516;&#12376;&#22580;&#25152;&#12391;&#12398;&#26356;&#26032;&#12398;&#19968;&#29872;&#12392;&#12375;&#12390;&#12289;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#26356;&#26032;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12392;&#30452;&#25509;&#12414;&#12383;&#12399;&#38291;&#25509;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#20381;&#23384;&#38306;&#20418;&#12289;&#12354;&#12427;&#12356;&#12399; Require-Bundle &#20381;&#23384;&#38306;&#20418;&#12364;&#12354;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#12289;&#20877;&#22987;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12394;&#12380;&#12496;&#12531;&#12489;&#12523;&#12434;&#20877;&#22987;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12434;&#31361;&#12365;&#27490;&#12417;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#26356;&#26032;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12398; 1 &#12388;&#12354;&#12427;&#12356;&#12399;&#20877;&#22987;&#21205;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12475;&#12483;&#12488;&#12398;&#19968;&#37096;&#12391;&#12354;&#12427;&#20182;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12289;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399; Require-Bundle &#12504;&#12483;&#12480;&#12540;&#12434;&#35211;&#12388;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0039W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_LIST_FILTER" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_LIST_FILTER=CWSAI0039W: Blueprint &#12496;&#12531;&#12489;&#12523; {0} &#12395;&#12399;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {1} &#12392;&#12392;&#12418;&#12395;&#12469;&#12540;&#12499;&#12473;&#12398;&#21442;&#29031;&#12522;&#12473;&#12488;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#21442;&#29031;&#12522;&#12473;&#12488; {2} &#12398;&#12501;&#12451;&#12523;&#12479;&#12540;&#12399;&#28961;&#21177;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20445;&#23384;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12418;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#20849;&#26377; OSGi &#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21028;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12469;&#12540;&#12499;&#12473;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#20998;&#26512;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12434;&#21028;&#21029;&#12391;&#12365;&#12394;&#12356;&#12392;&#12289;&#20351;&#29992;&#20013;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12391;&#12354;&#12387;&#12390;&#12418;&#19968;&#37096;&#21066;&#38500;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#27491;&#24120;&#12395;&#27231;&#33021;&#12375;&#12394;&#12367;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21517;&#21069;&#12364;&#20184;&#12369;&#12425;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#12394;&#12356;&#12363; Blueprint &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;&#28961;&#21177;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#22793;&#26356;&#12375;&#12390;&#27491;&#12375;&#12356;&#27083;&#25991;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_SERVICE_UNAVAILABLE0001" varFormat="Java">
    MBEAN_SERVICE_UNAVAILABLE0001=CWSAI0026E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; MBeanServer &#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;{0} &#23550;&#24540; JMX MBeans &#12434;&#30331;&#37682;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#32154;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    OSGi service registry &#12395; MBeanServer &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#34920;&#31034;&#12395; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12477;&#12540;&#12523;&#12539;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0020E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0003" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0003=CWSAI0020E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463; {0} &#12434;&#30772;&#26820;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0019E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0002" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0002=CWSAI0019E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12469;&#12540;&#12499;&#12473;&#12539;&#12497;&#12502;&#12522;&#12483;&#12471;&#12515;&#12540; {0} &#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0018E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0001" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0001=CWSAI0018E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20849;&#26377;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12539;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523; {0} &#12434;&#20316;&#25104;&#12414;&#12383;&#12399;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0042E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_BLUEPRINTS" varFormat="Java">
    TOO_MANY_BLUEPRINTS=CWSAI0042E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12496;&#12531;&#12489;&#12523; {0} &#12398; Blueprint &#12467;&#12531;&#12486;&#12490;&#12540;&#12434;&#35672;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_APP_STOP" varFormat="Java">
    INVALID_APP_STOP=CWSAI0027E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12434;&#20572;&#27490;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; 1 &#12388;&#20197;&#19978;&#12398;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#26082;&#12395;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#35443;&#12375;&#12367;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </MsgText>
  <Explanation>
    &#26082;&#12395;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#20572;&#27490;&#35201;&#27714;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290; &#21069;&#22238;&#12398;&#38556;&#23475;&#20572;&#27490;&#35201;&#27714;&#12364;&#21407;&#22240;&#12398;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#21069;&#22238;&#12398;&#38556;&#23475;&#12398;&#35443;&#32048;&#12364;&#35352;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#22987;&#21205;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0030E" severity="E" prefix="yes">
  <MsgText pgmKey="ERROR_FINDING_SERVICES" varFormat="Java">
    ERROR_FINDING_SERVICES=CWSAI0030E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#12469;&#12540;&#12499;&#12473;&#12539;&#12452;&#12531;&#12509;&#12540;&#12488;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12383;&#12417;&#12289;&#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#20381;&#23384;&#38306;&#20418;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12501;&#12451;&#12523;&#12479;&#12540;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#26410;&#20351;&#29992;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#28040;&#21435;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0001E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_URL_APPCONMSG0001" varFormat="Java">
    NO_URL_APPCONMSG0001=CWSAI0001E: &#12496;&#12531;&#12489;&#12523; {0} &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#20013;&#12395;&#12289;&#12496;&#12531;&#12489;&#12523;&#12434;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    BundleCacheManager MBean &#12414;&#12383;&#12399;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#12496;&#12531;&#12489;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12424;&#12358;&#35201;&#27714;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0038W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_FILTER_ID" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_FILTER_ID=CWSAI0038W: Blueprint &#12496;&#12531;&#12489;&#12523; {0} &#12395;&#12399;&#12289;ID {1} &#12398;&#21442;&#29031;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#21442;&#29031;&#12398;&#12501;&#12451;&#12523;&#12479;&#12540; {2} &#12399;&#28961;&#21177;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20445;&#23384;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12356;&#12378;&#12428;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12418;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#20849;&#26377; OSGi &#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21028;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12469;&#12540;&#12499;&#12473;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#20998;&#26512;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12434;&#21028;&#21029;&#12391;&#12365;&#12394;&#12356;&#12392;&#12289;&#20351;&#29992;&#20013;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12391;&#12354;&#12387;&#12390;&#12418;&#19968;&#37096;&#21066;&#38500;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#27491;&#24120;&#12395;&#27231;&#33021;&#12375;&#12394;&#12367;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21517;&#21069;&#12364;&#20184;&#12369;&#12425;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#12394;&#12356;&#12363; Blueprint &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;&#28961;&#21177;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#22793;&#26356;&#12375;&#12390;&#27491;&#12375;&#12356;&#27083;&#25991;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAI0055E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_STARTING" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_STARTING=CWSAI0055E: Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#38283;&#22987;&#20013;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#35299;&#27770;&#12414;&#12383;&#12399;&#38283;&#22987;&#12395;&#22833;&#25943;&#12375;&#12383;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12525;&#12464;&#12391;&#12289;&#12371;&#12398;&#21839;&#38988;&#12395;&#38306;&#36899;&#12377;&#12427;&#12456;&#12521;&#12540;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#12456;&#12521;&#12540;&#12395;&#38306;&#36899;&#12377;&#12427;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20013;&#12398;&#21839;&#38988;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
