<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12469;&#12540;&#12499;&#12473;&#12539;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#35299;&#26512;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12398; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#35201;&#27714;&#12377;&#12427;&#26377;&#21177;&#12394;&#29366;&#24907;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12469;&#12540;&#12499;&#12473;&#12539;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#35299;&#26512;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: {0} &#12392;&#12356;&#12358;&#21517;&#21069;&#12434;&#25345;&#12388;&#35079;&#25968;&#12398;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398; Web &#12496;&#12531;&#12489;&#12523; {1} &#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    OSGi JPA &#12467;&#12531;&#12486;&#12490;&#12540;&#12364;&#21516;&#12376;&#21517;&#21069;&#12398;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#35079;&#25968;&#26908;&#20986;&#12375;&#12414;&#12375;&#12383;&#12290;&#12371;&#12428;&#12399;&#26377;&#21177;&#12394;&#27083;&#25104;&#12391;&#12399;&#12394;&#12367;&#12289;&#30683;&#30462;&#12377;&#12427;&#32080;&#26524;&#12395;&#12394;&#12427;&#12362;&#12381;&#12428;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21516;&#12376;&#21517;&#21069;&#12398;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#35079;&#25968;&#23450;&#32681;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21547;&#12414;&#12394;&#12356;&#12424;&#12358;&#12395; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: &#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12398; OSGi Web &#12496;&#12531;&#12489;&#12523; {0} &#12364;&#12289;&#25313;&#24373;&#12473;&#12467;&#12540;&#12503;&#12398;&#31649;&#29702;&#23550;&#35937; JPA &#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488; {2} &#12392;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#25313;&#24373;&#12473;&#12467;&#12540;&#12503;&#12539;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12399;&#12289;OSGi JPA &#12467;&#12531;&#12486;&#12490;&#12540;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25313;&#24373;&#12473;&#12467;&#12540;&#12503; JPA &#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12392;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#23459;&#35328;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#25313;&#24373;&#12473;&#12467;&#12540;&#12503;&#12539;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12399; OSGi JPA &#12467;&#12531;&#12486;&#12490;&#12540;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#31649;&#29702;&#12414;&#12383;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#12539;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12364;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12509;&#12540;&#12488;&#12434;&#21021;&#26399;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: {0} &#12392;&#12356;&#12358;&#21517;&#21069;&#12434;&#25345;&#12388;&#35079;&#25968;&#12398;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12518;&#12491;&#12483;&#12488;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398; Web &#12496;&#12531;&#12489;&#12523; {1} &#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    OSGi JPA &#12467;&#12531;&#12486;&#12490;&#12540;&#12364;&#21516;&#12376;&#21517;&#21069;&#12398;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12518;&#12491;&#12483;&#12488;&#12434;&#35079;&#25968;&#26908;&#20986;&#12375;&#12414;&#12375;&#12383;&#12290; &#12371;&#12428;&#12399;&#26377;&#21177;&#12394;&#27083;&#25104;&#12391;&#12399;&#12394;&#12367;&#12289;&#30683;&#30462;&#12377;&#12427;&#32080;&#26524;&#12395;&#12394;&#12427;&#12362;&#12381;&#12428;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21516;&#12376;&#21517;&#21069;&#12398;&#12497;&#12540;&#12471;&#12473;&#12479;&#12531;&#12473;&#12539;&#12518;&#12491;&#12483;&#12488;&#12434;&#35079;&#25968;&#23450;&#32681;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#21547;&#12414;&#12394;&#12356;&#12424;&#12358;&#12395; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
