<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: &#12450;&#12475;&#12483;&#12488; {0} &#12364;&#35299;&#27770;&#12373;&#12428;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#20849;&#26377;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#28961;&#21177;&#12394;&#20381;&#23384;&#38306;&#20418;&#12364;&#12354;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;: {1}
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12373;&#12425;&#12395;&#12289;&#12496;&#12531;&#12489;&#12523;&#12434;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523;&#12392;&#12375;&#12390;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523;&#12395;&#20381;&#23384;&#12377;&#12427;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12377;&#12409;&#12390;&#12398;&#28961;&#21177;&#12394;&#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#24517;&#35201;&#12392;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12358;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12371;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#20381;&#23384;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: EBA &#12501;&#12449;&#12452;&#12523; {1} &#20869;&#12398; JAR &#12501;&#12449;&#12452;&#12523; {0} &#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#20869;&#12398; JAR &#12501;&#12449;&#12452;&#12523;&#12398;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#35211;&#12388;&#12369;&#12427;&#38555;&#12395;&#12289;IOException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12501;&#12449;&#12452;&#12523;&#12364;&#30772;&#25613;&#12375;&#12390;&#12356;&#12427;&#12363;&#35501;&#12417;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12395;&#36969;&#20999;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12426;&#12289;&#27491;&#12375;&#12356;&#24418;&#24335;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12503;&#12525;&#12499;&#12472;&#12519;&#12490;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473; {0} &#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: &#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12398;&#27083;&#25104;&#21336;&#20301; {0} &#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#38283;&#22987;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#38283;&#22987;&#25805;&#20316;&#20013;&#12395;&#12289;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#29305;&#23450;&#12398;&#21839;&#38988;&#35386;&#26029;&#12398;&#35443;&#32048;&#12399;&#12289;&#12371;&#12398;&#20363;&#22806;&#12424;&#12426;&#21069;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {1} &#12395;&#12399;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; EBA &#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;byValue &#12414;&#12383;&#12399; byReference &#12392;&#12356;&#12358;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#12371;&#12428;&#12425;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#21517;&#12399;&#12356;&#12378;&#12428;&#12418;&#12289;EBA &#12501;&#12449;&#12452;&#12523;&#12398;&#12523;&#12540;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#38306;&#36899;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12363;&#21517;&#21069;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: &#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12540;&#12523; {0} &#12364;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12518;&#12540;&#12470;&#12540;&#12414;&#12383;&#12399;&#12464;&#12523;&#12540;&#12503;&#12434;&#12289;&#23384;&#22312;&#12375;&#12394;&#12356;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12395;&#12510;&#12483;&#12503;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12363;&#12289;&#12371;&#12398;&#12525;&#12540;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12450;&#12475;&#12483;&#12488; {0} &#12395;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12399;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; APPLICATION.MF &#12392;&#20114;&#25563;&#24615;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#20197;&#19979;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
   1. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Application-SymbolicName &#12392; Application-Version &#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398;&#23550;&#24540;&#12377;&#12427;&#38917;&#30446;&#12395;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   2. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12392;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   3. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398;&#23550;&#24540;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31684;&#22258;&#20869;&#12395;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   4. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398; Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12418;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   5. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398; Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#23550;&#24540;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31684;&#22258;&#20869;&#12395;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
 &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#32232;&#38598;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434; EBA &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12398;&#22580;&#21512;&#12289;EBA &#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#26178;&#12395;&#12289;&#26032;&#12375;&#12356;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: &#36984;&#25246;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#35299;&#27770;&#12391;&#12365;&#12394;&#12356;&#12363;&#12289;&#20114;&#25563;&#24615;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12399;&#36984;&#25246;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12496;&#12531;&#12489;&#12523;&#12399; &#20381;&#23384;&#38306;&#20418;&#12364;&#27424;&#33853;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;&#20114;&#25563;&#24615;&#12364;&#12394;&#12356;&#12363;&#12289;&#23384;&#22312;&#12375;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#36984;&#25246;&#12375;&#12383;&#20837;&#21147;&#12496;&#12531;&#12489;&#12523;&#12398;&#12475;&#12483;&#12488;&#12434;&#22793;&#26356;&#12375;&#12390;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390; &#12450;&#12475;&#12483;&#12488;&#12398;&#29366;&#27841;&#12434;&#34920;&#31034;&#12414;&#12383;&#12399;&#12503;&#12524;&#12499;&#12517;&#12540;&#12391;&#12365;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: &#12518;&#12540;&#12470;&#12540; {0} &#12399;&#12289;&#12525;&#12540;&#12523; {1} &#12395;&#23550;&#12375;&#12390;&#12289;&#12510;&#12483;&#12503;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12391;&#12418;&#12289;&#12510;&#12483;&#12503;&#12373;&#12428;&#12383;&#12464;&#12523;&#12540;&#12503;&#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12395;&#12510;&#12483;&#12503;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12363;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12395;&#12510;&#12483;&#12503;&#12373;&#12428;&#12383;&#12464;&#12523;&#12540;&#12503;&#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#25351;&#23450;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#35201;&#20214;&#12398;&#12356;&#12378;&#12428;&#12418;&#28288;&#12383;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12518;&#12540;&#12470;&#12540;/&#12464;&#12523;&#12540;&#12503;&#12408;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#27083;&#25104;&#12375;&#12390;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12540;&#12523;&#12391;&#21205;&#20316;&#12377;&#12427;&#12371;&#12392;&#12434;&#35377;&#21487;&#12377;&#12427;&#12363;&#12289;&#26082;&#12395;&#24517;&#35201;&#12394;&#27177;&#38480;&#12434;&#25345;&#12388;&#21029;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12395;&#12399;&#12289;1 &#12388;&#20197;&#19978;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {1} &#12364; Application-Content &#20869;&#12395;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CBA &#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Application-Content &#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434; WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12391;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;Application-Content &#12398;&#20013;&#12395; CBA &#12364;&#12394;&#12356;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26360;&#12365;&#25563;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) {0} &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#21462;&#12426;&#26178;&#12395; IOException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12501;&#12449;&#12452;&#12523;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12363;&#12289;&#30772;&#25613;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;&#35501;&#12417;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#21462;&#12426;&#26178;&#12395;&#12289;IOException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12501;&#12449;&#12452;&#12523;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12363;&#12289;&#30772;&#25613;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;&#35501;&#12417;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523; APPLICATION.MF &#12364;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#20181;&#27096;&#12395;&#24467;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; Plugin Config File URI &#12364;&#12289;&#20104;&#26399;&#12375;&#12383; &#24418;&#24335; {0} &#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12398;&#12503;&#12525;&#12499;&#12472;&#12519;&#12491;&#12531;&#12464;&#20013;&#12395;&#19981;&#27491;&#30906;&#12394;&#32080;&#26524;&#12364;&#36820;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#26368;&#22823;&#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12364;&#26368;&#23567;&#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12392;&#21516;&#27096;&#12392;&#12415;&#12394;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12399;&#12289;&#12475;&#12523;&#20869;&#12398;&#19968;&#37096;&#12398;&#12494;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;OSGi Applications Feature Pack &#12364;&#23455;&#34892;&#20013;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531; 7 &#12494;&#12540;&#12489;&#12391;&#12398;&#12415;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12414;&#12377;&#12290; &#35299;&#27770;&#12456;&#12521;&#12540;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12395;&#23550;&#12375;&#12390;&#27491;&#24120;&#12395;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12395;&#23550;&#12375;&#12390;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290; &#12383;&#12384;&#12375;&#12289;&#12371;&#12398;&#35686;&#21578;&#12399;&#12289;&#21427;&#12375;&#36942;&#12366;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#35201;&#20214;&#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12494;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;&#35299;&#27770;&#12456;&#12521;&#12540;&#12398;&#20013;&#12398;&#24773;&#22577;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12494;&#12540;&#12489; {0} &#12391;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12364; Run As &#12525;&#12540;&#12523;&#12434;&#23450;&#32681;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;Run As &#12525;&#12540;&#12523;&#12364;&#23450;&#32681;&#12373;&#12428;&#12383; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12507;&#12473;&#12488;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;Run As &#12525;&#12540;&#12523;&#12364;&#23450;&#32681;&#12373;&#12428;&#12394;&#12367;&#12394;&#12427;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#21516;&#12376;&#12471;&#12531;&#12508;&#12523;&#21517;&#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#20869;&#23481;&#12434;&#12522;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12496;&#12531;&#12489;&#12523;&#12289;&#12362;&#12424;&#12403;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12399;&#12377;&#12409;&#12390;&#21516;&#12376;&#21517;&#21069;&#31354;&#38291;&#12434;&#20849;&#26377;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12371;&#12428;&#12425;&#12399;&#12289;&#21517;&#21069;&#31354;&#38291;&#20869;&#12391;&#22266;&#26377; ID &#12434;&#25345;&#12388;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#26908;&#35388;&#26178;&#12395;&#12289;&#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#21516;&#12376;&#12471;&#12531;&#12508;&#12523;&#21517;&#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12496;&#12531;&#12489;&#12523;&#12408;&#12398;&#21442;&#29031;&#12434;&#35211;&#12388;&#12369;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#21517;&#21069;&#31354;&#38291;&#12391;&#12398;&#34909;&#31361;&#12364;&#12394;&#12367;&#12394;&#12427;&#12424;&#12358;&#12395;&#12289;&#12496;&#12531;&#12489;&#12523;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12289;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: &#12450;&#12475;&#12483;&#12488; {0} &#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12497;&#12483;&#12465;&#12540;&#12472; {2} &#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12395;&#12354;&#12427;&#23646;&#24615; {1} &#12399;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#26178;&#12395;&#28288;&#12383;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    APPLICATION.MF &#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12395;&#12388;&#12356;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#26178;&#12395;&#28288;&#12383;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#23646;&#24615;&#12434;&#20445;&#26377;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12414;&#12383;&#12399;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#26178;&#12395;&#28288;&#12383;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12434;&#20445;&#26377;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;{0} &#12434;&#25313;&#24373;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#27083;&#25104;&#12487;&#12540;&#12479;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: &#12496;&#12531;&#12489;&#12523; {0} &#12434;&#12514;&#12487;&#12523;&#21270;&#12375;&#12390;&#12356;&#12427;&#26178;&#12395;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;: {1}
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12434;&#12514;&#12487;&#12523;&#21270;&#12375;&#12390;&#12356;&#12427;&#26178;&#12395;&#34920;&#35352;&#12398;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#21839;&#38988;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#34920;&#35352;&#12398;&#20363;&#22806;&#12434;&#30906;&#35469;&#12375;&#12289;&#21839;&#38988;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; War {0} &#12395;&#12354;&#12427; web.xml zip &#38917;&#30446;&#12398; InputStream &#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: &#12479;&#12540;&#12466;&#12483;&#12488; {1} &#12391;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {4} &#12398;&#12496;&#12531;&#12489;&#12523; {3} &#12395;&#12354;&#12427; Bean {2} &#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12395;&#23550;&#12375;&#12289;&#21517;&#21069; {0} &#12395;&#19968;&#33268;&#12377;&#12427; MDB &#12522;&#12473;&#12490;&#12540;&#35469;&#35388;&#21029;&#21517;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#35469;&#35388;&#21029;&#21517;&#12399;&#23384;&#22312;&#12375;&#12394;&#12356;&#12363;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#12399;&#35211;&#12360;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#24517;&#35201;&#12394;&#35469;&#35388;&#21029;&#21517;&#12434;&#27083;&#25104;&#12377;&#12427;&#12363;&#12289;&#35469;&#35388;&#21029;&#21517;&#12364;&#12381;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#27491;&#12375;&#12356;&#26377;&#21177;&#31684;&#22258;&#20869;&#12395;&#27083;&#25104;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: &#12450;&#12475;&#12483;&#12488; {0} &#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12371;&#12428;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; APPLICATION.MF &#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523; {1} &#12364;&#24517;&#35201;&#12391;&#12377;&#12290; &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523; {3} &#12363;&#12425;&#12469;&#12540;&#12499;&#12473; {2} &#12434;&#21462;&#12426;&#36796;&#12415;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#27491;&#12375;&#12367;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; &#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12399; &#20998;&#38626;&#12496;&#12531;&#12489;&#12523;&#12363;&#12425;&#12469;&#12540;&#12499;&#12473;&#12434;&#21462;&#12426;&#36796;&#12417;&#12414;&#12379;&#12435;&#12290; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#20998;&#38626;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;Application-ExportService &#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#20351;&#29992;&#12375;&#12390;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12415;&#12395;&#12469;&#12540;&#12499;&#12473;&#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12414;&#12383;&#12399;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523; (&#12522;&#12478;&#12523;&#12496;&#12540;&#12395;&#12424;&#12387;&#12390;&#36861;&#21152;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;) &#12364; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12427;&#12469;&#12540;&#12499;&#12473;&#12434;&#35201;&#27714;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: &#12450;&#12475;&#12483;&#12488; {0} &#12434;&#27083;&#25104;&#21336;&#20301;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;&#12289;&#22806;&#37096;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#26032;&#35215;&#12414;&#12383;&#12399;&#26356;&#26032;&#12373;&#12428;&#12383;&#12450;&#12475;&#12483;&#12488;&#12434;&#27083;&#25104;&#21336;&#20301;&#12395;&#36861;&#21152;&#12377;&#12427;&#12363;&#27083;&#25104;&#21336;&#20301;&#12398;&#20013;&#12391;&#26356;&#26032;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#21069;&#12395;&#12289;1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#20966;&#29702;&#12434;&#38283;&#22987;&#12377;&#12427;&#12395;&#12399;&#12289;&#22793;&#26356;&#12434;&#12510;&#12473;&#12479;&#12540;&#27083;&#25104;&#12395;&#20445;&#23384;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12450;&#12475;&#12483;&#12488;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29366;&#27841;&#12399;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#12450;&#12475;&#12483;&#12488;&#35443;&#32048;&#12497;&#12493;&#12523;&#12363;&#12425;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290; &#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12383;&#24460;&#12289;&#27083;&#25104;&#21336;&#20301;&#12398;&#12450;&#12475;&#12483;&#12488;&#12398;&#36861;&#21152;&#12414;&#12383;&#12399;&#26356;&#26032;&#12434;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: EBA &#12501;&#12449;&#12452;&#12523; {1} &#20869;&#12398; WAR &#12501;&#12449;&#12452;&#12523; {0} &#12398; WAB &#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#22793;&#25563;&#12364;&#27491;&#24120;&#12395;&#23436;&#20102;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12398; Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (WAR) &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523; (WAB) &#12395;&#22793;&#25563;&#12373;&#12428;&#12390;&#12363;&#12425;&#12289;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#22793;&#25563;&#12503;&#12525;&#12475;&#12473;&#12364;&#27491;&#24120;&#12395;&#23436;&#20102;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    WAR &#12501;&#12449;&#12452;&#12523;&#12364;&#26377;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;RepositoryAdminSupport &#12469;&#12540;&#12499;&#12473;&#12399;&#12289;OSGi service registry &#12363;&#12425;&#12399;&#20351;&#29992;&#19981;&#21487;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: &#35469;&#35388;&#21029;&#21517; {0} &#12364;&#12479;&#12540;&#12466;&#12483;&#12488; {1} &#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531; {2} &#12395;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#35469;&#35388;&#21029;&#21517;&#12399;&#12289;Blueprint &#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12398;&#12496;&#12452;&#12531;&#12489;&#26178;&#12395;&#12289;&#12464;&#12525;&#12540;&#12496;&#12523;&#12414;&#12383;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12464;&#12525;&#12540;&#12496;&#12523;&#12414;&#12383;&#12399;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531;&#12395;&#23384;&#22312;&#12377;&#12427;&#35469;&#35388;&#21029;&#21517;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#36969;&#20999;&#12394;&#35469;&#35388;&#21029;&#21517;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12494;&#12540;&#12489; {0} &#12391;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12364;&#12289;Application-Content &#12395;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;Application-Content &#12395; CBA &#12434;&#21547;&#12416; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12507;&#12473;&#12488;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;Application-Content &#12395; CBA &#12364;&#21547;&#12414;&#12428;&#12394;&#12367;&#12394;&#12427;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: &#27083;&#25104;&#21336;&#20301; {0} &#12399; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#21628;&#12403;&#20986;&#12373;&#12428;&#12383;&#25805;&#20316;&#12399; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#27083;&#25104;&#21336;&#20301;&#12391;&#20316;&#21205;&#12375;&#12414;&#12377;&#12290; &#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#21336;&#20301;&#12399; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#21336;&#20301;&#12364;&#12479;&#12452;&#12503;&#12539;&#12450;&#12475;&#12483;&#12488;&#12300;EBA,version=1.0&#12301;&#12398;&#12450;&#12475;&#12483;&#12488;&#12395;&#12424;&#12387;&#12390;&#25903;&#25588;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#12450;&#12475;&#12483;&#12488;&#12539;&#12496;&#12452;&#12490;&#12522;&#12540; {0} &#12363;&#12425;&#25277;&#20986;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;ModelledResourceManager &#12469;&#12540;&#12499;&#12473;&#12399;&#12289;OSGi service registry &#12363;&#12425;&#12399;&#20351;&#29992;&#19981;&#21487;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12398; CBA &#12496;&#12531;&#12489;&#12523; {0} &#12434;&#12514;&#12487;&#12523;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: Java EE &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12364; EBA &#12501;&#12449;&#12452;&#12523; {0} &#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#12371;&#12398;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;WAR &#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12434;&#23450;&#32681;&#12377;&#12427;&#12289;&#38306;&#36899;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523; application.xml &#12394;&#12375;&#12391;&#12289;Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (WAR) &#12434;&#20966;&#29702;&#12375;&#12414;&#12375;&#12383;&#12290; &#12510;&#12452;&#12464;&#12524;&#12540;&#12471;&#12519;&#12531;&#28168;&#12415; WAR &#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12395;&#27491;&#12375;&#12367;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: &#12371;&#12398;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12383;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#20966;&#29702;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#21547;&#12416; EBA &#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290; &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#20966;&#29702;&#12399;&#27491;&#24120;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#38480;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12289;&#12381;&#12375;&#12390;&#12501;&#12449;&#12452;&#12523;&#12364;&#30772;&#25613;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#32232;&#38598;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434; EBA &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;EBA &#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#26178;&#12395;&#12289;&#26032;&#12375;&#12356;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;{0} &#12469;&#12540;&#12499;&#12473;&#12399;&#12289;OSGi &#12469;&#12540;&#12499;&#12473;&#12539;&#12524;&#12472;&#12473;&#12488;&#12522;&#12540;&#12363;&#12425;&#12399;&#20351;&#29992;&#19981;&#21487;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12473;&#12488;&#12524;&#12540;&#12472;&#12539;&#12473;&#12506;&#12540;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#35069;&#21697;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523; {0} &#12398;&#12479;&#12452;&#12503;&#12399;&#20104;&#26399;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12398;&#22949;&#24403;&#24615;&#26908;&#26619;&#12362;&#12424;&#12403;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;SystemOut.log &#12501;&#12449;&#12452;&#12523;&#12398;&#20184;&#38543;&#12377;&#12427;&#12456;&#12521;&#12540;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: &#19968;&#33268;&#12377;&#12427;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12383;&#12417;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {3} &#12434;&#20351;&#29992;&#12375;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398;&#12496;&#12531;&#12489;&#12523; {1} &#12395; EJB &#21442;&#29031; {0} &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12399;&#12289;&#12450;&#12531;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12383; EJB &#21442;&#29031;&#12395;&#23550;&#12375;&#12390;&#20316;&#25104;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#21442;&#29031;&#12398;&#12496;&#12452;&#12531;&#12489;&#20808;&#12398;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12371;&#12398;&#21442;&#29031;&#12434;&#26082;&#30693;&#12398; JNDI &#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12450;&#12475;&#12483;&#12488; {0} &#12398;&#27083;&#25104;&#12450;&#12475;&#12483;&#12488;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: JNDI &#21517; {0} &#12362;&#12424;&#12403;&#12479;&#12452;&#12503; {1} &#12398;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12364;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {5} &#12398;&#12496;&#12531;&#12489;&#12523; {4} &#12395;&#23450;&#32681;&#12373;&#12428;&#12383; EJB &#12522;&#12477;&#12540;&#12473;&#21442;&#29031; {3} &#12398;&#12479;&#12540;&#12466;&#12483;&#12488; {2} &#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    EJB &#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12434;&#21547;&#12416;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12399;&#12289;JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12398; JNDI &#21517;&#12434;&#25351;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12381;&#12398;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12364; JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21517;&#21069;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12434;&#35330;&#27491;&#12375;&#12390; EBA &#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: &#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12398;&#27083;&#25104;&#21336;&#20301; {0} &#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#20572;&#27490;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#20572;&#27490;&#25805;&#20316;&#20013;&#12395;&#12289;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#29305;&#23450;&#12398;&#21839;&#38988;&#35386;&#26029;&#12398;&#35443;&#32048;&#12399;&#12289;&#12371;&#12398;&#20363;&#22806;&#12424;&#12426;&#21069;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: &#12525;&#12540;&#12523; {0} &#12399;&#26377;&#21177;&#12394;&#12525;&#12540;&#12523;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12540;&#12523;&#12399;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12525;&#12540;&#12523;&#12434;&#27083;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540; {0} &#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12391;&#12398;&#24517;&#38920;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540; {2} &#12391;&#25313;&#24373;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12463;&#12521;&#12473;&#12479;&#12540;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12540;&#12398;&#12377;&#12409;&#12390;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12377;&#12409;&#12390;&#12398;&#24517;&#38920;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12364;&#21547;&#12414;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#12365;&#12289;&#12463;&#12521;&#12473;&#12479;&#12540;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#24517;&#38920;&#12392;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12364;&#12381;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#21547;&#12414;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12463;&#12521;&#12473;&#12479;&#12540;&#12398;&#25552;&#26696;&#12373;&#12428;&#12383;&#12513;&#12531;&#12496;&#12540;&#12395;&#12289;&#12456;&#12521;&#12540;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12522;&#12473;&#12488;&#12373;&#12428;&#12383; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12377;&#12409;&#12390;&#12398;&#24517;&#38920;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12473;&#12488;&#12524;&#12540;&#12472;&#12539;&#12473;&#12506;&#12540;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#35069;&#21697;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#20869;&#23481;&#12364;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#27425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20887;&#38263;&#12391;&#12377;&#12290;{0}&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12391;&#12399;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12395;&#12289;&#20363;&#22806;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#32232;&#38598;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434; EBA &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12398;&#22580;&#21512;&#12289;EBA &#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#26178;&#12395;&#12289;&#26032;&#12375;&#12356;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: &#25351;&#23450;&#12373;&#12428;&#12383;&#12464;&#12523;&#12540;&#12503; {0} &#12364;&#28961;&#21177;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12434;&#28961;&#21177;&#12394;&#12464;&#12523;&#12540;&#12503;&#12395;&#12510;&#12483;&#12503;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12464;&#12523;&#12540;&#12503;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; Admin Service &#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: &#27083;&#25104;&#21336;&#20301; {0} &#12395;&#23550;&#12377;&#12427;&#25313;&#24373;&#12395;&#12399;&#22806;&#37096;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#27083;&#25104;&#21336;&#20301;&#12395;&#23550;&#12377;&#12427;&#25313;&#24373;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#12434;&#20316;&#25104;&#12414;&#12383;&#12399;&#26356;&#26032;&#12375;&#12414;&#12375;&#12383;&#12290; &#12371;&#12398;&#25313;&#24373;&#12434;&#27083;&#25104;&#21336;&#20301;&#12395;&#36861;&#21152;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#12381;&#12398;&#21069;&#12395;&#12289;1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#20966;&#29702;&#12434;&#38283;&#22987;&#12377;&#12427;&#12395;&#12399;&#12289;&#12510;&#12473;&#12479;&#12540;&#27083;&#25104;&#12395;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;  &#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#27083;&#25104;&#21336;&#20301;&#35443;&#32048;&#12497;&#12493;&#12523;&#12363;&#12425;&#12289;&#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29366;&#27841;&#12434;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290; &#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#24453;&#12387;&#12390;&#12363;&#12425;&#12289;&#25313;&#24373;&#12434;&#27083;&#25104;&#21336;&#20301;&#12395;&#36861;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: &#12356;&#12378;&#12428;&#12398;&#12469;&#12540;&#12496;&#12540;&#12362;&#12424;&#12403;&#12463;&#12521;&#12473;&#12479;&#12540;&#12395;&#12418;&#12450;&#12475;&#12483;&#12488; {1} &#29992;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#24517;&#38920;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540; {0} &#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#24517;&#38920;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12399;&#12356;&#12378;&#12428;&#12398;&#12469;&#12540;&#12496;&#12540;&#12391;&#12418;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#26368;&#20302;&#12391;&#12418; 1 &#12388;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#24517;&#38920;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12395; &#20197;&#19979;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#27424;&#33853;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;{1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: &#12450;&#12475;&#12483;&#12488; {0} &#12399;&#26082;&#12395;&#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12371;&#12398;&#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;: {1}
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488; &#12399;&#12289;&#21336;&#19968;&#12398;&#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; (BLA) &#12395;&#12398;&#12415;&#26684;&#32013;&#12391;&#12365;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21516;&#12376;&#12467;&#12531;&#12486;&#12531;&#12484;&#12391;&#30064;&#12394;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12471;&#12531;&#12508;&#12523;&#21517;&#12398;&#12289;&#26032;&#12375;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#26032;&#35215;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434; EBA &#12450;&#12475;&#12483;&#12488;&#12392;&#12375;&#12390;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12390;&#12363;&#12425;&#12289;&#12371;&#12398; BLA &#12395;&#36861;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#12503;&#12525;&#12499;&#12472;&#12519;&#12491;&#12531;&#12464;&#12395;&#12424;&#12387;&#12390;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12362;&#12424;&#12403; WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12395;&#30064;&#12394;&#12427;&#32080;&#26524;&#12364;&#29983;&#12376;&#12414;&#12375;&#12383;&#12290; &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12398;&#32080;&#26524;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12362;&#12424;&#12403; WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12395;&#23550;&#12375;&#12390;&#27491;&#24120;&#12395;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290; &#12383;&#12384;&#12375;&#12289;2 &#12388;&#12398;&#12503;&#12525;&#12499;&#12472;&#12519;&#12491;&#12531;&#12464;&#25805;&#20316;&#12391;&#30064;&#12394;&#12427;&#32080;&#26524;&#12364;&#24471;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290; &#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#30064;&#12394;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12391;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1} &#12364;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12364;&#27083;&#25104;&#21336;&#20301;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; EBA &#12395;&#21547;&#12414;&#12428;&#12427; Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12364; Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12394;&#12375;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12362;&#12424;&#12403;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12473;&#12486;&#12483;&#12503; {0} &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: &#12450;&#12475;&#12483;&#12488; {0} &#12395;&#12399;&#12289;&#12496;&#12531;&#12489;&#12523;&#12391;&#12399;&#12394;&#12367;&#22793;&#25563;&#12373;&#12428;&#12394;&#12356; JAR &#12501;&#12449;&#12452;&#12523; {1} &#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20182;&#12398;&#37096;&#20998;&#12364;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#23455;&#34892;&#26178;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38556;&#23475;&#12364;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12540; Java &#12450;&#12540;&#12459;&#12452;&#12502; (JAR) &#12501;&#12449;&#12452;&#12523;&#12362;&#12424;&#12403; Enterprise JavaBeans (EJB) JAR &#12501;&#12449;&#12452;&#12523;&#12398;&#22793;&#25563;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12356;&#12378;&#12428;&#12398;&#12496;&#12531;&#12489;&#12523;&#12362;&#12424;&#12403; Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523; (WAB) &#12418; JAR &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12398;&#12463;&#12521;&#12473;&#12395;&#20381;&#23384;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#35686;&#21578;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36991;&#12369;&#12427;&#12395;&#12399;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12363;&#12425; JAR &#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12362;&#12424;&#12403;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: &#12496;&#12540;&#12472;&#12519;&#12531; {3} &#12398;&#12496;&#12531;&#12489;&#12523; {2} &#12395;&#12354;&#12427;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean {1} &#12398; EJB &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {0} &#12434;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531; {4} &#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12525;&#12540;&#12459;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427; EJB &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12399; ejblocal: &#21517;&#21069;&#31354;&#38291;&#20869;&#12395;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#12398;&#12300;&#12525;&#12540;&#12459;&#12523;&#12301;&#12499;&#12517;&#12540;&#12289;&#12300;&#38750;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12301;&#12499;&#12517;&#12540;&#12289;&#12300;&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12540;&#12512;&#12301;&#12499;&#12517;&#12540;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427; JNDI &#20869;&#12395;&#12375;&#12363;&#12496;&#12452;&#12531;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12371;&#12428;&#12399;&#12289;&#12381;&#12428;&#12425;&#12398;&#12496;&#12452;&#12531;&#12489;&#21517;&#12364;&#12300;ejblocal:&#12301;&#12391;&#22987;&#12414;&#12427;&#12418;&#12398;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12525;&#12540;&#12459;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12377;&#12409;&#12390;&#12398; EJB &#12499;&#12517;&#12540;&#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#21517;&#12434;&#35519;&#25972;&#12375;&#12390;&#12289;&#12371;&#12428;&#12425;&#12364; ejblocal: &#21517;&#21069;&#31354;&#38291;&#25509;&#38957;&#37096;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: CompUnitStatusStep &#12399;&#12289;&#27083;&#25104;&#21336;&#20301; {0} &#12434;&#12450;&#12475;&#12483;&#12488; {1} &#12363;&#12425;&#20351;&#29992;&#21487;&#33021;&#12394;&#26368;&#26032;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#27083;&#25104;&#21336;&#20301; {0} &#12399;&#26368;&#26032;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#27083;&#25104;&#21336;&#20301;&#20869;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12475;&#12483;&#12488;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12426;&#12289;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12373;&#12428;&#12383;&#12450;&#12475;&#12483;&#12488;&#12364;&#24517;&#35201;&#12392;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#28168;&#12415;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12450;&#12475;&#12483;&#12488;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12377;&#12409;&#12390;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12450;&#12475;&#12483;&#12488; {0} &#12398;&#27083;&#25104;&#21336;&#20301;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12494;&#12540;&#12489; {0} &#12391;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12364;&#25313;&#24373;&#12373;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#12434;&#12469;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12507;&#12473;&#12488;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#12494;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#23455;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#25313;&#24373;&#12434;&#38500;&#21435;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: &#27083;&#25104;&#21336;&#20301; {1} &#12398;&#12496;&#12531;&#12489;&#12523; {0} &#12399;&#12289;&#21516;&#12376;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#20351;&#29992;&#12375;&#12383;&#31478;&#21512;&#12377;&#12427;&#25313;&#24373;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#26356;&#26032;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12381;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#21516;&#12376;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#20351;&#29992;&#12375;&#12383;&#25313;&#24373;&#12364;&#26082;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;cba &#12496;&#12531;&#12489;&#12523;&#12434;&#35201;&#27714;&#12373;&#12428;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#26356;&#26032;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12371;&#12398;&#25313;&#24373;&#12434;&#21066;&#38500;&#12377;&#12427;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#26356;&#26032;&#24460;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: &#12479;&#12540;&#12466;&#12483;&#12488; {1} &#12391;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {4} &#12398;&#12496;&#12531;&#12489;&#12523; {3} &#12395;&#12354;&#12427; Bean {2} &#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12395;&#23550;&#12375;&#12289;JNDI &#21517; {0} &#12395;&#19968;&#33268;&#12377;&#12427; MDB &#12450;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12506;&#12483;&#12463;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; MDB &#12522;&#12473;&#12490;&#12540;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12450;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12506;&#12483;&#12463;&#12398;&#21442;&#29031; JNDI &#21517;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12381;&#12398;&#21442;&#29031;&#12364; JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21517;&#21069;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#21442;&#29031;&#12434;&#35330;&#27491;&#12375;&#12390; EBA &#12434;&#26356;&#26032;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12450;&#12475;&#12483;&#12488; {0} &#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#29031;&#20250;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12395;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523; {1} &#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30452;&#25509; EBA &#12395;&#32068;&#12415;&#36796;&#12416;&#12383;&#12417;&#12395;&#12289;Application-Content &#12504;&#12483;&#12480;&#12540;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290; Application-Content &#12395;&#20491;&#21029;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#32068;&#12415;&#36796;&#12416;&#12363;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12434;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#20849;&#26377;&#12391;&#12365;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#27491;&#12375;&#12356;&#21517;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12496;&#12531;&#12489;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#23384;&#22312;&#12375;&#12414;&#12377;&#12364;&#12289;&#20104;&#26399;&#12375;&#12383;&#12496;&#12531;&#12489;&#12523; {0}/{1} &#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: JNDI &#21517; {0} &#12362;&#12424;&#12403;&#12479;&#12452;&#12503; {1} &#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#23451;&#20808;&#21442;&#29031;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#29872;&#22659;&#21442;&#29031;&#12364;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {5} &#12398;&#12496;&#12531;&#12489;&#12523; {4} &#12395;&#23450;&#32681;&#12373;&#12428;&#12383; EJB &#12513;&#12483;&#12475;&#12540;&#12472;&#23451;&#20808;&#21442;&#29031;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#29872;&#22659;&#21442;&#29031; {3} &#12398;&#12479;&#12540;&#12466;&#12483;&#12488; {2} &#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    EJB &#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#23451;&#20808;&#21442;&#29031;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#29872;&#22659;&#21442;&#29031;&#12434;&#21547;&#12416;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12399;&#12289;JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#23451;&#20808;&#21442;&#29031;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#29872;&#22659;&#21442;&#29031;&#12398; JNDI &#21517;&#12434;&#25351;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12381;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#23451;&#20808;&#21442;&#29031;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#29872;&#22659;&#21442;&#29031;&#12364; JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21517;&#21069;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#23451;&#20808;&#21442;&#29031;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#29872;&#22659;&#21442;&#29031;&#12434;&#35330;&#27491;&#12375;&#12390; EBA &#12434;&#26356;&#26032;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12395; 2 &#12388;&#12398;&#36899;&#32154;&#12377;&#12427;&#12500;&#12522;&#12458;&#12489;&#25991;&#23383;&#12364;&#21547;&#12414;&#12428;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12395;&#12473;&#12488;&#12522;&#12531;&#12464;&#12300;..&#12301;(&#12377;&#12394;&#12431;&#12385;&#12289;2 &#12388;&#12398;&#36899;&#32154;&#12377;&#12427;&#12500;&#12522;&#12458;&#12489;&#25991;&#23383;) &#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#35501;&#12415;&#21462;&#12428;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#21462;&#12426;&#26178;&#12395;&#12289;IOException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12501;&#12449;&#12452;&#12523;&#12364;&#30772;&#25613;&#12375;&#12390;&#12356;&#12427;&#12363;&#35501;&#12417;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12395;&#36969;&#20999;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12426;&#12289;&#27491;&#12375;&#12356;&#24418;&#24335;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; SecurityAdmin MBean &#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12398;&#20869;&#23481;&#12395;&#12354;&#12427;&#12469;&#12540;&#12499;&#12473;&#21442;&#29031;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12399; CBA &#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;CBA &#12399;&#12371;&#12428;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#27425;&#12398;&#12469;&#12540;&#12499;&#12473;&#20381;&#23384;&#38306;&#20418;&#12364;&#26410;&#35299;&#27770;&#12391;&#12377;: {1}
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12469;&#12540;&#12499;&#12473;&#12414;&#12383;&#12399; CBA &#20869;&#12398;&#21029;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12383;&#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;CBA &#12399;&#12381;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12434;&#35330;&#27491;&#12375;&#12390;&#12289;CBA &#12364;&#12289;CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20351;&#29992;&#12377;&#12427;&#12469;&#12540;&#12499;&#12473;&#12362;&#12424;&#12403;&#20182;&#12398;&#22580;&#21512;&#12395;&#12399; CBA &#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12469;&#12540;&#12499;&#12473;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: &#12510;&#12452;&#12464;&#12524;&#12540;&#12471;&#12519;&#12531;&#28168;&#12415; EBA &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#26360;&#12365;&#36796;&#12415;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12510;&#12452;&#12464;&#12524;&#12540;&#12471;&#12519;&#12531;&#28168;&#12415;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12398;&#26360;&#12365;&#36796;&#12415;&#26178;&#12395;&#12289;IOException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#38306;&#36899;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12408;&#12398;&#26360;&#12365;&#36796;&#12415;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#35069;&#21697;&#12395;&#12354;&#12427;&#12371;&#12392;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12483;&#12463;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#12473;&#12488;&#12524;&#12540;&#12472;&#12539;&#12473;&#12506;&#12540;&#12473;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12399;&#12289;&#12475;&#12523;&#20869;&#12398;&#19968;&#37096;&#12398;&#12494;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12494;&#12540;&#12489;&#12391;&#12398;&#12415;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12414;&#12377;&#12290; &#35299;&#27770;&#12456;&#12521;&#12540;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12395;&#23550;&#12375;&#12390;&#27491;&#24120;&#12395;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 &#12398; OSGi Applications Feature Pack &#12395;&#23550;&#12375;&#12390;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290; &#12383;&#12384;&#12375;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12395;&#23550;&#12375;&#12390;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;&#35299;&#27770;&#12456;&#12521;&#12540;&#12398;&#20013;&#12398;&#24773;&#22577;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: &#12469;&#12540;&#12496;&#12540; {0} &#12398;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12395;&#12289;localhost &#12434;&#12507;&#12473;&#12488;&#21517;&#12392;&#12375;&#12390;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;{1}&#12290; &#35201;&#27714;&#12523;&#12540;&#12486;&#12451;&#12531;&#12464;&#12364;&#27231;&#33021;&#12377;&#12427;&#12398;&#12399;&#12289;Web &#12469;&#12540;&#12496;&#12540;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12364;&#21516;&#12376;&#12494;&#12540;&#12489;&#19978;&#12395;&#12354;&#12427;&#22580;&#21512;&#12395;&#38480;&#12425;&#12428;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12398;&#12507;&#12473;&#12488;&#21517;&#12364;&#12289;localhost &#12392;&#12375;&#12390;&#35299;&#27770;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    Web &#12469;&#12540;&#12496;&#12540;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12364;&#30064;&#12394;&#12427;&#12494;&#12540;&#12489;&#19978;&#12395;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12398;&#12507;&#12473;&#12488;&#21517;&#12364; localhost &#12392;&#12375;&#12390;&#35299;&#27770;&#12373;&#12428;&#12383;&#29702;&#30001;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; EBA &#12398; Application-SymbolicName {1} &#12399;&#12289;&#12450;&#12475;&#12483;&#12488; {2} &#12395;&#12424;&#12387;&#12390;&#26082;&#12395;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    EBA &#12501;&#12449;&#12452;&#12523;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#21516;&#12376;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#25345;&#12388;&#26082;&#23384;&#12398;&#12450;&#12475;&#12483;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12356;&#12427; EBA &#12398;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#22793;&#26356;&#12377;&#12427;&#12363;&#12289;&#26082;&#23384;&#12450;&#12475;&#12483;&#12488;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12494;&#12540;&#12489; {0} &#12391;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;&#12381;&#12398;&#12494;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12434;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12391;&#12377;&#12290; &#35299;&#27770;&#12456;&#12521;&#12540;&#12399; {2} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;&#31034;&#12373;&#12428;&#12383; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12463;&#12521;&#12473;&#12479;&#12540;&#12539;&#12513;&#12531;&#12496;&#12540;&#12434;&#12507;&#12473;&#12488;&#12377;&#12427;&#12289;&#21029;&#12398;&#20114;&#25563;&#24615;&#12398;&#12354;&#12427;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#12494;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#23455;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {1} &#12398;&#12501;&#12449;&#12452;&#12523; {0} &#12434;&#27083;&#25991;&#35299;&#26512;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#31034;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12434;&#27083;&#25991;&#35299;&#26512;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12449;&#12452;&#12523;&#12364;&#27491;&#12375;&#12367;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12390;&#30772;&#25613;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12362;&#12424;&#12403;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: &#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;: {0}
  </MsgText>
  <Explanation>
    &#12450;&#12475;&#12483;&#12488;&#12398;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#20013;&#12395;&#12289;&#24517;&#38920;&#12497;&#12473;&#21517;&#12398;&#20316;&#25104;&#12391;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#12289;&#12371;&#12398;&#12497;&#12473;&#21517;&#12434;&#20316;&#25104;&#12377;&#12427;&#27177;&#38480;&#12364;&#12354;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: WAS V7 &#12398; UpdateAppContentVersionStep &#12467;&#12510;&#12531;&#12489;&#12399;&#12289;WAS V8 &#12398; UpdateAppContentVersions &#12467;&#12510;&#12531;&#12489;&#12391;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    WAS V7 &#12398; UpdateAppContentVersionStep &#12467;&#12510;&#12531;&#12489;&#12399;&#12289;WAS V8 &#12398; UpdateAppContentVersions &#12467;&#12510;&#12531;&#12489;&#12391;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290; &#35443;&#12375;&#12367;&#12399;&#12289;&#12452;&#12531;&#12501;&#12457;&#12513;&#12540;&#12471;&#12519;&#12531;&#12539;&#12475;&#12531;&#12479;&#12540;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </Explanation>
  <UserResponse>
    UpdateAppContentVersions &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12473;&#12463;&#12522;&#12503;&#12488;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#35299;&#27770;&#26178;&#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12395;&#12487;&#12503;&#12525;&#12452;&#21487;&#33021;&#12394;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: EBA &#12501;&#12449;&#12452;&#12523;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {0}
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#25104;&#35201;&#32032;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523;&#12398;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12289;&#36969;&#20999;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#35443;&#12375;&#12367;&#12399;&#12289;&#20363;&#22806;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12469;&#12540;&#12499;&#12473; {1} &#12364;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: &#25351;&#23450;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540; {0} &#12364;&#28961;&#21177;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12525;&#12540;&#12523;&#12434;&#28961;&#21177;&#12394;&#12518;&#12540;&#12470;&#12540;&#12395;&#12510;&#12483;&#12503;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12503;&#12525;&#12501;&#12449;&#12452;&#12523; {0} &#12398; BundleCacheManager &#12398; MBean &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {4} &#12434;&#20351;&#29992;&#12375;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531; {3} &#12398;&#12496;&#12531;&#12489;&#12523; {2} &#12395;&#12354;&#12427; EJB &#21442;&#29031; {1} &#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464; {0} &#12364;&#21407;&#22240;&#12391;&#12289;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#24460;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#27491;&#12375;&#12367;&#27231;&#33021;&#12375;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    java:global/application_name/module_name/ejb_name &#12414;&#12383;&#12399; java:app/module_name/ejb_name &#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21442;&#29031;&#12398;&#27083;&#25104;&#35201;&#32032;&#12497;&#12540;&#12484;&#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#26356;&#26032;&#24460;&#12395;&#22793;&#26356;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12289;&#12381;&#12428;&#12395;&#24540;&#12376;&#12390;&#21442;&#29031;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#12371;&#12398;&#25163;&#27861;&#12399;&#23455;&#29992;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    OSGi &#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390; EJB &#20381;&#23384;&#38306;&#20418;&#12434;&#27083;&#25104;&#12377;&#12427;&#12363;&#12289;EJB &#21442;&#29031;&#12434;&#23459;&#35328;&#12375;&#12390;&#12371;&#12428;&#12434; EJB JNDI &#21517;&#12395;&#12510;&#12483;&#12503;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#12434;&#25313;&#24373;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {1} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; EBA &#12501;&#12449;&#12452;&#12523;&#12434;&#25313;&#24373;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12289;&#24517;&#38920;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#27177;&#38480;&#12364;&#12354;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: &#12450;&#12475;&#12483;&#12488; {0} &#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20197;&#19979;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#38750;&#20114;&#25563;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35201;&#20214;&#12364;&#12354;&#12426;&#12414;&#12377;: {1}&#12290;
  </MsgText>
  <Explanation>
    APPLICATION.MF &#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12395;&#12388;&#12356;&#12390;&#12289;&#25152;&#23450;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12409;&#12390;&#12395;&#20114;&#25563;&#24615;&#12398;&#12354;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#35201;&#20214;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12414;&#12383;&#12399;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12496;&#12531;&#12489;&#12523;&#12395;&#12289;&#20114;&#25563;&#24615;&#12398;&#12354;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35201;&#20214;&#12434;&#25345;&#12383;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Run As &#12525;&#12540;&#12523;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#12424;&#12426;&#21069;&#12398;&#12494;&#12540;&#12489;&#12395;&#12399;&#27083;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#27083;&#25104;&#12399;&#12393;&#12428;&#12418;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    Run As &#12525;&#12540;&#12523;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 8 &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290; Run As &#12525;&#12540;&#12523;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#27083;&#25104;&#21336;&#20301;&#12395;&#23550;&#12375;&#12390;&#27083;&#25104;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290; Run As &#12525;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;WebSphere Application Server &#12496;&#12540;&#12472;&#12519;&#12531; 7 OSGi Applications Feature Pack &#12398;&#12494;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#38500;&#21435;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: &#12518;&#12540;&#12470;&#12540; ID &#12414;&#12383;&#12399;&#12497;&#12473;&#12527;&#12540;&#12489;&#12364;&#38291;&#36949;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#38291;&#36949;&#12387;&#12383;&#12518;&#12540;&#12470;&#12540; ID &#12414;&#12383;&#12399;&#12497;&#12473;&#12527;&#12540;&#12489;&#12364;&#25351;&#23450;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#27491;&#12375;&#12356;&#12518;&#12540;&#12470;&#12540; ID &#12362;&#12424;&#12403;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#20966;&#32622;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: &#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {1} &#12398;&#27083;&#25104;&#21336;&#20301; {0} &#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#26356;&#26032;&#25805;&#20316;&#12364;&#22833;&#25943;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#26356;&#26032;&#25805;&#20316;&#20013;&#12395;&#12289;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#29305;&#23450;&#12398;&#21839;&#38988;&#35386;&#26029;&#12398;&#35443;&#32048;&#12399;&#12289;&#12371;&#12398;&#20363;&#22806;&#12424;&#12426;&#21069;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {0} &#20869;&#12395;&#12354;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398; Application-Content &#38917;&#30446;&#12364;&#31354;&#12398;&#12383;&#12417;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#20869;&#12398; Java EE &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#21462;&#12428;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#20869;&#12398; Java EE &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12398;&#35501;&#12415;&#21462;&#12426;&#26178;&#12395;&#12289;IOException &#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12364;&#30772;&#25613;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12289;&#35501;&#12417;&#12427;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#36969;&#20999;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: JNDI &#21517; {0} &#12362;&#12424;&#12403;&#12479;&#12452;&#12503; {1} &#12398;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12364;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {5} &#12398;&#12496;&#12531;&#12489;&#12523; {4} &#12395;&#23450;&#32681;&#12373;&#12428;&#12383; Web &#12514;&#12472;&#12517;&#12540;&#12523;&#12539;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031; {3} &#12398;&#12479;&#12540;&#12466;&#12483;&#12488; {2} &#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (WAR) &#12395;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12434;&#21547;&#12416;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12399;&#12289;JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12395; JNDI &#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12381;&#12398;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12364; JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21517;&#21069;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12434;&#35330;&#27491;&#12375;&#12390; EBA &#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: &#21487;&#33021;&#12394;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12364;&#35079;&#25968;&#23384;&#22312;&#12377;&#12427;&#12383;&#12417;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {3} &#12434;&#20351;&#29992;&#12375;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398;&#12496;&#12531;&#12489;&#12523; {1} &#12395; EJB &#21442;&#29031; {0} &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#12371;&#12398;&#21442;&#29031;&#12399;&#12289;&#27425;&#12398;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;: {4}&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12399;&#12289;&#12450;&#12531;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12383; EJB &#21442;&#29031;&#12395;&#23550;&#12375;&#12390;&#20316;&#25104;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#21442;&#29031;&#12398;&#12496;&#12452;&#12531;&#12489;&#20808;&#12392;&#12375;&#12390;&#21487;&#33021;&#12394;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#12364;&#35079;&#25968;&#35211;&#12388;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12371;&#12398;&#21442;&#29031;&#12434;&#29305;&#23450;&#12398;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: &#35469;&#35388;&#21029;&#21517; {0} &#12398;&#27083;&#25104;&#12364;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35469;&#35388;&#12479;&#12452;&#12503;&#12398;&#21029;&#21517;&#12434;&#21442;&#29031;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12371;&#12392;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35469;&#35388;&#12479;&#12452;&#12503;&#12398;&#35469;&#35388;&#21029;&#21517;&#12399;&#12289;Blueprint &#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12395;&#12496;&#12452;&#12531;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#38306;&#36899;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#21442;&#29031;&#12363;&#12425;&#35469;&#35388;&#21029;&#21517;&#12434;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: &#12496;&#12531;&#12489;&#12523; {1} &#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#20206;&#24819;&#12507;&#12473;&#12488; {0} &#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#28961;&#21177;&#12394;&#20206;&#24819;&#12507;&#12473;&#12488;&#12395; Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12531;&#12489;&#12523; (WAB) &#12434;&#12510;&#12483;&#12503;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#20206;&#24819;&#12507;&#12473;&#12488;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#12289;Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12418;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    APPLICATION.MF &#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#21517;&#12399;&#12289;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378; Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12399;&#12522;&#12473;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;&#12496;&#12531;&#12489;&#12523;&#21517;&#12364; Application-Content &#12504;&#12483;&#12480;&#12540;&#12392; Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12391;&#37325;&#35079;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12364;&#28961;&#21177;&#12391;&#12377;&#12290; CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12395;&#12424;&#12387;&#12390;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364; CBA &#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398; Import-Package &#12504;&#12483;&#12480;&#12540;&#12363;&#12425;&#27424;&#33853;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#27425;&#12398;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12414;&#12375;&#12383;: {1}
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399; CBA &#20869;&#12398;&#21029;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;CBA &#12399;&#12381;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12434;&#35330;&#27491;&#12375;&#12390;&#12289;CBA &#12364;&#12289;CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20351;&#29992;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12362;&#12424;&#12403;&#20182;&#12398;&#22580;&#21512;&#12395;&#12399; CBA &#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: &#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398;&#12496;&#12531;&#12489;&#12523; {1} &#12395;&#12354;&#12427;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean {0} &#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473; {3} &#29992;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#35079;&#25968;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290; &#12510;&#12483;&#12500;&#12531;&#12464;&#12399; {4} &#12392; {5} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12395;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427; EJB &#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#12289;EJB &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#29992;&#12398;&#19981;&#26126;&#30906;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#27083;&#25104;&#24773;&#22577;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21508; EJB &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12395; 1 &#12388;&#12398;&#27083;&#25104;&#28168;&#12415;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#12424;&#12358;&#12395;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: &#21517;&#21069; {0} &#12398;&#27083;&#25104;&#21336;&#20301;&#12399;&#29694;&#34892;&#12475;&#12523;&#12395;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#21517;&#21069;&#12399;&#26082;&#23384;&#12398;&#27083;&#25104;&#21336;&#20301;&#21517;&#12398;&#12393;&#12428;&#12392;&#12418;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#27083;&#25104;&#21336;&#20301;&#21517;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12399; Extension-List &#12504;&#12483;&#12480;&#12540;&#12364;&#12354;&#12427; MANIFEST.MF &#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#12504;&#12483;&#12480;&#12540;&#12398;&#22793;&#25563;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    EAR &#12364; Extension-List &#12504;&#12483;&#12480;&#12540;&#12364;&#12354;&#12427; MANIFEST.MF &#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EAR) &#12501;&#12449;&#12452;&#12523;&#12434;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12395;&#22793;&#25563;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12371;&#12398;&#12504;&#12483;&#12480;&#12540;&#12398;&#22793;&#25563;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; EAR &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;Extension-List &#12504;&#12483;&#12480;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#26178;&#12395;&#24517;&#35201;&#12392;&#12377;&#12427;&#22806;&#37096; JAR &#12434;&#35672;&#21029;&#12375;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    Extension-List &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#22806;&#37096; JAR &#12364;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12391;&#12496;&#12531;&#12489;&#12523;&#12392;&#12375;&#12390;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: &#12450;&#12475;&#12483;&#12488; {0} &#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12371;&#12428;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; APPLICATION.MF &#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523; {1} &#12364;&#24517;&#35201;&#12391;&#12377;&#12290; &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523; {3} &#12363;&#12425;&#12497;&#12483;&#12465;&#12540;&#12472; {2} &#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#27491;&#12375;&#12367;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; &#20849;&#26377;&#12496;&#12531;&#12489;&#12523;&#12399; &#20998;&#38626;&#12496;&#12531;&#12489;&#12523;&#12363;&#12425;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#20998;&#38626;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12371;&#12398;&#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#12415;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#25552;&#20379;&#12391;&#12365;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12414;&#12383;&#12399;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523; (&#12522;&#12478;&#12523;&#12496;&#12540;&#12395;&#12424;&#12387;&#12390;&#36861;&#21152;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;) &#12364; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12363;&#12425;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#35201;&#27714;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep &#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#23455;&#34892;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: &#12450;&#12475;&#12483;&#12488; {0} &#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531; {2} &#12398;&#12479;&#12540;&#12466;&#12483;&#12488; {1} &#12395;&#12418;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531; {4} &#12398;&#12479;&#12540;&#12466;&#12483;&#12488; {3} &#12395;&#12418;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12475;&#12483;&#12488;&#12434;&#35079;&#25968;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12364;&#21516;&#12376;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;&#21336;&#19968;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#12539;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12354;&#12427;&#12475;&#12483;&#12488;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395; CompositeBundle-ExportService &#12504;&#12483;&#12480;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;CBA &#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#12469;&#12540;&#12499;&#12473;&#12398;&#20013;&#12395;&#12371;&#12398;&#12501;&#12451;&#12523;&#12479;&#12540;&#12392;&#19968;&#33268;&#12377;&#12427;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364; CompositeBundle-ExportService &#12504;&#12483;&#12480;&#12540;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#12501;&#12451;&#12523;&#12479;&#12540;&#12392;&#19968;&#33268;&#12377;&#12427; Blueprint &#12469;&#12540;&#12499;&#12473;&#23459;&#35328;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#27424;&#33853;&#12375;&#12390;&#12356;&#12427; Blueprint &#12469;&#12540;&#12499;&#12473;&#23459;&#35328;&#12434; CBA &#12398;&#20869;&#23481;&#12395;&#36861;&#21152;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12363;&#12425;&#12398; CompositeBundle-ExportService &#12504;&#12483;&#12480;&#12540;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: &#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398;&#12496;&#12531;&#12489;&#12523; {1} &#12395;&#12354;&#12427;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean {0} &#12395; 1 &#12388;&#12398;&#21336;&#32020;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#21517;&#12364;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12381;&#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#29305;&#23450;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12418;&#35079;&#25968;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12395;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427; EJB &#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474; Bean &#29992;&#12398;&#28961;&#21177;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#27083;&#25104;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    1 &#12388;&#12398;&#21336;&#32020;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#21517;&#12414;&#12383;&#12399;&#29305;&#23450;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#27083;&#25104;&#24773;&#22577;&#12398;&#20001;&#26041;&#12391;&#12399;&#12394;&#12367;&#12289;&#12356;&#12378;&#12428;&#12363;&#19968;&#26041;&#12364;&#23384;&#22312;&#12377;&#12427;&#12424;&#12358;&#12395;&#12289;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12398;&#21517;&#21069;&#22793;&#26356;&#12395;&#24517;&#35201;&#12394;&#12289;{0} &#12398;&#12522;&#12540;&#12501;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12434;&#25313;&#24373;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;{0} &#12398;&#27083;&#25104;&#12391;&#25313;&#24373;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12475;&#12483;&#12488;&#12398;&#26356;&#26032;&#12434;&#35430;&#12415;&#12414;&#12375;&#12383;&#12290; &#12371;&#12428;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12475;&#12483;&#12488;&#12398;&#26356;&#26032;&#12399;&#12289;OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12475;&#12483;&#12488;&#12398;&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12363;&#12425;&#12300;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12362;&#12369;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#26356;&#26032;&#12301;&#12497;&#12493;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12475;&#12483;&#12488;&#12434;&#26032;&#12375;&#12356;&#12496;&#12452;&#12490;&#12522;&#12540;&#12391;&#26356;&#26032;&#12377;&#12427;&#12371;&#12392;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26082;&#23384;&#12398;&#12450;&#12475;&#12483;&#12488;&#20869;&#12391;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#26356;&#26032;&#12384;&#12369;&#12391;&#12394;&#12367;&#20182;&#12398;&#25805;&#20316;&#12418;&#24517;&#35201;&#12394;&#22580;&#21512;&#12289;&#12450;&#12475;&#12483;&#12488;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12363;&#12425;&#20195;&#26367;&#12398;&#12450;&#12475;&#12483;&#12488;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12354;&#12427;&#12356;&#12399;&#12289;&#26032;&#35215;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12375;&#12289;CBA &#12434;&#25313;&#24373;&#12392;&#12375;&#12390;&#27083;&#25104;&#21336;&#20301;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#26032;&#35215;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#26082;&#23384;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: &#12479;&#12540;&#12466;&#12483;&#12488; {3} &#12391;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {2} &#12398;&#12496;&#12531;&#12489;&#12523; {1} &#12395;&#12354;&#12427; Bean {0} &#12395;&#23550;&#12375;&#12390; MDB &#12450;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12506;&#12483;&#12463;&#12398; JNDI &#21517;&#12364;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    MDB &#12522;&#12473;&#12490;&#12540;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12539;&#12450;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12506;&#12483;&#12463;&#12398; JNDI &#21517;&#12364;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    MDB &#12395;&#23550;&#12375;&#12390;&#12450;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12506;&#12483;&#12463;&#12398; JNDI &#21442;&#29031;&#12434;&#27083;&#25104;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523; {2} &#12398;&#25313;&#24373;&#12398;&#19968;&#29872;&#12392;&#12375;&#12390;&#12289;&#12501;&#12449;&#12452;&#12523; {0} &#12398;&#21517;&#21069;&#12434; {1} &#12395;&#22793;&#26356;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; EBA &#12501;&#12449;&#12452;&#12523;&#12398;&#25313;&#24373;&#12434;&#23436;&#20102;&#12377;&#12427;&#12395;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#21517;&#21069;&#12398;&#22793;&#26356;&#12399;&#27491;&#24120;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#22793;&#26356;&#12377;&#12427;&#27177;&#38480;&#12364;&#12354;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12364;&#28961;&#21177;&#12391;&#12377;&#12290; CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12383;&#27425;&#12398;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12414;&#12379;&#12435;: {1}
  </MsgText>
  <Explanation>
    CBA &#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#27424;&#33853;&#12375;&#12390;&#12356;&#12427;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12539;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434; CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12395;&#36861;&#21152;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#19981;&#35201;&#12394;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12398;&#35443;&#32048;&#12434;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: &#12450;&#12475;&#12483;&#12488; {0} &#12364;&#35201;&#27714;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12364;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12394;&#12356;&#12383;&#12417;&#12289;&#12371;&#12398;&#12450;&#12475;&#12483;&#12488;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12434;&#38283;&#22987;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#24460;&#12395;&#12510;&#12473;&#12479;&#12540;&#27083;&#25104;&#12408;&#12398;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </MsgText>
  <Explanation>
    1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12450;&#12475;&#12483;&#12488;&#12434;&#36861;&#21152;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290; &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#38283;&#22987;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12289;&#23436;&#20102;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12475;&#12483;&#12488;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#24460;&#12289;&#12414;&#12384;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#12377;&#12368;&#12395;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#24453;&#12387;&#12390;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12499;&#12472;&#12493;&#12473;&#12539;&#12524;&#12505;&#12523;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; (BLA) &#12408;&#12398;&#36861;&#21152;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12450;&#12475;&#12483;&#12488;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29366;&#27841;&#12399;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#12450;&#12475;&#12483;&#12488;&#35443;&#32048;&#12497;&#12493;&#12523;&#12363;&#12425;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#20869;&#23481;&#12364;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#20197;&#19979;&#12398;&#36861;&#21152;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;{0}
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12496;&#12531;&#12489;&#12523;&#12364;&#19968;&#37096;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12395;&#12289;&#20363;&#22806;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#12377;&#12409;&#12390;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#32232;&#38598;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434; EBA &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;EBA &#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#26178;&#12395;&#12289;&#26032;&#12375;&#12356;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12473;&#12488;&#12524;&#12540;&#12472;&#12539;&#12473;&#12506;&#12540;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#35069;&#21697;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: &#12450;&#12475;&#12483;&#12488; {0} &#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12450;&#12475;&#12483;&#12488;&#12364;&#24517;&#35201;&#12392;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523; {1} &#12364;&#23436;&#20840;&#12395;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12450;&#12475;&#12483;&#12488;&#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290; &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#38283;&#22987;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12289;&#23436;&#20102;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12475;&#12483;&#12488;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#24460;&#12395;&#12414;&#12384;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#12377;&#12368;&#12395;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12496;&#12531;&#12489;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#24453;&#12387;&#12390;&#12363;&#12425;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;DeploymentManifestManager &#12469;&#12540;&#12499;&#12473;&#12399;&#12289;OSGi service registry &#12363;&#12425;&#12399;&#20351;&#29992;&#19981;&#21487;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: EBA &#12501;&#12449;&#12452;&#12523;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#28961;&#21177;&#12391;&#12377;&#12290; &#20363;&#22806;: {0}
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#12289;&#24517;&#38920;&#12496;&#12531;&#12489;&#12523;&#12398;&#20855;&#20307;&#30340;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12522;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290; &#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364; EBA &#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12522;&#12478;&#12523;&#12496;&#12540;&#12539;&#12518;&#12540;&#12470;&#12540;&#12364;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#20869;&#12395;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290; &#21029;&#12398;&#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12471;&#12473;&#12486;&#12512;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12381;&#12428;&#12425;&#12399;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20363;&#12360;&#12400;&#12289;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#12496;&#12531;&#12489;&#12523;&#27083;&#25104;&#12364;&#12356;&#12367;&#12388;&#12363;&#12398;&#30064;&#12394;&#12427;&#29872;&#22659;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#20363;&#22806;&#12391;&#25552;&#20379;&#12373;&#12428;&#12383;&#24773;&#22577;&#12434;&#20351;&#29992;&#12375;&#12390;&#24517;&#38920;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#35672;&#21029;&#12375;&#12289;&#12471;&#12473;&#12486;&#12512;&#12391;&#12381;&#12428;&#12425;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#36861;&#21152;&#12524;&#12505;&#12523;&#12398;&#21046;&#24481;&#12364;&#24517;&#35201;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#38500;&#21435;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#32232;&#38598;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531; {0} &#12395;&#23550;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#20516;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399; {1} &#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    APPLICATION.MF &#12398; Application-ManifestVersion &#12504;&#12483;&#12480;&#12540;&#12395;&#23550;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#20516;&#12399;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    APPLICATION.MF &#12398; Application-ManifestVersion &#12398;&#20516;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: EBA &#20869;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12424;&#12387;&#12390;&#25351;&#23450;&#12373;&#12428;&#12383;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#30330;&#29983;&#12375;&#12383;&#20363;&#22806;&#12399; {0} &#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#21547;&#12416; EBA &#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290; &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#35201;&#20214;&#12434;&#28288;&#12383;&#12379;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#30906;&#35469;&#12375;&#12289;&#12371;&#12398; EBA &#12398;&#12487;&#12503;&#12525;&#12452;&#20808;&#12391;&#12354;&#12427;&#12471;&#12473;&#12486;&#12512;&#12395;&#20114;&#25563;&#24615;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#26908;&#35388;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#24517;&#38920;&#12392;&#12373;&#12428;&#12427;&#20869;&#37096;&#12362;&#12424;&#12403;&#22806;&#37096;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12364;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#32232;&#38598;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434; EBA &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;EBA &#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#26178;&#12395;&#12289;&#26032;&#12375;&#12356;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#20869;&#12398; Application-Content &#12434;&#25351;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#38917;&#30446;&#12399;&#31354;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; application.mf &#12395;&#12289;&#31354;&#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#38917;&#30446;&#12399; 1 &#12388;&#20197;&#19978;&#12398;&#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12473;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    application.mf &#12501;&#12449;&#12452;&#12523;&#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: &#12479;&#12540;&#12466;&#12483;&#12488; {1} &#12391;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; {4} &#12398;&#12496;&#12531;&#12489;&#12523; {3} &#12395;&#12354;&#12427; Bean {2} &#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12395;&#23550;&#12375;&#12289;JNDI &#21517; {0} &#12395;&#19968;&#33268;&#12377;&#12427; MDB &#23451;&#20808;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; MDB &#12522;&#12473;&#12490;&#12540;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#23451;&#20808;&#12398;&#21442;&#29031; JNDI &#21517;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12381;&#12398;&#21442;&#29031;&#12364; JNDI &#21517;&#21069;&#31354;&#38291;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21517;&#21069;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12363;&#12289;&#21442;&#29031;&#12434;&#35330;&#27491;&#12375;&#12390; EBA &#12434;&#26356;&#26032;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: EBA &#12501;&#12449;&#12452;&#12523; {0} &#12399; Application-Content &#12434;&#25351;&#23450;&#12379;&#12378;&#12289;&#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523;&#12434;&#21547;&#12415;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#26368;&#20302;&#12391;&#12418; 1 &#12388;&#12398;&#26377;&#21177;&#12394; OSGi &#12496;&#12531;&#12489;&#12523;&#12414;&#12383;&#12399; Web &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (WAR) &#12501;&#12449;&#12452;&#12523;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#12363;&#12289;&#12381;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#26368;&#20302;&#12391;&#12418; 1 &#12388;&#12398; OSGi &#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12473;&#12488;&#12375;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    EBA &#12501;&#12449;&#12452;&#12523;&#12434;&#22793;&#26356;&#12375;&#12390;&#12289;1 &#12388;&#20197;&#19978;&#12398;&#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523;&#12414;&#12383;&#12399; WAR &#12434;&#21547;&#12417;&#12427;&#12363; (&#20516;&#12395;&#12424;&#12387;&#12390;&#32068;&#12415;&#36796;&#12416;)&#12289;&#12381;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523; application.mf &#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395; 1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#12522;&#12473;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356; (&#21442;&#29031;&#12395;&#12424;&#12387;&#12390;&#32068;&#12415;&#36796;&#12416;)&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;: {0}
  </MsgText>
  <Explanation>
    &#12450;&#12475;&#12483;&#12488;&#12398;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#20013;&#12395;&#12289;&#24517;&#38920;&#12497;&#12473;&#21517;&#12398;&#20316;&#25104;&#12391;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#12289;&#12371;&#12398;&#12497;&#12473;&#21517;&#12434;&#20316;&#25104;&#12377;&#12427;&#27177;&#38480;&#12364;&#12354;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
