<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAO0006E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_REMOVE_CONFIG_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_REMOVE_CONFIG_REPOSITORY_EXCEPTION=CWSAO0006E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; URL {0} &#12391;&#12398;&#27083;&#25104;&#12373;&#12428;&#12383;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434; RepositoryAdmin &#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0001E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAO0001E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12469;&#12540;&#12499;&#12473; {1} &#12434;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) {0} &#12434;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0014E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_LOCATE_RESOURCE" varFormat="Java">
    RESOLVER_UNABLE_TO_LOCATE_RESOURCE=CWSAO0014E: &#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12398;&#20013;&#12391;&#12289;&#12471;&#12531;&#12508;&#12523;&#21517;&#12364; {0} &#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364; {1} &#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12521;&#12531;&#12479;&#12452;&#12512;&#29872;&#22659;&#12399;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399; use-bundle &#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#35672;&#21029;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12398;&#20013;&#12391;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#21407;&#22240;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12364;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#23558;&#26469;&#35299;&#27770;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#27424;&#33853;&#12375;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#27083;&#25104;&#28168;&#12415;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAO0013W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_WARNING" varFormat="Java">
    RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_WARNING=CWSAO0013W: URL {0} &#12398;&#27083;&#25104;&#28168;&#12415;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434;&#12522;&#12478;&#12523;&#12496;&#12540;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434;&#12522;&#12478;&#12523;&#12496;&#12540;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#21407;&#22240;&#12399;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; URL &#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; URL &#12364;&#26377;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12392;&#12289;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12364;&#27491;&#12375;&#12356;&#24418;&#24335;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAO0002E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_IOEXCEPTION" varFormat="Java">
    RESOLVER_IOEXCEPTION=CWSAO0002E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12525;&#12540;&#12459;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12539;&#12501;&#12449;&#12452;&#12523; {1} &#12434;&#20316;&#25104;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289;EBA &#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12434;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0004E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_EXCEPTION=CWSAO0004E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; URL {0} &#12391;&#12398;&#27083;&#25104;&#12373;&#12428;&#12383;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434; RepositoryAdmin &#12469;&#12540;&#12499;&#12473;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0003E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_ADD_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_ADD_REPOSITORY_EXCEPTION=CWSAO0003E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; EBA &#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12398;&#12503;&#12525;&#12499;&#12472;&#12519;&#12491;&#12531;&#12464;&#26178;&#12395;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; {1} &#12434; RepositoryAdmin &#12469;&#12540;&#12499;&#12473;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0007E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_RESOLVE" varFormat="Java">
    RESOLVER_UNABLE_TO_RESOLVE=CWSAO0007E: &#20381;&#23384;&#38306;&#20418;&#12481;&#12455;&#12540;&#12531;&#12391;&#27425;&#12398;&#21839;&#38988;&#12364;&#26908;&#20986;&#12373;&#12428;&#12383;&#12383;&#12417;&#12289;&#12471;&#12473;&#12486;&#12512;&#12399; EBA {0} &#12434;&#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;{1}
  </MsgText>
  <Explanation>
    &#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12398;&#20381;&#23384;&#38306;&#20418;&#12377;&#12409;&#12390;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12503;&#12525;&#12499;&#12472;&#12519;&#12531;&#12391;&#12365;&#12394;&#12356;&#20381;&#23384;&#38306;&#20418;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#20184;&#38543;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#21839;&#38988;&#12434;&#35330;&#27491;&#12375;&#12390; EBA &#12434;&#20877;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12363;&#12425;&#12289;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAO0005E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_REMOVE_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_REMOVE_REPOSITORY_EXCEPTION=CWSAO0005E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; EBA &#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12398;&#12503;&#12525;&#12499;&#12472;&#12519;&#12491;&#12531;&#12464;&#26178;&#12395;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; {1} &#12434; RepositoryAdmin &#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0008E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_HANDLE_FRAGMENT_HOST_WITH_EXTENSION" varFormat="Java">
    RESOLVER_UNABLE_HANDLE_FRAGMENT_HOST_WITH_EXTENSION=CWSAO0008E: &#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12507;&#12473;&#12488; {0} &#12395;&#25313;&#24373;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12364;&#21547;&#12414;&#12428;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12507;&#12473;&#12488;&#12434;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25313;&#24373;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12539;&#12475;&#12483;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12434;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#25313;&#24373;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12399; Fragment-Host &#12364;&#12471;&#12473;&#12486;&#12512;&#12539;&#12496;&#12531;&#12489;&#12523;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#25313;&#24373;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502; &#12434;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
