<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: symbolicName &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395; symbolicName &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    symbolicName &#12434;&#25351;&#23450;&#12375;&#12390;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#30330;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: &#12525;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12391;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#12497;&#12473;&#12364;&#27491;&#12375;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: &#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12496;&#12531;&#12489;&#12523; {0} &#12434;&#38500;&#21435;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#20182;&#12398;&#12377;&#12409;&#12390;&#12398;&#12496;&#12531;&#12489;&#12523; {1} &#12399;&#27491;&#24120;&#12395;&#38500;&#21435;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#21066;&#38500;&#12391;&#12365;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#21066;&#38500;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12496;&#12531;&#12489;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12398;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20572;&#27490;&#12375;&#12289;&#12381;&#12428;&#12425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#38500;&#21435;&#12434;&#20877;&#24230;&#35430;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: &#12496;&#12531;&#12489;&#12523; {0} &#12399;&#26082;&#12395;&#20572;&#27490;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12399;&#26082;&#12395;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#20572;&#27490;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: &#20197;&#19979;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12496;&#12531;&#12489;&#12523;&#12408;&#12398;&#20381;&#23384;&#38306;&#20418;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#12496;&#12531;&#12489;&#12523; {0} &#12434;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;: {1}&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12364;&#12496;&#12531;&#12489;&#12523;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12496;&#12531;&#12489;&#12523;&#12399;&#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12381;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#21069;&#12395;&#12289;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: JPA2 &#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12394;&#12393;&#12398;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12395;&#24517;&#35201;&#12394;&#12501;&#12451;&#12540;&#12481;&#12515;&#12540;&#12539;&#12465;&#12452;&#12497;&#12499;&#12522;&#12486;&#12451;&#12540;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: &#12469;&#12540;&#12499;&#12473; ID {0} &#12398;&#12469;&#12540;&#12499;&#12473;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12469;&#12540;&#12499;&#12473; ID &#12364;&#12289;&#12524;&#12472;&#12473;&#12488;&#12522;&#12540;&#12398;&#12469;&#12540;&#12499;&#12473;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26377;&#21177;&#12394; &#12469;&#12540;&#12499;&#12473; ID &#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: &#12496;&#12531;&#12489;&#12523; {1} &#12496;&#12540;&#12472;&#12519;&#12531; {2} (&#12501;&#12449;&#12452;&#12523; {0} &#12391;&#23450;&#32681;) &#12399;&#12289;&#26082;&#12395;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12399;&#26082;&#12395;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#27491;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364; &#27491;&#12375;&#12367;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#20869;&#12363;&#12425;&#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#21066;&#38500;&#12375;&#12390;&#12289;&#27491;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12434;&#36861;&#21152;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: cuName &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395; cuName &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    cuName &#12434;&#25351;&#23450;&#12375;&#12390;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#30330;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12398;&#20869;&#23481;&#12395;&#12354;&#12427;&#12469;&#12540;&#12499;&#12473;&#21442;&#29031;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12399; CBA &#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;CBA &#12399;&#12371;&#12428;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#27425;&#12398;&#12469;&#12540;&#12499;&#12473;&#20381;&#23384;&#38306;&#20418;&#12364;&#26410;&#35299;&#27770;&#12391;&#12377;: {1}
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12469;&#12540;&#12499;&#12473;&#12414;&#12383;&#12399; CBA &#20869;&#12398;&#21029;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12383;&#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;CBA &#12399;&#12381;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12434;&#35330;&#27491;&#12375;&#12390;&#12289;CBA &#12364;&#12289;CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20351;&#29992;&#12377;&#12427;&#12469;&#12540;&#12499;&#12473;&#12362;&#12424;&#12403;&#20182;&#12398;&#22580;&#21512;&#12395;&#12399; CBA &#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12469;&#12540;&#12499;&#12473;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; EBA &#12450;&#12475;&#12483;&#12488; {0} &#12391;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; {0} &#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#38500;&#21435;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#12414;&#12383;&#12289;&#12496;&#12531;&#12489;&#12523; {1} &#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#20363;&#22806;&#12399; {2} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#38500;&#21435;&#12391;&#12365;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523;&#12364;&#12354;&#12426;&#12289;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#38500;&#21435;&#12391;&#12365;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290; &#29694;&#22312;&#12289;&#12471;&#12473;&#12486;&#12512;&#12364;&#30683;&#30462;&#12375;&#12383;&#29366;&#24907;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#29694;&#34892;&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#12391;&#12398;&#22793;&#26356;&#12434;&#24259;&#26820;&#12375;&#12289;1 &#22238;&#12395; 1 &#12388;&#12378;&#12388;&#12496;&#12531;&#12489;&#12523;&#12398;&#38500;&#21435;&#12434;&#35430;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: &#12496;&#12531;&#12489;&#12523; {0} &#12399;&#27491;&#24120;&#12395;&#38283;&#22987;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#36890;&#30693;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#24773;&#22577;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#29694;&#22312;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    connect &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#20351;&#29992;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#12522;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;list() &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; Launcher &#12469;&#12540;&#12499;&#12473;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: &#12496;&#12531;&#12489;&#12523; ID {0} &#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523; ID &#12364;&#12289;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#12496;&#12531;&#12489;&#12523;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523; ID &#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523; {0} &#12395;&#12399;&#12289;&#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399; OSGi &#12496;&#12531;&#12489;&#12523;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#30906;&#35469;&#12375;&#12289;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; OSGi &#12469;&#12540;&#12499;&#12473;&#12539;&#12524;&#12472;&#12473;&#12488;&#12522;&#12540;&#12363;&#12425;&#12521;&#12531;&#12479;&#12452;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: &#25552;&#20379;&#12373;&#12428;&#12383;&#12450;&#12475;&#12483;&#12488; {0} &#12399; EBA &#12450;&#12475;&#12483;&#12488;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12450;&#12475;&#12483;&#12488;&#12399;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12450;&#12475;&#12483;&#12488;&#12364; EBA &#12450;&#12475;&#12483;&#12488;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; {0} &#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#38500;&#21435;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#20363;&#22806;&#12399; {1} &#12391;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12363;&#12425;&#12496;&#12531;&#12489;&#12523;&#12434;&#38500;&#21435;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290; &#29694;&#22312;&#12289;&#12471;&#12473;&#12486;&#12512;&#12364;&#30683;&#30462;&#12375;&#12383;&#29366;&#24907;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#29694;&#34892;&#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;&#12391;&#12398;&#22793;&#26356;&#12434;&#24259;&#26820;&#12375;&#12289;1 &#22238;&#12395; 1 &#12388;&#12378;&#12388;&#12496;&#12531;&#12489;&#12523;&#12398;&#38500;&#21435;&#12434;&#35430;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: &#12496;&#12531;&#12489;&#12523; {0} &#12399;&#26082;&#12395;&#38283;&#22987;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12399;&#26082;&#12395;&#38283;&#22987;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: &#12469;&#12540;&#12499;&#12473;&#12539;&#12501;&#12451;&#12523;&#12479;&#12540;&#12364;&#28961;&#21177;&#12391;&#12377;: {0}&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12469;&#12540;&#12499;&#12473;&#12539;&#12501;&#12451;&#12523;&#12479;&#12540;&#12364;&#28961;&#21177;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12469;&#12540;&#12499;&#12473;&#12539;&#12501;&#12451;&#12523;&#12479;&#12540;&#12364;&#26377;&#21177;&#12394;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#29983;&#25104;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;OSGi service registry &#12363;&#12425;&#12399;&#20351;&#29992;&#19981;&#21487;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12469;&#12540;&#12499;&#12473;&#24773;&#22577;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#29694;&#22312;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    connect &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#20351;&#29992;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#12522;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;list() &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {1} &#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523; {0} &#12395;&#12289;&#26377;&#21177;&#12394;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399; OSGi &#12496;&#12531;&#12489;&#12523;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#30906;&#35469;&#12375;&#12289;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12364;&#28961;&#21177;&#12391;&#12377;&#12290; CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12395;&#12424;&#12387;&#12390;&#12452;&#12531;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364; CBA &#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398; Import-Package &#12504;&#12483;&#12480;&#12540;&#12363;&#12425;&#27424;&#33853;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#27425;&#12398;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12414;&#12375;&#12383;: {1}
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12289;&#12496;&#12531;&#12489;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12414;&#12383;&#12399; CBA &#20869;&#12398;&#21029;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;CBA &#12399;&#12381;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12434;&#35330;&#27491;&#12375;&#12390;&#12289;CBA &#12364;&#12289;CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20351;&#29992;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12362;&#12424;&#12403;&#20182;&#12398;&#22580;&#21512;&#12395;&#12399; CBA &#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: &#25509;&#32154;&#12399;&#20351;&#29992;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290; &#20351;&#29992;&#21487;&#33021;&#12394;&#25509;&#32154;&#12434;&#30906;&#35469;&#12375;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#20877;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </MsgText>
  <Explanation>
    &#25509;&#32154;&#12375;&#12390;&#12356;&#12383;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12364;&#20351;&#29992;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#20572;&#27490;&#12375;&#12383;&#12371;&#12392;&#12364;&#21407;&#22240;&#12398;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12364;&#12414;&#12384;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12375;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#20877;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: &#12473;&#12488;&#12522;&#12531;&#12464; {0} &#12364; symbolicname;version &#12398;&#27491;&#12375;&#12356;&#27083;&#25991;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#21066;&#38500;&#12377;&#12427;&#12383;&#12417;&#12395;&#12496;&#12531;&#12489;&#12523;&#12398;&#12522;&#12473;&#12488;&#12391;&#25552;&#20379;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#12364;&#20104;&#24819;&#12373;&#12428;&#12427;&#27083;&#25991;&#12392;&#19968;&#33268;&#12375;&#12394;&#12363;&#12387;&#12383;&#12383;&#12417;&#12289;&#12381;&#12428;&#12434;&#20966;&#29702;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12473;&#12488;&#12522;&#12531;&#12464;&#12398;&#27083;&#25991;&#12434;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12504;&#12483;&#12480;&#12540;&#24773;&#22577;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#29694;&#22312;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    connect &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#20351;&#29992;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#12522;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;list() &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: &#12497;&#12483;&#12465;&#12540;&#12472;&#21517; {0} &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12364;&#12289;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12364;&#26377;&#21177;&#12394;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: &#25351;&#23450;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523; {0} &#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#21517;&#21069;&#12398;&#12496;&#12531;&#12489;&#12523;&#12399;&#23384;&#22312;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12418;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12414;&#12383;&#12399;&#12471;&#12531;&#12508;&#12523;&#21517;&#12434;&#30906;&#35469;&#12375;&#12390;&#12289;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12496;&#12531;&#12489;&#12523;&#24773;&#22577;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#29694;&#22312;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    connect &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#20351;&#29992;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#12522;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;list() &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540; {0} &#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: &#20363;&#22806; {1} &#12364;&#21407;&#22240;&#12391;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523; {0} &#12434;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#35299;&#26512;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#28961;&#21177;&#12394;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12364;&#26377;&#21177;&#12394;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: &#12525;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12539;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12289;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12539;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12539;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12477;&#12540;&#12523;
 
 &#34920;&#31034;&#12467;&#12510;&#12531;&#12489;: &#12371;&#12428;&#12425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
 
     ss()                - &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12415;&#12496;&#12531;&#12489;&#12523;&#12398;&#35201;&#32004;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     bundles()           - &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12415;&#12496;&#12531;&#12489;&#12523;&#12398;&#32207;&#21512;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     packages()          - &#12452;&#12531;&#12509;&#12540;&#12488;&#28168;&#12415;/&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#28168;&#12415;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     services()          - &#30331;&#37682;&#28168;&#12415;&#12469;&#12540;&#12499;&#12473;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
 
     bundle(&lt;bundleID&gt;)  - &#25351;&#23450;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     headers(&lt;bundleID&gt;) - &#25351;&#23450;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12504;&#12483;&#12480;&#12540;&#12398;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     packages(&lt;bundle ID&gt;) - &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#28168;&#12415;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     packages(&lt;package Name&gt;) - &#25351;&#23450;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     services(&lt;service ID&gt;) - &#25351;&#23450;&#12373;&#12428;&#12383;&#12469;&#12540;&#12499;&#12473;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     services(&lt;OSGI Filter&gt;) - &#12501;&#12451;&#12523;&#12479;&#12540;&#12395;&#19968;&#33268;&#12377;&#12427;&#12469;&#12540;&#12499;&#12473;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
 
     refresh() - &#20869;&#37096; OSGi &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12477;&#12540;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#12289;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#29366;&#24907;&#12395;&#38306;&#12377;&#12427;&#26368;&#26032;&#12398;&#24773;&#22577;&#12391;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;
 
 Framework commands:
 
     list() - &#25509;&#32154;&#12391;&#12365;&#12427;&#20351;&#29992;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#12522;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;
     connect(&lt;Framework id&gt;) - &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;
     connect(&lt;Bundle Name&gt;, &lt;Bundle Version&gt;, &lt;Node Name&gt;, &lt;Server Name&gt;) - &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;
 
 Controlling Bundles:
 
     start(&lt;bundleID&gt;) - &#35201;&#27714;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;
     stop(&lt;bundleID&gt;   - &#35201;&#27714;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12434;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12394;&#12375;&#12290;
  </Explanation>
  <UserResponse>
    &#12394;&#12375;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523; {0} &#12399; JAR &#12414;&#12383;&#12399;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#25313;&#24373;&#23376; .jar &#12362;&#12424;&#12403; .cba &#12391;&#32066;&#20102;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25552;&#20379;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#30906;&#35469;&#12375;&#12289;&#35330;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#26377;&#21177;&#12394; JAR &#12414;&#12383;&#12399;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: &#12497;&#12483;&#12465;&#12540;&#12472; ID {0} &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472; ID &#12364;&#12289;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12392;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12497;&#12483;&#12465;&#12540;&#12472; ID &#12364;&#26377;&#21177;&#12394;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12398; CompositeBundle-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12399;&#12289;&#27491;&#30906;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398;&#12415;&#12364;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#27425;&#12398;&#20837;&#21147;&#12399;&#28961;&#21177;&#12391;&#12377;: {1}&#12290;
  </MsgText>
  <Explanation>
    CompositeBundle-Content &#38917;&#30446;&#12398;&#24418;&#24335;&#12399;&#12289;&apos;bundle.name;version=&quot;[1.0.0,1.0.0]&quot;&apos; &#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398; CompositeBundle-Content &#12504;&#12483;&#12480;&#12540;&#12398;&#38917;&#30446;&#12395;&#12399;&#12289;&#24517;&#12378;&#27491;&#30906;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12289;&#27491;&#12375;&#12356;&#24418;&#24335;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: &#20197;&#19979;&#12398;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12539;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#30064;&#12394;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12414;&#12379;&#12435;: {1}&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) &#12399;&#12289;&#26684;&#32013;&#12375;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12364;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;&#12290; &#23646;&#24615;&#12392;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12418;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12434;&#20462;&#27491;&#12375;&#12390;&#12289;CBA &#12364;&#26684;&#32013;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#27231;&#33021;&#12399;&#12371;&#12398;&#27083;&#25104;&#21336;&#20301;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;&#27083;&#25104;&#21336;&#20301;&#12364;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#12289;&#20197;&#19979;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;{0}
  </MsgText>
  <Explanation>
    &#27083;&#25104;&#21336;&#20301;&#12398;&#12487;&#12503;&#12525;&#12452;&#20808;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12364;&#12377;&#12409;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#27231;&#33021;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25313;&#24373;&#12398;&#36861;&#21152;&#20808;&#12392;&#12394;&#12427;&#27083;&#25104;&#21336;&#20301;&#12364;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#27231;&#33021;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: &#12496;&#12531;&#12489;&#12523; {0} &#12434;&#20572;&#27490;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#29694;&#22312;&#12399; {1} &#12398;&#29366;&#24907;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12434;&#20572;&#27490;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#20572;&#27490;&#12391;&#12365;&#12394;&#12356;&#29702;&#30001;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;&#20184;&#38543;&#12377;&#12427;&#12456;&#12521;&#12540;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: {0} &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#12467;&#12510;&#12531;&#12489; {1} &#12395;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12395;&#12399;&#25351;&#23450;&#12373;&#12428;&#12383;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12289;&#24517;&#38920;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: &#26377;&#21177;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#36890;&#30693;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12391;&#24517;&#35201;&#12394;&#20197;&#19979;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12289;&#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12391;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;: {1}&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#20381;&#23384;&#38306;&#20418;&#12434;&#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12391;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12522;&#12473;&#12488;&#12373;&#12428;&#12383;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#20381;&#23384;&#38306;&#20418;&#12364;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12354;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#20869;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12415;&#12391;&#12354;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: &#27083;&#25104;&#21336;&#20301; {0} &#12395;&#25313;&#24373;&#12434;&#36861;&#21152;&#20013;&#12395;&#12289;&#35299;&#27770;&#12398;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#29694;&#34892;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12392;&#36899;&#20418;&#12375;&#12390;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#25313;&#24373;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12496;&#12531;&#12489;&#12523;&#12399;&#20381;&#23384;&#38306;&#20418;&#12364;&#27424;&#33853;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;&#20114;&#25563;&#24615;&#12364;&#12394;&#12356;&#12363;&#12289;&#23384;&#22312;&#12375;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12456;&#12521;&#12540;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12450;&#12475;&#12483;&#12488;&#12362;&#12424;&#12403;&#25313;&#24373;&#12395;&#24517;&#35201;&#12394;&#22793;&#26356;&#12434;&#21152;&#12360;&#12390;&#12289;&#25313;&#24373;&#12434;&#20877;&#24230;&#36969;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: {0} &#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12399;&#12289;{1} &#12392;&#12356;&#12358;&#21517;&#21069;&#12391;&#26082;&#12395;&#23450;&#32681;&#28168;&#12415;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#26032;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434;&#23450;&#32681;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#25351;&#23450;&#12375;&#12383; URL &#12399;&#26082;&#12395;&#21029;&#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21029;&#12398; URL &#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#12501;&#12449;&#12452;&#12523;&#20197;&#22806;&#12398; URL {0} &#12363;&#12425; AriesApplicationModel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: EBA &#12450;&#12475;&#12483;&#12488; {0} &#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#12450;&#12475;&#12483;&#12488;&#12395;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    EBA &#12450;&#12475;&#12483;&#12488;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12415;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: &#12496;&#12531;&#12489;&#12523; {0} &#12434;&#20572;&#27490;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#36890;&#30693;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: &#27083;&#25104;&#21336;&#20301; {0} &#12363;&#12425;&#25313;&#24373;&#12434;&#38500;&#21435;&#20013;&#12395;&#12289;&#35299;&#27770;&#12398;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#20363;&#22806;: {1}
  </MsgText>
  <Explanation>
    &#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#29694;&#34892;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12392;&#36899;&#20418;&#12375;&#12390;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#25313;&#24373;&#12434;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12496;&#12531;&#12489;&#12523;&#12399;&#20381;&#23384;&#38306;&#20418;&#12364;&#27424;&#33853;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;&#20114;&#25563;&#24615;&#12364;&#12394;&#12356;&#12363;&#12289;&#23384;&#22312;&#12375;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12456;&#12521;&#12540;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12450;&#12475;&#12483;&#12488;&#12395;&#24517;&#35201;&#12394;&#22793;&#26356;&#12434;&#21152;&#12360;&#12289;&#25313;&#24373;&#12362;&#12424;&#12403;&#20182;&#12398;&#30456;&#20114;&#20381;&#23384;&#12398;&#25313;&#24373;&#12434;&#12475;&#12483;&#12488;&#12392;&#12375;&#12390;&#38500;&#21435;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12450;&#12475;&#12483;&#12488; {0} &#12395;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12399;&#12289;&#12450;&#12475;&#12483;&#12488;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; APPLICATION.MF &#12392;&#20114;&#25563;&#24615;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#20197;&#19979;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
   1. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Application-SymbolicName &#12392; Application-Version &#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398;&#23550;&#24540;&#12377;&#12427;&#38917;&#30446;&#12395;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   2. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398; Application-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12392;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   3. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398;&#23550;&#24540;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31684;&#22258;&#20869;&#12395;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   4. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398; Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12418;&#12522;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   5. DEPLOYMENT.MF &#12501;&#12449;&#12452;&#12523;&#12398; Deployed-Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#12496;&#12531;&#12489;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;APPLICATION.MF &#12501;&#12449;&#12452;&#12523;&#12398; Use-Bundle &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#23550;&#24540;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31684;&#22258;&#20869;&#12395;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12395;&#12289;&#21029;&#12398; &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {1} &#19978;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#20381;&#23384;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; &#12398;&#12493;&#12473;&#12488;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12364;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398; CompositeBundle-Content &#12504;&#12483;&#12480;&#12540;&#12395;&#12354;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12415;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#21517; {0}&#12289;&#12494;&#12540;&#12489;&#21517; {1}&#12289;&#12362;&#12424;&#12403;&#12469;&#12540;&#12496;&#12540;&#21517; {2} &#12391;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#23646;&#24615;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#23646;&#24615;&#12364;&#26377;&#21177;&#12394;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: &#21517;&#21069;&#12364; {0} &#12398;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12364;&#26082;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#26032;&#12375;&#12356;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12434;&#23450;&#32681;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#25351;&#23450;&#12375;&#12383;&#21517;&#21069;&#12399;&#26082;&#12395;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21029;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: Aries &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; {0} &#12398;&#24517;&#38920;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#19968;&#37096;&#12364;&#12414;&#12384;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#20013;&#12398;&#12383;&#12417;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12514;&#12487;&#12523;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12392;&#12377;&#12427; 1 &#12388;&#20197;&#19978;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#20013;&#12391;&#12377;&#12290; &#12377;&#12409;&#12390;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12514;&#12487;&#12523;&#21270;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#24517;&#38920;&#12496;&#12531;&#12489;&#12523;&#12364;&#12377;&#12409;&#12390;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12414;&#12391;&#24453;&#27231;&#12375;&#12390;&#12363;&#12425;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: &#25313;&#24373;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;&#27083;&#25104;&#21336;&#20301;&#12364;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#12289;&#20197;&#19979;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;{0}
  </MsgText>
  <Explanation>
    &#27083;&#25104;&#21336;&#20301;&#12398;&#12487;&#12503;&#12525;&#12452;&#20808;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12364;&#12377;&#12409;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#27231;&#33021;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#25313;&#24373;&#12398;&#36861;&#21152;&#20808;&#12392;&#12394;&#12427;&#27083;&#25104;&#21336;&#20301;&#12364;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#25313;&#24373;&#27231;&#33021;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#27083;&#36896; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12473;&#12488;&#12524;&#12540;&#12472;&#12539;&#12473;&#12506;&#12540;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#35069;&#21697;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: &#12471;&#12531;&#12508;&#12523;&#21517; {0} &#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12399;&#12289;&#26082;&#23384;&#12398;&#25313;&#24373;&#12398;&#12393;&#12428;&#12392;&#12418;&#19968;&#33268;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12471;&#12531;&#12508;&#12523;&#21517;&#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#19968;&#33268;&#12377;&#12427;&#25313;&#24373;&#12399;&#12289;&#27083;&#25104;&#21336;&#20301;&#12395;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: &#12496;&#12531;&#12489;&#12523; {0} &#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#29694;&#22312;&#12399; {1} &#12398;&#29366;&#24907;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12496;&#12531;&#12489;&#12523;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12371;&#12398;&#12496;&#12531;&#12489;&#12523;&#12434;&#38283;&#22987;&#12391;&#12365;&#12394;&#12356;&#29702;&#30001;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#12399;&#12289;&#20184;&#38543;&#12377;&#12427;&#12456;&#12521;&#12540;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12399;&#35299;&#27770;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#28288;&#12383;&#12373;&#12428;&#12394;&#12356;&#35201;&#20214;&#12399; {0} &#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12395;&#12399;&#12289;&#28288;&#12383;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#35201;&#20214;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#23436;&#20102;&#12375;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12496;&#12531;&#12489;&#12523;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {0} &#12398;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#20966;&#29702;&#20013;&#12395;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12363;&#12289;&#21517;&#21069;&#12414;&#12383;&#12399;&#24418;&#24335;&#12364;&#19981;&#27491;&#30906;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12364;&#23384;&#22312;&#12375;&#12289;&#27491;&#12375;&#12367;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#35373;&#23450;&#12362;&#12424;&#12403;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: ID {0} &#12391;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383; ID &#12391;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  </Explanation>
  <UserResponse>
    &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463; ID &#12364;&#26377;&#21177;&#12394;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#35430;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (CBA) {0} &#12364;&#12289;CBA &#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12496;&#12531;&#12489;&#12523;&#12364;&#25552;&#20379;&#12375;&#12394;&#12356;&#12469;&#12540;&#12499;&#12473;&#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;CBA &#12398;&#22806;&#37096;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#27425;&#12398;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12414;&#12375;&#12383;: {1}
  </MsgText>
  <Explanation>
    CBA &#12399;&#12289;Blueprint &#23459;&#35328;&#12414;&#12383;&#12399; Bundle-ExportService (CBA &#20869;&#12398;&#12496;&#12531;&#12489;&#12523;&#12398; 1 &#12388;&#12398;&#12504;&#12483;&#12480;&#12540;) &#12398;&#12394;&#12356;&#12469;&#12540;&#12499;&#12473;&#12399;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#27424;&#33853;&#12375;&#12390;&#12356;&#12427; Blueprint &#12469;&#12540;&#12499;&#12473;&#23459;&#35328;&#12434; CBA &#12398;&#20869;&#23481;&#12395;&#36861;&#21152;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#19981;&#35201;&#12394;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12398;&#35443;&#32048;&#12434;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; COMPOSITEBUNDLE.MF &#12363;&#12425;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: &#21517;&#21069;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#21517;&#21069;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395;&#12399;&#21517;&#21069;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12390;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#30330;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: URL &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;URL &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    URL &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399; addExternalBundleRepository &#12467;&#12510;&#12531;&#12489;&#12391;&#24517;&#38920;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#30330;&#34892;&#12375;&#12390;&#12289;&#22806;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12398; URL &#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#27083;&#36896; {0} &#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12434;&#23384;&#22312;&#12375;&#12394;&#12356;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12395; &#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#27083;&#36896;&#12399;&#20316;&#25104;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#12473;&#12488;&#12524;&#12540;&#12472;&#12539;&#12473;&#12506;&#12540;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12289;&#12362;&#12424;&#12403;&#35069;&#21697;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: &#12471;&#12531;&#12508;&#12523;&#21517; {0} &#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12392;&#19968;&#33268;&#12377;&#12427;&#20351;&#29992;&#21487;&#33021;&#12394;&#25313;&#24373;&#12399;&#12289;&#20351;&#29992;&#21487;&#33021;&#12394;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    &#25351;&#23450;&#12373;&#12428;&#12383;&#12471;&#12531;&#12508;&#12523;&#21517;&#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12399;&#12289;&#29872;&#22659;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#20351;&#29992;&#21487;&#33021;&#12394;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12395;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12434;&#36861;&#21152;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289;&#25313;&#24373;&#12392;&#12375;&#12390;&#36861;&#21152;&#12377;&#12427;&#21029;&#12398;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: &#12496;&#12531;&#12489;&#12523; {0} &#12434;&#38283;&#22987;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#36890;&#30693;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; &#35299;&#27770;&#12503;&#12525;&#12475;&#12473;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12496;&#12531;&#12489;&#12523;&#12398;&#12522;&#12473;&#12488;&#12434;&#29983;&#25104;&#12375;&#12414;&#12379;&#12435;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: &#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463; {0} &#12408;&#12398;&#25509;&#32154;&#12364;&#25104;&#21151;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#36890;&#30693;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; {1} &#12363;&#12425;&#12496;&#12531;&#12489;&#12523; {0} &#12434;&#25277;&#20986;&#20013;&#12395;&#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: &#21517;&#21069;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#21517;&#21069;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#21517;&#21069;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399; addExternalBundleRepository &#12467;&#12510;&#12531;&#12489;&#12391;&#24517;&#38920;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#30330;&#34892;&#12375;&#12390;&#12289;&#22806;&#37096;&#12496;&#12531;&#12489;&#12523;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12540;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: &#12471;&#12531;&#12508;&#12523;&#21517; {0} &#12362;&#12424;&#12403;&#12496;&#12540;&#12472;&#12519;&#12531; {1} &#12398;&#25313;&#24373;&#12399;&#26082;&#12395;&#27083;&#25104;&#21336;&#20301;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12398;&#25313;&#24373;&#12399;&#26082;&#12395;&#27083;&#25104;&#21336;&#20301;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#20869;&#23481;&#12364;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#27425;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#20887;&#38263;&#12391;&#12377;&#12290;{0}&#12290;
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12391;&#12399;&#12394;&#12356;&#12496;&#12531;&#12489;&#12523;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: &#12494;&#12540;&#12489; {1} &#12362;&#12424;&#12403;&#12469;&#12540;&#12496;&#12540; {2} &#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463; {0} &#12408;&#25509;&#32154;&#20013;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#29694;&#22312;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#25509;&#32154;&#20013;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; null &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12363;&#12425; AriesApplicationModel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: version &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  </MsgText>
  <Explanation>
    &#12467;&#12510;&#12531;&#12489;&#12395; version &#12497;&#12521;&#12513;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    version &#12434;&#25351;&#23450;&#12375;&#12390;&#12467;&#12510;&#12531;&#12489;&#12434;&#20877;&#30330;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: &#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12398;&#20869;&#23481;&#12364;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#20197;&#19979;&#12398;&#36861;&#21152;&#12398;&#12496;&#12531;&#12489;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;{0}
  </MsgText>
  <Explanation>
    &#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488; DEPLOYMENT.MF &#12395;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12496;&#12531;&#12489;&#12523;&#12539;&#12450;&#12540;&#12459;&#12452;&#12502; (EBA) &#12450;&#12475;&#12483;&#12488;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12496;&#12531;&#12489;&#12523;&#12364;&#19968;&#37096;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  </Explanation>
  <UserResponse>
    &#26032;&#35215;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12395;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12383;&#12496;&#12531;&#12489;&#12523;&#12364;&#12377;&#12409;&#12390;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: &#12496;&#12531;&#12489;&#12523; {0} &#12399;&#27491;&#24120;&#12395;&#20572;&#27490;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#36890;&#30693;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  </Explanation>
  <UserResponse>
    &#20966;&#32622;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: &#20869;&#37096;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290; null &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12510;&#12491;&#12501;&#12455;&#12473;&#12488;&#12363;&#12425; AriesApplicationModel &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12375;&#12383;&#12290;
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
