<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: Il parametro symbolicName non &#232; stato specificato ed &#232; obbligatorio.
  </MsgText>
  <Explanation>
    Il comando richiede la specifica del parametro symbolicName.
  </Explanation>
  <UserResponse>
    Immettere nuovamente il comando specificando symbolicName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: Impossibile trovare il file manifest di distribuzione dall&apos;&apos;ubicazione {0}.
  </MsgText>
  <Explanation>
    Il file manifest di distribuzione, DEPLOYMENT.MF, da importare non esiste.
  </Explanation>
  <UserResponse>
    Verificare che il percorso del file manifest di distribuzione sia corretto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: Non &#232; stato possibile rimuovere i bundle {0} dal repository di bundle interno. Tutti gli altri bundle {1} sono stati rimossi correttamente.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile eliminare alcuni bundle dal repository di bundle interno.
  </Explanation>
  <UserResponse>
    Arrestare le applicazioni che potrebbero utilizzare i bundle che non &#232; stato possibile eliminare, quindi tentare di rimuoverli di nuovo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: Il bundle {0} &#232; gi&#224; arrestato.
  </MsgText>
  <Explanation>
    Non &#232; possibile arrestare il bundle perch&#233; &#232; stato gi&#224; arrestato.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: Impossibile eliminare il bundle {0} poich&#233; i seguenti CBA (Composite Bundle Archive) dipendono dal bundle: {1}.
  </MsgText>
  <Explanation>
    Non &#232; possibile eliminare un bundle dal repository di bundle interno se un archivio bundle composito dipende da tale bundle.
  </Explanation>
  <UserResponse>
    Per eliminare il bundle, eliminare prima gli archivi bundle compositi elencati, poi eliminare il bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: Impossibile ottenere le capacit&#224; richieste per funzioni come JPA2.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: Impossibile trovare il servizio con l&apos;&apos;ID {0}.
  </MsgText>
  <Explanation>
    L&apos;ID servizio fornito nel comando non corrisponde ad alcun servizio presente nel registro.
  </Explanation>
  <UserResponse>
    Ripetere il comando utilizzando un ID servizio valido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: Il bundle {1} con versione {2}, definito nel file {0}, gi&#224; esiste nel repository.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile aggiungere il bundle al repository poich&#233; il bundle esiste gi&#224; nel repository.
  </Explanation>
  <UserResponse>
    Verificare se il bundle nel repository &#232; quello corretto. In caso contrario, rimuovere il bundle dal repository prima di aggiungere quello corretto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: Il parametro cuName non &#232; stato specificato ed &#232; obbligatorio.
  </MsgText>
  <Explanation>
    Il comando richiede la specifica del parametro cuName.
  </Explanation>
  <UserResponse>
    Immettere nuovamente il comando specificando cuName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: Impossibile risolvere i riferimenti ai servizi nel contenuto del CBA (Composite Bundle Archive) {0}. Se tali servizi sono forniti da bundle non inclusi nel CBA, il CBA deve importarli. Le seguenti dipendenze del servizio non sono state risolte: {1}
  </MsgText>
  <Explanation>
    Se un bundle in un CBA (Composite Bundle Archive) utilizza un servizio non contenuto nel bundle, o esportato da un altro bundle nel CBA, il CBA deve importare il servizio.
  </Explanation>
  <UserResponse>
    Correggere il file manifest del composito, COMPOSITEBUNDLE.MF, in modo che il CBA importi i servizi utilizzati dai bundle nel CBA e non quelli comunque disponibili nel CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: Si &#232; verificato un errore interno. Impossibile trovare il file manifest di distribuzione dall&apos;&apos;asset EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: Si &#232; verificato un errore interno. Non &#232; stato possibile rimuovere i metadati per i bundle {0} dal repository di bundle interno. Inoltre, non &#232; stato possibile eliminare i bundle {1} dal repository. L&apos;&apos;eccezione era {2}
  </MsgText>
  <Explanation>
    Non &#232; stato possibile eliminare i bundle dal repository di bundle interno e per altri non &#232; stato possibile rimuovere i metadati. Il sistema adesso potrebbe trovarsi in uno stato incoerente.
  </Explanation>
  <UserResponse>
    Eliminare le modifiche nello spazio di lavoro corrente e tentare di rimuovere i bundle uno alla volta.
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: Il bundle {0} &#232; stato avviato correttamente.
  </MsgText>
  <Explanation>
    Questo messaggio &#232; solo a scopo informativo.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: Impossibile richiamare le informazioni sul package perch&#233; l&apos;utente non &#232; connesso a un framework.
  </MsgText>
  <Explanation>
    Non si &#232; attualmente connessi a un framework.
  </Explanation>
  <UserResponse>
    Utilizzare i comandi di connessione per effettuare la connessione a un framework. Per un elenco di framework disponibili, utilizzare il comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: Si &#232; verificato un errore interno. Impossibile trovare il servizio del programma di avvio.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: Impossibile trovare il bundle con l&apos;&apos;ID {0}.
  </MsgText>
  <Explanation>
    L&apos;ID bundle fornito nel comando non corrisponde ad alcun bundle presente nel framework.
  </Explanation>
  <UserResponse>
    Ripetere il comando utilizzando un ID bundle valido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: Il file specificato {0} non contiene un file manifest del bundle valido.
  </MsgText>
  <Explanation>
    Il file specificato non &#232; un bundle OSGi.
  </Explanation>
  <UserResponse>
    Controllare e correggere il file manifest del bundle del file fornito.
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: Si &#232; verificato un errore interno. Un servizio di runtime non &#232; disponibile dal registro del servizio OSGi: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: L&apos;&apos;asset {0} fornito non &#232; un asset EBA.
  </MsgText>
  <Explanation>
    L&apos;asset fornito non &#232; un asset EBA (enterprise bundle archive).
  </Explanation>
  <UserResponse>
    Assicurarsi che l&apos;asset fornito sia un EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: Si &#232; verificato un errore interno. Non &#232; stato possibile rimuovere i metadati per i bundle {0} dal repository di bundle interno. L&apos;&apos;eccezione era {1}
  </MsgText>
  <Explanation>
    Non &#232; stato possibile rimuovere i bundle  dal repository di bundle interno. Il sistema adesso potrebbe trovarsi in uno stato incoerente.
  </Explanation>
  <UserResponse>
    Eliminare le modifiche nello spazio di lavoro corrente e tentare di rimuovere i bundle uno alla volta.
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: Il bundle {0} &#232; gi&#224; avviato.
  </MsgText>
  <Explanation>
    Non &#232; possibile avviare il bundle perch&#233; risulta essere gi&#224; avviato.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: Filtro servizio non valido: {0}.
  </MsgText>
  <Explanation>
    Il filtro del servizio fornito non &#232; valido.
  </Explanation>
  <UserResponse>
    Verificare che il filtro del servizio sia valido e ripetere il comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: Si &#232; verificato un errore interno. Il servizio del generatore del repository non &#232; disponibile dal registro del servizio OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: Impossibile richiamare le informazioni sul servizio perch&#233; l&apos;utente non &#232; connesso a un framework.
  </MsgText>
  <Explanation>
    Non si &#232; attualmente connessi a un framework.
  </Explanation>
  <UserResponse>
    Utilizzare i comandi di connessione per effettuare la connessione a un framework. Per un elenco di framework disponibili, utilizzare il comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: Il bundle {0} contenuto nel CBA (composite bundle archive) {1} non contiene un file manifest del bundle valido.
  </MsgText>
  <Explanation>
    Il file specificato non &#232; un bundle OSGi.
  </Explanation>
  <UserResponse>
    Controllare e correggere il file manifest del bundle del file fornito.
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: Il CBA (Composite Bundle Archive) {0} non &#232; valido. I package importati dai bundle nel CBA risultano mancanti nell&apos;&apos;intestazione Import-Package del file Manifest CBA. Sono stati riportati i seguenti problemi: {1}
  </MsgText>
  <Explanation>
    Se un bundle in un CBA (Composite Bundle Archive) utilizza un package non contenuto nel bundle, o esportato da un altro bundle nel CBA, il CBA deve importare il package.
  </Explanation>
  <UserResponse>
    Correggere il file manifest del composito, COMPOSITEBUNDLE.MF, in modo che il CBA importi i package utilizzati dai bundle nel CBA e non quelli comunque disponibili nel CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: La connessione non &#232; pi&#249; disponibile. Controllare le connessioni disponibili ed effettuare la riconnessione se necessario.
  </MsgText>
  <Explanation>
    Il framework a cui si sta effettuando la connessione non &#232; pi&#249; disponibile. La causa potrebbe essere che un&apos;applicazione &#232; stata arrestata.
  </Explanation>
  <UserResponse>
    Verificare se il framework &#232; ancora disponibile ed effettuare la riconnessione se necessario.
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: La stringa {0} non corrisponde alla sintassi corretta di symbolicname;version.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile elaborare la stringa fornita nell&apos;elenco dei bundle per la rimozione poich&#233; non corrispondeva alla sintassi prevista.
  </Explanation>
  <UserResponse>
    Correggere la sintassi della stringa fornita.
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: Impossibile richiamare le informazioni sull&apos;intestazione perch&#233; l&apos;utente non &#232; connesso a un framework.
  </MsgText>
  <Explanation>
    Non si &#232; attualmente connessi a un framework.
  </Explanation>
  <UserResponse>
    Utilizzare i comandi di connessione per effettuare la connessione a un framework. Per un elenco di framework disponibili, utilizzare il comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: Impossibile trovare il package con il nome package {0}.
  </MsgText>
  <Explanation>
    Il nome del package fornito nel comando non corrisponde ad un package presente nel framework.
  </Explanation>
  <UserResponse>
    Verificare che il nome package sia valido e ripetere il comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: Il bundle specificato {0} con versione {1} non esiste nel repository del bundle locale.
  </MsgText>
  <Explanation>
    Il bundle non risulta visualizzabile o cancellabile poich&#233; non vi &#232; alcun bundle con tale nome.
  </Explanation>
  <UserResponse>
    Controllare e correggere la versione o il nome simbolico del bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: Impossibile richiamare le informazioni sul bundle perch&#233; l&apos;utente non &#232; connesso a un framework.
  </MsgText>
  <Explanation>
    Non si &#232; attualmente connessi a un framework.
  </Explanation>
  <UserResponse>
    Utilizzare i comandi di connessione per effettuare la connessione a un framework. Per un elenco di framework disponibili, utilizzare il comando list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: Il repository di bundle {0} non esiste.
  </MsgText>
  <Explanation>
    &#200; stato effettuato un tentativo di modificare un repository di bundle che non esiste.
  </Explanation>
  <UserResponse>
    Creare il repository di bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: Non &#232; possibile analizzare il file specificato {0} come un file manifest a causa dell&apos;&apos;eccezione {1}
  </MsgText>
  <Explanation>
    Il file specificato non sembra essere un file manifest valido.
  </Explanation>
  <UserResponse>
    Verificare che il file fornito sia un file manifest valido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: Impossibile trovare il package con ubicazione {0}.
  </MsgText>
  <Explanation>
    L&apos;ubicazione del package fornita nel comando non corrisponde ad alcuna ubicazione package nel framework.
  </Explanation>
  <UserResponse>
    Verificare che l&apos;ubicazione package sia valida e ripetere il comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      Console delle applicazioni OSGi
 
 Comandi di visualizzazione: questi comandi funzionano solo se connessi a un framework
 
     ss()                - questo comando fornisce informazioni di riepilogo sui bunble installati.
     bundles()           - questo comando fornisce informazioni complete sui bundle installati.
     packages()          - questo comando fornisce informazioni sui package importati/esportati.
     services()          - questo comando fornisce informazioni sui servizi registrati.
 
     bundle(&lt;ID bundle&gt;)  - questo comando fornisce informazioni sui bundle specificati
     headers(&lt;ID bundle&gt;) - questo comando fornisce informazioni sulle intestazioni associate al bundle specificato
     packages(&lt;ID bundle&gt;) - questo comando fornisce informazioni sui package esportati per questo bundle.
     packages(&lt;nome package&gt;) - questo comando fornisce informazioni sui package specificati.
     services(&lt;ID servizio&gt;) - questo comando fornisce informazioni sul servizio specificato.
     services(&lt;filtro OSGI&gt;) - questo comando fornisce informazioni sui servizi che corrispondono al filtro.
 
     refresh() - questo comando aggiorna la cache della console applicazioni OSGi interna con le informazioni pi&#249; recenti sullo stato del framework.
 
 Comandi del framework:
 
     list() - questo comando elenca i framework disponibili a cui &#232; possibile connettersi.
     connect(&lt;Framework id&gt;) - questo comando connette a un framework specificato.
     connect(&lt;nome bundle&gt;, &lt;versione bundle&gt;, &lt;nome nodo&gt;, &lt;nome server&gt;) - questo comando connette al framework specificato.
 
 Bundle di controllo:
 
     start(&lt;ID bundle&gt;) - questo comando avvia il bundle richiesto.
     stop(&lt;ID bundle&gt;   - questo comando arresta il bundle richiesto.
  </MsgText>
  <Explanation>
    Nessuna.
  </Explanation>
  <UserResponse>
    Nessuna.
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: Il file specificato {0} non &#232; un JAR o un CBA (Composite Bundle Archive).
  </MsgText>
  <Explanation>
    Il nome del file specificato non termina con l&apos;estensione file .jar o .cba.
  </Explanation>
  <UserResponse>
    Verificare e correggere il nome del file fornito. Il file fornito deve essere un file JAR o CBA valido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: Impossibile trovare il package con l&apos;&apos;ID {0}.
  </MsgText>
  <Explanation>
    L&apos;ID package fornito nel comando non corrisponde ad alcun package presente nel framework.
  </Explanation>
  <UserResponse>
    Verificare che l&apos;ID package sia valido e ripetere il comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: L&apos;&apos;intestazione CompositeBundle-Content nel CBA (Composite Bundle Archive) {0} deve contenere solo bundle con una versione esatta. Le voci che seguono non sono valide: {1}.
  </MsgText>
  <Explanation>
    Una voce CompositeBundle-Content deve utilizzare un formato simile a &apos;bundle.name;version=&quot;[1.0.0,1.0.0]&quot;&apos;.
  </Explanation>
  <UserResponse>
    Accertarsi che le voci nell&apos;intestazione CompositeBundle-Content nel file manifest del bundle composito specifichino una versione esatta e utilizzino il formato corretto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: Impossibile installare il CBA (Composite Bundle Archive), {0}, perch&#233; i seguenti package di esportazione differiscono da quelli contenuti dal CBA (Composite Bundle Archive): {1}
  </MsgText>
  <Explanation>
    Un archivio bundle composito (o CBA - Composite Bundle Archive) pu&#242; esportare solo package che possono essere esportati anche dai bundle in esso contenuti. Anche gli attributi e le direttive devono corrispondere.
  </Explanation>
  <UserResponse>
    Correggere il file manifest del composito, COMPOSITEBUNDLE.MF, in modo che esporti i package che anche i bundle nel CBA esportano.
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: La funzionalit&#224; dell&apos;&apos;estensione dell&apos;&apos;applicazione non &#232; disponibile per questa unit&#224; di composizione poich&#233; quest&apos;&apos;ultima viene distribuita nelle seguenti destinazioni che non supportano l&apos;&apos;estensione dell&apos;&apos;applicazione: {0}
  </MsgText>
  <Explanation>
    Le destinazioni alle quali viene distribuita l&apos;unit&#224; di composizione non supportano la funzionalit&#224; dell&apos;estensione dell&apos;applicazione.
  </Explanation>
  <UserResponse>
    Accertarsi che l&apos;unit&#224; di composizione in cui si desidera aggiungere le estensioni venga distribuita sulle destinazioni che supportano la funzionalit&#224; dell&apos;estensione dell&apos;applicazione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: Impossibile arrestare il bundle {0}. Risulta attualmente nello stato {1}.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile arrestare il bundle.
  </Explanation>
  <UserResponse>
    Fare riferimento ai messaggi di errore restituiti dall&apos;operazione, per ulteriori informazioni sulla causa del mancato arresto di questo bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: Il parametro {0} non &#232; stato specificato ed &#232; richiesto per il comando {1}.
  </MsgText>
  <Explanation>
    Questo comando richiede il parametro specificato.
  </Explanation>
  <UserResponse>
    Ripetere il comando e specificare il parametro richiesto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: I framework validi sono:
  </MsgText>
  <Explanation>
    Questo messaggio &#232; solo a scopo informativo.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: Impossibile trovare i seguenti bundle, richiesti dal CBA (Composite Bundle Archive) {0} nel repository di bundle interno: {1}.
  </MsgText>
  <Explanation>
    Un archivio bundle composito pu&#242; essere distribuito soltanto se &#232; possibile rilevare tutte le dipendenze nel repository di bundle interno.
  </Explanation>
  <UserResponse>
    Assicurarsi che le dipendenze CBA (Composite Bundle Archive) elencate si trovino nel CBA o siano installate nel repository di bundle interno.
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: Si &#232; verificato un problema di risoluzione nell&apos;&apos;aggiunta di un&apos;&apos;estensione all&apos;&apos;unit&#224; di composizione {0}. L&apos;&apos;eccezione &#232;: {1}
  </MsgText>
  <Explanation>
    Il sistema non pu&#242; risolvere l&apos;estensione selezionata insieme alla distribuzione corrente dell&apos;asset. Nei bundle &#232; possibile che manchino delle dipendenze oppure che questi non risultino compatibili o che non esistano.
  </Explanation>
  <UserResponse>
    Esaminare l&apos;errore. Effettuare eventuali modifiche necessarie nell&apos;asset e nell&apos;estensione, quindi applicare nuovamente l&apos;estensione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: Il repository di bundle in {0} &#232; gi&#224; stato definito con il nome {1}.
  </MsgText>
  <Explanation>
    &#200; stato effettuato un tentativo di definire un nuovo repository di bundle, ma un altro repository di bundle utilizza gi&#224; l&apos;URL specificato.
  </Explanation>
  <UserResponse>
    Specificare un URL diverso.
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: Si &#232; verificato un errore interno. Si &#232; tentato di generare un oggetto AriesApplicationModel da un URL di tipo non file {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: Impossibile trovare l&apos;&apos;asset EBA {0}.
  </MsgText>
  <Explanation>
    L&apos;utente ha importato un file manifest di distribuzione in un asset, ma l&apos;asset EBA (enterprise bundle archive) non esiste.
  </Explanation>
  <UserResponse>
    Verificare che l&apos;asset EBA sia installato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: Arresto del bundle {0} in corso.
  </MsgText>
  <Explanation>
    Questo messaggio &#232; solo a scopo informativo.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: Si &#232; verificato un problema di risoluzione durante la rimozione di un&apos;&apos;estensione dall&apos;&apos;unit&#224; di composizione {0}. L&apos;&apos;eccezione &#232;: {1}
  </MsgText>
  <Explanation>
    Il sistema non pu&#242; risolvere l&apos;estensione selezionata insieme alla distribuzione corrente dell&apos;asset. Nei bundle &#232; possibile che manchino delle dipendenze oppure che questi non risultino compatibili o che non esistano.
  </Explanation>
  <UserResponse>
    Esaminare l&apos;errore. Effettuare eventuali modifiche necessarie nell&apos;asset quindi rimuovere, come un insieme, l&apos;estensione e qualsiasi altra estensione interdipendente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: Il file manifest di distribuzione da importare non &#232; valido per l&apos;&apos;asset {0} poich&#233; non soddisfa i requisiti presenti nel file manifest dell&apos;&apos;applicazione.
  </MsgText>
  <Explanation>
    Il file manifest di distribuzione, DEPLOYMENT.MF, non &#232; compatibile con il file manifest dell&apos;applicazione, APPLICATION.MF, dell&apos;asset.
  </Explanation>
  <UserResponse>
    Verificare i seguenti requisiti nel nuovo file manifest di distribuzione:
   1. Le intestazioni Application-SymbolicName e Application-Version nel file DEPLOYMENT.MF devono essere uguali alle corrispondenti voci nel file APPLICATION.MF.
   2. I bundle elencati nell&apos;intestazione Deployed-Content nel file DEPLOYMENT.MF devono corrispondere ai bundle elencati nell&apos;intestazione Application-Content nel file APPLICATION.MF.
   3. La versione bundle nell&apos;intestazione Deployed-Content nel file DEPLOYMENT.MF deve essere compresa nell&apos;intervallo di versioni per il bundle corrispondente nel file APPLICATION.MF.
   4. I bundle elencati nell&apos;intestazione Deployed-Use-Bundle nel file DEPLOYMENT.MF devono essere elencati anche nell&apos;intestazione Use-Bundle nel file APPLICATION.MF.
   5. La versione bundle nell&apos;intestazione Deployed-Use-Bundle nel file DEPLOYMENT.MF deve essere compresa nell&apos;intervallo di versioni per il bundle corrispondente nell&apos;intestazione Use-Bundle nel file APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: CBA (Composite Bundle Archive), {0}, ha una dipendenza di distribuzione su un altro CBA (Composite Bundle Archive), {1}.
  </MsgText>
  <Explanation>
    La nidificazione degli archivi bundle compositi non &#232; supportata.
  </Explanation>
  <UserResponse>
    Verificare che l&apos;archivio bundle composito dipenda soltanto dai bundle nell&apos;intestazione CompositeBundle-Content del file manifest dell&apos;archivio bundle composito.
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: Impossibile connettersi a un framework con nome framework {0}, nome nodo {1} e nome server {2}.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile trovare un framework con gli attributi specificati.
  </Explanation>
  <UserResponse>
    Verificare che gli attributi framework siano validi e ripetere il comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: Un repository di bundle con il nome {0} esiste gi&#224;.
  </MsgText>
  <Explanation>
    &#200; stato effettuato un tentativo di definire un nuovo repository di bundle, ma il nome specificato risulta gi&#224; essere in uso.
  </Explanation>
  <UserResponse>
    Specificare un nome diverso.
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: Impossibile eseguire il modeling dell&apos;&apos;applicazione Aries {0} poich&#233; alcuni dei relativi componenti richiesti sono ancora in fase di scaricamento.
  </MsgText>
  <Explanation>
    Uno o pi&#249; bundle richiesti dall&apos;applicazione sono in fase di scaricamento. Impossibile eseguire il modeling dell&apos;applicazione fino al completamento di tutti gli scaricamenti.
  </Explanation>
  <UserResponse>
    Attendere il completamento dello scaricamento di tutti i bundle richiesti e poi riprovare.
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: Impossibile aggiungere delle estensioni poich&#233; l&apos;&apos;unit&#224; di composizione viene distribuita nelle seguenti destinazioni, che non supportano l&apos;&apos;estensione dell&apos;&apos;applicazione: {0}
  </MsgText>
  <Explanation>
    Le destinazioni alle quali viene distribuita l&apos;unit&#224; di composizione non supportano la funzionalit&#224; dell&apos;estensione dell&apos;applicazione.
  </Explanation>
  <UserResponse>
    Accertarsi che l&apos;unit&#224; di composizione in cui si desidera aggiungere le estensioni venga distribuita sulle destinazioni che supportano la funzionalit&#224; dell&apos;estensione dell&apos;applicazione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: Impossibile creare la struttura di directory {0}.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile creare la directory.
  </Explanation>
  <UserResponse>
    Controllare la disponibilit&#224; di spazio di storage e che il prodotto disponga delle autorizzazioni necessarie per la creazione della directory.
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: Il nome simbolico {0} e la versione {1} non corrispondono ad alcuna estensione esistente.
  </MsgText>
  <Explanation>
    Sull&apos;unit&#224; di composizione non &#232; presente alcuna estensione corrispondente al nome simbolico e versione specificati.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: Impossibile avviare il bundle {0}. Risulta attualmente nello stato {1}.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile avviare il bundle.
  </Explanation>
  <UserResponse>
    Fare riferimento ai messaggi di errore restituiti dall&apos;operazione, per ulteriori informazioni sulla causa del mancato avvio di questo bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: Impossibile risolvere il file manifest di distribuzione da importare. I requisiti non soddisfatti sono {0}.
  </MsgText>
  <Explanation>
    Per file manifest di distribuzione, DEPLOYMENT.MF, da importare esiste un requisito che non pu&#242; essere soddisfatto.
  </Explanation>
  <UserResponse>
    Verificare che il nuovo file manifest di distribuzione sia completo e includa i bundle necessari per risolvere l&apos;asset EBA (enterprise bundle archive).
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: Si &#232; verificato un problema nell&apos;&apos;elaborazione del file manifest per il CBA (Composite Bundle Archive), {0}.
  </MsgText>
  <Explanation>
    Il file manifest non &#232; presente oppure nome o formato non sono corretti.
  </Explanation>
  <UserResponse>
    Verificare che il file manifest sia presente e formattato e denominato in modo corretto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: Impossibile connettersi a un framework con ID {0}.
  </MsgText>
  <Explanation>
    Non &#232; stato possibile trovare un framework con l&apos;ID specificato.
  </Explanation>
  <UserResponse>
    Verificare che l&apos;ID framework sia valido e ripetere il comando.
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: Il CBA (Composite Bundle Archive) {0} esporta servizi non forniti dai bundle contenuti nel CBA. Tali servizi non saranno disponibili per essere utilizzati dai bundle al di fuori del CBA. Sono stati riportati i seguenti problemi: {1}
  </MsgText>
  <Explanation>
    Un CBA non pu&#242; esportare servizi per cui non &#232; presente una dichiarazione Blueprint o un&apos;intestazione Bundle-ExportService su uno dei bundle nel CBA.
  </Explanation>
  <UserResponse>
    Aggiungere le dichiarazioni di servizio Blueprint mancanti al contenuto del CBA oppure rimuovere i dettagli delle esportazioni non riuscite dal file manifest del composito, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: Il parametro name non &#232; stato specificato ed &#232; obbligatorio.
  </MsgText>
  <Explanation>
    Il comando richiede la specifica del parametro name.
  </Explanation>
  <UserResponse>
    Immettere nuovamente il comando specificando il nome.
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: Il parametro URL non &#232; stato specificato ed &#232; obbligatorio.
  </MsgText>
  <Explanation>
    Il parametro URL del comando addExternalBundleRepository &#232; un parametro obbligatorio.
  </Explanation>
  <UserResponse>
    Immettere nuovamente il comando e specificare l&apos;URL del repository di bundle esterno.
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: Impossibile creare la struttura di directory {0}.
  </MsgText>
  <Explanation>
    L&apos;utente ha tentato di esportare un file manifest di distribuzione in una directory che non esiste e la struttura di directory non pu&#242; essere creata.
  </Explanation>
  <UserResponse>
    Controllare la disponibilit&#224; di spazio di storage e che il prodotto disponga delle autorizzazioni necessarie per la creazione della directory.
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: Il nome simbolico {0} e la versione {1} non corrispondono ad alcuna estensione disponibile in tutti i repository di bundle disponibili.
  </MsgText>
  <Explanation>
    Non &#232; presente alcun bundle composito con il nome simbolico e versione specificati nei repository disponibili nell&apos;ambiente.
  </Explanation>
  <UserResponse>
    Aggiungere il bundle composito in un repository disponibile oppure selezionare un diverso bundle composito da aggiungere come un&apos;estensione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: Avvio del bundle {0} in corso.
  </MsgText>
  <Explanation>
    Questo messaggio &#232; solo a scopo informativo.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: Si &#232; verificato un errore interno. Il processo di risoluzione non genera un elenco di bundle da installare.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: Connessione al framework {0} riuscita.
  </MsgText>
  <Explanation>
    Questo messaggio &#232; solo a scopo informativo.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: Si &#232; verificato un errore interno durante l&apos;&apos;estrazione del bundle {0} dal CBA (Composite Bundle Archive) {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: Il parametro name non &#232; stato specificato ed &#232; obbligatorio.
  </MsgText>
  <Explanation>
    Il parametro name del comando addExternalBundleRepository &#232; un parametro obbligatorio.
  </Explanation>
  <UserResponse>
    Immettere nuovamente il comando e specificare il nome del repository di bundle esterno.
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: L&apos;&apos;estensione con nome simbolico {0} e versione {1} &#232; stata gi&#224; aggiunta all&apos;&apos;unit&#224; di composizione.
  </MsgText>
  <Explanation>
    Questa estensione &#232; gi&#224; inclusa nell&apos;unit&#224; di composizione.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: Il contenuto del file manifest di distribuzione non &#232; corretto. I seguenti bundle sono ridondanti: {0}.
  </MsgText>
  <Explanation>
    Il file manifest di distribuzione, DEPLOYMENT.MF, da importare include bundle non necessari per risolvere l&apos;asset EBA (enterprise bundle archive).
  </Explanation>
  <UserResponse>
    Verificare che il nuovo file manifest di distribuzione non includa i bundle elencati nel messaggio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: Connessione al framework {0} sul nodo {1} e server {2} in corso.
  </MsgText>
  <Explanation>
    Ci si sta attualmente connettendo al framework.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: Si &#232; verificato un errore interno. Si &#232; tentato di generare un oggetto AriesApplicationModel da un file manifest di distribuzione null.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: Il parametro della versione non &#232; stato specificato ed &#232; obbligatorio.
  </MsgText>
  <Explanation>
    Il comando richiede la specifica del parametro della versione.
  </Explanation>
  <UserResponse>
    Immettere nuovamente il comando specificando la versione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: Il contenuto del file manifest di distribuzione non &#232; corretto. Sono richiesti i seguenti ulteriori bundle {0}.
  </MsgText>
  <Explanation>
    Il file manifest di distribuzione, DEPLOYMENT.MF, da importare non include tutti i bundle necessari per risolvere l&apos;asset EBA (enterprise bundle archive).
  </Explanation>
  <UserResponse>
    Verificare che il nuovo file manifest di distribuzione includa tutti i bundle elencati nel messaggio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: Il bundle {0} &#232; stato arrestato correttamente.
  </MsgText>
  <Explanation>
    Questo messaggio &#232; solo a scopo informativo.
  </Explanation>
  <UserResponse>
    Non &#232; richiesta alcuna azione.
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: Si &#232; verificato un errore interno. Si &#232; tentato di generare un oggetto AriesApplicationModel da un file manifest dell&apos;applicazione null.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
