# Please don't translate following phases:
# <a ...>
# </a>
# IBM.com
# WebSphere Application Server
# WebSphere Application Server for i5/OS
# WebSphere Application Server Zone
# Modern Batch
#
#CMVCPATHNAME batch/ws/code/batch.bjs.webapp/src/JavaSource/com/ibm/ws/batch/jobmanagement/web/resources/ApplicationResources.properties
#ISMESSAGEFILE FALSE
# NLS_MESSAGEFORMAT_NONE
# NLS_ENCODING=UNICODE

productName=WebSphere Application Server
jobmanagement=Jobverwaltung
viewJobs=Jobs anzeigen
submitJob=Job \u00fcbergeben
jobrepository=Jobrepository
viewSavedJobs=Gespeicherte Jobs anzeigen
saveJob=Job speichern
saveJobTitle=Job speichern
jobschedules=Planverwaltung
viewJobSchedules=Pl\u00e4ne anzeigen
createSchedule=Plan erstellen
createScheduleTitle=Plan erstellen
homePage=Home
welcome=Willkommen
welcomeUser=Willkommen {0}
welcomeDesc=Die Jobverwaltungskonsole ist eine eigenst\u00e4ndige Webschnittstelle, \u00fcber die die Benutzer von WebSphere Application Server Joboperationen ausf\u00fchren k\u00f6nnen, die ihren Rollenberechtigungen entsprechen. Diese Konsole sorgt f\u00fcr einen kontrollierten Zugriff, wenn die Sicherheit aktiviert ist. Nur berechtigte Benutzer, denen die Rolle lrsubmitter und/oder die Rolle lradmin \u00fcber die Administrationskonsole erteilt wurde, k\u00f6nnen auf die Jobverwaltungskonsole zugreifen.
xdLib=Auf der Webseite {0} finden Sie Dokumentationen, White Paper, Lernprogramme, Demos und vieles mehr.
wasOnIBM=WebSphere Application Server auf IBM.com
wasOnIBMDesc=Auf der Website <a target="_blank" href="http://www.ibm.com/software/webservers/appserv/">IBM.com</a> finden Sie Produktinformationen zur Softwarefamilie WebSphere. Informationen zu i5/OS finden Sie auf der Produkt-Website von <a target="_blank" href="http://www.ibm.com/servers/eserver/iseries/software/websphere/wsappserver/">WebSphere Application Server f\u00fcr i5/OS</a>.
developmentWorks=Laden Sie aktuelle Artikel mit technischen Hinweisen, empfohlene Techniken, Lernprogramme usw. von der Website <a href="http://www.ibm.com/developerworks/websphere/zones/xd/" target="_blank">WebSphere Application Server Zone</a> herunter.
document=Dokumentationen, einschlie\u00dflich Artikeln und PDF-Dateien, finden Sie im <a href="http://www14.software.ibm.com/webapp/wsbroker/redirect?version={0}&product=was-nd-dist&topic=" target="_blank">online verf\u00fcgbaren Information Center</a>.
welcome.copyright=Licensed Material - Property of IBM \n {0} (C) Copyright IBM Corp. {1} \n\nAll Rights Reserved.\n\nU.S. Government users - RESTRICTED RIGHTS - Use, Duplication, or\nDisclosure restricted by GSA-ADP schedule contract with IBM Corp.\nIBM ist eine eingetragene Marke der IBM Corp.
about.build.num=Build-Nummer:
about.build.date=Build-Datum:

jmc=Jobmanagementkonsole von WebSphere Application Server
jobCollectionViewTitle=Jobs
jobCollectionViewDesc=Die Liste aller an den Job-Scheduler \u00fcbergebenen Jobs anzeigen. Wenn Sie eine Joboperation ausf\u00fchren m\u00f6chten, m\u00fcssen Sie einen Job ausw\u00e4hlen, eine Aktion im Men\u00fc <b>Aktion ausw\u00e4hlen</b> ausw\u00e4hlen und anschlie\u00dfend auf <b>Anwenden</b> klicken. \u00dcber die Filtersteuerung k\u00f6nnen Sie die Jobliste verk\u00fcrzen.
jobDetailViewDesc=Wenn Sie eine Aktion f\u00fcr diesen Job ausf\u00fchren m\u00f6chten, w\u00e4hlen Sie in der entsprechenden Liste die Aktion aus. Klicken Sie anschlie\u00dfend auf <b>Ausf\u00fchren</b>.
jobScheduleCollectionViewTitle=Pl\u00e4ne
jobScheduleCollectionViewDesc=Pl\u00e4ne stellen geplante, sich wiederholende Job\u00fcbertragungen dar, die vom Job-Scheduler automatisiert werden. Klicken Sie auf den Namen eines Plans, um die Plandetails anzuzeigen.
jobScheduleDetailViewTitle=Planen
jobScheduleDetailViewDesc=Hier k\u00f6nnen Sie den ausgew\u00e4hlten Plan und seine Jobs anzeigen oder aktualisieren.
jobLogViewTitle=Jobprotokoll
jobLogViewDesc=Wenn Sie das Protokoll des Jobs {0} in einem lokalen Dateisystem speichern m\u00f6chten, klicken Sie auf <b>Herunterladen</b>.
submitJobDesc=Geben Sie die Informationen f\u00fcr die \u00dcbergabe eines Stapeljobs an.
createScheduleDesc=Geben Sie die Informationen zum Erstellen eines Plans an.
submitJobStep1=Schritt&nbsp;1:&nbsp;Job&nbsp;angeben
submitJobStep2=Schritt&nbsp;2:&nbsp;Jobeigenschaften&nbsp;angeben
submitJobStep1Desc=<b>Job \u00fcbergeben</b><br>Geben Sie die als Job zu \u00fcbergebende Jobdefinition an. Die Jobdefinition kann aus dem lokalen Dateisystem stammen. Wenn ein Job Substitutionseigenschaften ohne Werte hat, werden Sie aufgefordert, die Werte anzugeben.
submitJobStep2Desc=<b>Substitutionseigenschaften</b>
savedJobCollectionViewTitle=Gespeicherte Jobs
savedJobCollectionViewDesc=Die Liste der gespeicherten Stapeljobdefinitionen anzeigen. Gespeicherte Jobs k\u00f6nnen an den Job-Scheduler \u00fcbergeben werden, damit sie nach einem Plan f\u00fcr wiederholte \u00dcbergabe ausgef\u00fchrt bzw. einem solchen zugeordnet werden k\u00f6nnen.
savedJobViewTitle=Gespeicherter Job
savedJobViewDesc=Diese Anzeige enth\u00e4lt die Definition des Stapeljobs {0}.
currentStep=Aktueller Abschnitt
saveJobDesc=<b>Job speichern</b><br>Geben Sie den Jobnamen und die Datei mit der Jobdefinition an, und klicken Sie anschlie\u00dfend auf <b>Speichern</b>, um den Job im Job-Repository zu speichern.
indexWelcome=Geben Sie Ihre Informationen ein.
userId=Benutzer-ID:
password=Kennwort:
logIn=Anmelden
expand=Einblenden
collapse=Ausblenden
showPref=Einstellungen einblenden
hidePref=Einstellungen ausblenden
showMessage=Nachrichten einblenden
hideMessage=Nachrichten ausblenden
preferences=Einstellungen
maxRows=Maximale Anzahl der Zeilen
sortBy=Sortieren
sortDirection=Sortierrichtung
ascending=Aufsteigend
descending=Absteigend
group=Gruppe
button.ok=OK
button.go=Starten
filterInstruction=Wenn Sie die Sicht mit der Jobliste filtern m\u00f6chten, geben Sie Ihre Filterkriterien ein, und klicken Sie anschlie\u00dfend auf <b>Los</b>.
savedJobFilterInstruction=Wenn Sie die Liste der Jobs im Repository filtern m\u00f6chten, geben Sie Ihre Filterkriterien ein, und klicken Sie anschlie\u00dfend auf <b>Los</b>.
jobScheduleFilterInstruction=Wenn Sie die Liste der Pl\u00e4ne filtern m\u00f6chten, geben Sie Ihre Filterkriterien ein, und klicken Sie anschlie\u00dfend auf <b>Los</b>.
actionInstruction=Aktion auf ausgew\u00e4hlte Jobs anwenden
button.execute=Anwenden
button.download=Herunterladen
button.refresh=Aktualisieren
button.submit=\u00dcbergeben
button.reset=Zur\u00fccksetzen
button.browse=Durchsuchen...
button.new=Neu
button.save=Speichern
button.schedule=Planen
button.delete=L\u00f6schen
suspendedTimeLabel=Ausgesetzte Zeit (Sekunden)
suspendTimeSeconds=Sekunden
suspendTimeMinutes=Minuten
suspendTimeHours=Stunden
back=Zur\u00fcck
select=Ausw\u00e4hlen
jumpToPage=Gehe zur Seite:
total=Insgesamt:
filtered=Gefiltert:
selectAllItems=Alle Eintr\u00e4ge ausw\u00e4hlen
deselectAllItems=Alle Eintr\u00e4ge abw\u00e4hlen
showFilterFunction=Filterfunktion anzeigen
clearFilterValues=Filterwerte l\u00f6schen
firstPage=Erste
nextPage=Weiter
previousPage=Zur\u00fcck
lastPage=Letze
pageOf=Seite: {0} von {1}
jumpTo=Gehe zu
setPreference=Festlegen
generalProperties=Allgemeine Eigenschaften
error=Fehler
warning=Warnung
information=Information
messages=Nachrichten
submitJobFrom=Quelle f\u00fcr Job\u00fcbergabe
localFileSystem=Lokales Dateisystem
specifyPath=xJCL-Pfad angeben
saveToJobRepository=Im Jobrepository speichern
jobName=Name
jobRepository=Jobrepository
specifyJobName=Jobnamen angeben
specifyCommandArgs=Befehlsargumente angeben
jobDescription=Beschreibung
job.name=Jobname
xjclPath=xJCL-Pfad
audit.string=Pr\u00fcfzeichenfolge
informationRequired=Informationen erforderlich
job.description=Jobbeschreibung
propName=Eigenschaft
propValue=Wert
startDate=Startdatum (jjjj-MM-dd)
startTime=Startzeit (HH:mm:ss)
whenToSubmit=\u00dcbergabezeitpunkt
submitNow=Sofort
submitLater=Sp\u00e4ter
replaceJob=Job ersetzen, wenn der angegebene Jobname bereits vorhanden ist
interval=Intervall
scheduleName=Name
daily=T\u00e4glich
weekly=W\u00f6chentlich
monthly=Monatlich
refreshView=Die Ansicht aktualisieren.
viewInfo=Weitere Informationen zu dieser Seite anzeigen
minimize=Minimieren
restore=Wiederherstellung
logInNote=Beachten Sie, dass das System Sie automatisch abmeldet, wenn Sie eine Weile keine Aktionen ausf\u00fchren, und Sie dann zur erneuten Anmeldung auffordert.
logout=Abmelden
invalidSessionTitle=Ung\u00fcltige Sitzung
invalidSessionMsg=Ihre Sitzung ist nicht mehr g\u00fcltig. Das Sitzungszeitlimit ist abgelaufen.
createScheduleStep1=Schritt&nbsp;1:&nbsp;Plan&nbsp;erstellen
createScheduleStep2=Schritt&nbsp;2:&nbsp;Job&nbsp;angeben
createScheduleStep21=Schritt&nbsp;2.1:&nbsp;Substitutionseigenschaften angeben
createScheduleStep3=Schritt&nbsp;3:&nbsp;Erstellung&nbsp;des Plans best\u00e4tigen
createScheduleStep1Title=Plan erstellen
createScheduleStep2Title=Job angeben
createScheduleStep21Title=Substitutionseigenschaften angeben
createScheduleStep3Title=Erstellung des Plans best\u00e4tigen
createScheduleStep1Desc=Geben Sie den Namen des zu erstellenden Plans an. Geben Sie Startdatum und Startzeit f\u00fcr die erstmalige Ausf\u00fchrung des Jobs an.
createScheduleStep2Desc=Geben Sie die in den Plan zu kopierende Jobdefinition an. Die Jobdefinition kann aus dem lokalen Dateisystem stammen.
createScheduleStep21Desc=Geben Sie Werte f\u00fcr die Substitutionseigenschaften dieses Jobs an.
createScheduleStep3Desc=Im Folgenden finden Sie eine \u00dcbersicht \u00fcber die von Ihnen ausgew\u00e4hlten Optionen. Klicken Sie auf <b>Fertig stellen</b>, um die \u00dcbergabe dieses Plans abzuschlie\u00dfen.
description=Beschreibung
button.finish=Fertig stellen
button.back=< Zur\u00fcck
button.next=Weiter >
summaryScheduleName=Name des Plans:
summaryScheduleDesc=Beschreibung des Plans:

summarySchedule=Plan:
summaryJobToSchedule=Zu planender Job:
summarySubstitutionProperties=Substitutionseigenschaften:
summary=Zusammenfassung
selectSavedJobDesc=W\u00e4hlen Sie in der Liste einen Job aus, und klicken Sie auf <b>Ausw\u00e4hlen</b>.
button.select=Ausw\u00e4hlen
updateProps=Substitutionseigenschaften aktualisieren
delaySubmit=\u00dcbergabe verz\u00f6gern
updateJob=Jobdefinition ersetzen
button.apply=Anwenden
loginFailed=Die Anmeldung ist fehlgeschlagen. \u00dcberpr\u00fcfen Sie Benutzer-ID und Kennwort, und wiederholen Sie anschlie\u00dfend die Operation.
aboutYourXDCG=<span class="purplebold">Informationen zu</span> <span class="graytext"> Ihrem WebSphere Application Server</span>
retainFilterCriteria=Filterkriterien beibehalten
scheduleJob=Job
jobToRun=Auszuf\u00fchrender Job
help=Hilfe
documentation=Dokumentation
UNAUTHENTICATED=Nicht authentifiziert
incYear=Jahreszahl erh\u00f6hen
decYear=Jahreszahl verringern
incHour=Stundenzahl erh\u00f6hen
decHour=Stundenzahl verringern
incMin=Minutenzahl erh\u00f6hen
decMin=Minutenzahl verringern
incSec=Sekundenzahl erh\u00f6hen
decSec=Sekundenzahl verringern
year=Jahr
month=Monat
day=Tag
hour=Stunde
minute=Minute(n)
second=Sekunde(n)
zOSOnly=(nur z/OS)
maxRowsDescription=Die Zeilenanzahl, die maximal angezeigt werden soll, wenn die Auflistung sehr umfangreich ist. Die nicht angezeigten Zeilen werden auf der n\u00e4chsten Seite angezeigt.

# job state
job.state.all=Alle
job.state.submitted=\u00dcbergeben
job.state.submitfailed=Fehler bei der \u00dcbergabe
job.state.reserved=Reserviert
job.state.reservefailed=Fehler bei der Reservierung
job.state.executing=Ausf\u00fchrung
job.state.executionfailed=Fehler bei der Ausf\u00fchrung
job.state.cancelpending=Abbruch anstehend
job.state.rescheduled=Erneut terminiert
job.state.restartable=Erneuter Start m\u00f6glich
job.state.ended=Beendet
job.state.cancelled=Abgebrochen
job.state.failedbutrestartable=Ausf\u00fchrung fehlgeschlagen - Erneuter Start m\u00f6glich
job.state.failednotrestartable=Ausf\u00fchrung fehlgeschlagen - Kein erneuter Start m\u00f6glich
job.state.unknown=Unbekannt
job.state.suspendpending=Aussetzen anstehend
job.state.resumepending=Wiederaufnahme anstehend
job.state.suspended=Ausgesetzt
job.state.pendingsubmit=\u00dcbergabe anstehend
job.state.stoppending=Stopp anstehend
job.state.stepstarted=Abschnitt gestartet
job.state.stepended=Abschnitt beendet
job.state.stepfailed=Abschnitt fehlgeschlagen
        
# job actions
job.action.cancel=Abbrechen
job.action.restart=Neustart
job.action.remove=Entfernen
job.action.suspend=Aussetzen
job.action.resume=Fortsetzen
job.action.select=---Aktion ausw\u00e4hlen---
job.action.stop=Stoppen
job.action.forcedcancel=Erzwungener Abbruch

# job detail
jobId=Job-ID
jobSubmitter=\u00dcbergebender Benutzer
jobNode=Knoten
jobAppServer=Anwendungsserver
jobLastUpdate=Letzte Aktualisierung
jobCurrentState=Zustand
jobStatusTxt=Statusinformationen
jobStartTime=Startzeit
jobGroup=Gruppe

jobScheduleRequestId=Name
jobScheduleStartDateTime=Startdatum und -zeit
jobScheduleInterval=Intervall
jobScheduleName=Name
jobScheduleSubmitter=\u00dcbergebender Benutzer
jobScheduleNameValuePairs=Substitutionseigenschaften
jobScheduleStatus=Status
job.schedule.status.active=Aktiv
job.schedule.status.suspended=Ausgesetzt
job.schedule.action.select=---Aktion ausw\u00e4hlen---
job.schedule.action.cancel=Abbrechen
job.schedule.all=Alle

work.area.frame=Arbeitsbereichsrahmen
task.nav.frame=Taskvavigationsrahmen
header.frame=Headerrahmen

job.definition=Jobdefinition
select.job=Job ausw\u00e4hlen
# Error messages
# No need to translate the commented strings

CWLJM1000E=Die Aktion {0} konnte nicht ausgef\u00fchrt werden, weil der Job-Scheduler nicht verf\u00fcgbar ist.
CWLJM1001E=Die Aktion {0} konnte f\u00fcr die ausgew\u00e4hlten Jobs nicht ausgef\u00fchrt werden.
CWLJM2102W=An dem Endpunkt, an dem der Job {0} ausgef\u00fchrt wird bzw. wurde, ist eine Bedingung f\u00fcr Vitalit\u00e4ts\u00fcberwachung aufgetreten. Wiederholen Sie die Operation {1} zu einem sp\u00e4teren Zeitpunkt.
CWLJM2201E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil der Job-Scheduler keine Operationen f\u00fcr den Endpunkt planen kann, an dem der Job derzeit ausgef\u00fchrt wird bzw. ausgef\u00fchrt wurde.
CWLJM2203E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil der Job nicht mehr vorhanden ist.

CWLJM2204E=Die Aktion {0} kann f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil der Job einen ung\u00fcltigen Zustand hat.

CWLJM2205E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil im Job-Scheduler eine interne Ausnahme eingetreten ist.
CWLJM2206E=Die Jobdefinition {0} wurde nicht an der angegebenen Position im lokalen Dateisystem gefunden.
CWLJM2207E=Die Jobdefinition {0} konnte nicht gelesen werden. Pr\u00fcfen Sie, ob die Datei gesperrt oder leer ist.
CWLJM2208E=Sie sind nicht berechtigt, die Aktion {0} f\u00fcr den Job {1} auszuf\u00fchren.
CWLJM2209W=Die Aktion konnte nicht ausgef\u00fchrt werden. Wiederholen Sie die Eingabe.
CWLJM2210E=Das Jobprotokoll konnte nicht f\u00fcr den Download vorbereitet werden.
CWLJM2211E=Das Jobprotokoll kann nicht gelesen werden.
CWLJM2212E=Der Benutzer ist nicht berechtigt, die Aktion {0} f\u00fcr den Job {1} auszuf\u00fchren.
CWLJM2213E=Die Aktion {0} kann nicht f\u00fcr mehrere Jobs gleichzeitig ausgef\u00fchrt werden. W\u00e4hlen Sie bitte nur einen Job aus.
CWLJM2214W=Bei einem erzwungenen Jobabbruch wird die Java Virtual Machine (JVM), in der der Job ausgef\u00fchrt wird, mit dem Code f\u00fcr abnormale Beendigung 222 beendet. Der Befehl f\u00fcr erzwungenen Abbruch wird nur f\u00fcr Stapel- und rechenintensive Jobs unterst\u00fctzt, die auf der z/OS-Plattform ausgef\u00fchrt werden. Wenn der abzubrechende Job auf einer verteilten Plattform ausgef\u00fchrt wird, wird der Befehl f\u00fcr erzwungenen Abbruch in einen regul\u00e4ren Abbruchbefehl konvertiert, und die JVM wird nicht beendet. Der Befehl f\u00fcr erzwungenen Abbruch sollte mit \u00e4u\u00dferster Vorsicht verwendet werden. M\u00f6chten Sie die Operation <a href="{0}">fortsetzen</a>, um den Job {1} abzubrechen?
CWLJM2215E=Das Jobprotokoll kann nicht gelesen werden, weil der Eigner-Scheduler {0} nicht aktiv ist.
CWLJM2216E=Das Jobprotokoll kann nicht gelesen werden. Suchen Sie im Protokoll {0} nach Details.
CWLJM2217E=Das Jobprotokoll kann nicht gelesen werden, weil der Job {0} nicht mehr vorhanden ist.
CWLJM2218E=Das Jobprotokoll kann nicht gelesen werden, weil keine Jobprotokollmetadaten f\u00fcr den Job {0} im Scheduler {1} vorhanden sind.
CWLJM2219E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil der Eignerjob-Scheduler nicht aktiv ist.
CWLJM2220E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil ihre Syntax ung\u00fcltig ist.
CWLJM2221E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil die zugeh\u00f6rige Anwendung nicht installiert oder die zugeh\u00f6rige Edition nicht aktiv ist.
CWLJM2222E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil der Grid-Dienstprogrammjob unter z/OS nicht unterst\u00fctzt wird.
CWLJM2223E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil die erforderliche Funktionalit\u00e4t nicht in der Grid-Ausf\u00fchrungsumgebung gefunden wurde.
CWLJM2224E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil mehrdeutige Editionen in der Grid-Ausf\u00fchrungsumgebung gefunden wurden.
CWLJM2225E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil im Job-Scheduler eine Datenbankausnahme eingetreten ist.
CWLJM2226E=Die Aktion {0} konnte f\u00fcr den Job {1} nicht ausgef\u00fchrt werden, weil sie nicht f\u00fcr Grid-Dienstprogrammjobs unterst\u00fctzt wird.
CMLJM2227E=Der Job kann nicht ausgesetzt werden, weil die Aussetzzeit, {0}, nicht g\u00fcltig ist.
CWLJM2300I=Die Jobdefinition {0} wurde erfolgreich mit der Job-ID {1} \u00fcbergeben.
CWLJM2301I=Der Job {0} wurde erfolgreich mit der Job-ID {1} \u00fcbergeben.
CWLJM2302I=Die Jobdefinition {0} wurde erfolgreich unter dem Namen {1} gespeichert.
CWLJM2306I=Die Jobdefinition {0} wurde erfolgreich mit der Job-ID {1} f\u00fcr die Ausf\u00fchrung um {2} \u00fcbergeben.
CWLJM2307I=Der Job {0} wurde erfolgreich mit der Job-ID {1} f\u00fcr die Ausf\u00fchrung um {2} \u00fcbergeben.
CWLJM2308I=Der Plan {1} f\u00fcr die Ausf\u00fchrung des Jobs {0} wurde erfolgreich erstellt.
CWLJM2309I=Der Plan {1} f\u00fcr die Ausf\u00fchrung der Jobdefinition {0} wurde erfolgreich erstellt.
CWLJM2310E=Die Jobdefinition {0} kann nicht \u00fcbergeben werden.
CWLJM2311E=Der Job {0} kann nicht \u00fcbergeben werden, weil seine Syntax ung\u00fcltig ist: {1}
CWLJM2312E=Der Plan konnte nicht erstellt werden, weil der Name {1} bereits verwendet worden ist. W\u00e4hlen Sie einen anderen Namen f\u00fcr diesen Plan.
CWLJM2313E=Der Jobname ist erforderlich. Geben Sie den Namen eines Jobs aus dem Job-Repository an.
CWLJM2314E=Der Jobname {0} stimmt mit keinem der Jobs im Job-Repository \u00fcberein. Geben Sie den g\u00fcltigen Namen eines Jobs aus dem Job-Repository an.
CWLJM2315E=Der Job {0} kann nicht \u00fcbergeben werden, weil seine Syntax ung\u00fcltig ist: {1}
CWLJM2316E=Der Job {0} kann nicht aus dem Job-Repository abgerufen werden.
CWLJM2317E=Der Job kann nicht gespeichert werden. Zum Speichern des Jobs muss ein Name f\u00fcr die Jobdefinition angegeben werden.
CWLJM2318E=Die Jobdefinition {0} mit dem Namen {1} kann nicht gespeichert werden.
CWLJM2319E=Der Job {0} kann nicht gespeichert werden, weil seine Syntax ung\u00fcltig ist.
CWLJM2320E=Der Job {0} konnte nicht gespeichert werden, weil der Name {1} bereits verwendet worden ist. W\u00e4hlen Sie einen anderen Namen f\u00fcr diesen Job.
CWLJM2321E=Das angegebene Datum bzw. die angegebene Zeit hat ein ung\u00fcltiges Format. Es sind nur numerische Zeichen g\u00fcltig. Das Datum muss im Format jjjj-MM-dd und die Uhrzeit im Format HH:mm:ss angegeben werden.
CWLJM2322E=Der Plan kann ohne Startdatum und Startzeit nicht erstellt werden.
# No need to translate "daily" "weekly" "monthly"
CWLJM2323E=Das ausgew\u00e4hlte Intervall wird f\u00fcr Pl\u00e4ne nicht unterst\u00fctzt.
CWLJM2324E=Das Startdatum und die Startzeit m\u00fcssen in der Zukunft liegen.
CWLJM2325E=Der Job {0} konnte nicht gelesen werden, weil im Job-Scheduler ein Problem aufgetreten ist.
CWLJM2326E=Der Job {0} konnte nicht gelesen werden, weil im Job-Scheduler ein Problem aufgetreten ist.

CWLJM2330E=Das Feld Name ist erforderlich.
CWLJM2331E=Das Feld Startdatum ist erforderlich.
CWLJM2332E=Das Feld Startzeit ist erforderlich.
CWLJM2333E=Dieser Plan kann nicht mit der Jobdefinition {0} erstellt werden.
CWLJM2334E=Es kann kein Plan mit dem Job {0} erstellt werden.
CWLJM2335E=Der Job {0} kann nicht in einen Plan kopiert werden, weil seine Syntax ung\u00fcltig ist.
CWLJM2336E=Der gespeicherte Job {0} kann nicht in einen Plan kopiert werden, weil seine Syntax ung\u00fcltig ist.
CWLJM2340I=Der Job {0} hat Substitutionseigenschaften. Geben Sie die erforderlichen Substitutionseigenschaften an, und klicken Sie anschlie\u00dfend auf <b>OK</b>, um den Job zu \u00fcbergeben.
CWLJM2341I=Der Job {0} hat keine Substitutionseigenschaften. Klicken Sie auf <b>OK</b>, um den Job zu \u00fcbergeben.
CWLJM2342I=Der Job {0} hat Substitutionseigenschaften. Geben Sie die erforderlichen Substitutionseigenschaften an, und klicken Sie anschlie\u00dfend auf <b>OK</b>, um diesen Plan zu aktualisieren.
CWLJM2343E=Der Job {0} kann nicht gespeichert werde. Die Pr\u00fcfzeichenfolge ist erforderlich, weil die Systemprogrammierschnittstelle (SPI) AuditStringValidator konfiguriert und installiert ist.
CWLJM2350E=Fehler beim Aktualisieren des Plans.
CWLJM2351I=Der Plan {0} wurde erfolgreich aktualisiert.
CWLJM2352E=Der Jobname ist erforderlich. Geben Sie den Namen eines Jobs aus dem Job-Repository an.
CWLJM2353E=Der Plan konnte nicht aktualisiert werden, weil der Jobname {0} mit keinem der Jobs im Job-Repository \u00fcbereinstimmt. W\u00e4hlen Sie einen anderen Namen f\u00fcr diesen Plan.
CWLJM2354E=Der Plan mit dem Job {0} kann nicht aktualisiert werden.
CWLJM2355I=Die Aktualisierung war erfolgreich.
CWLJM2356I=W\u00e4hlen Sie einen Plan aus.
CWLJM2360E=Die Jobdefinition {0} kann nicht \u00fcbergeben werden, weil die Anwendung, die \u00fcber die Jobdefinition ausgef\u00fchrt wird, in keinem Endpunkt implementiert ist.
CWLJM2361E=Die Jobdefinition {0} kann nicht \u00fcbergeben werden, weil Grid-Dienstprogrammjobs unter dem Betriebssystem z/OS nicht unterst\u00fctzt werden.
CWLJM2362E=Die Jobdefinition {0} kann nicht \u00fcbergeben werden, weil keiner der Endpunkte die Ressourcen hat, die f\u00fcr die Jobklasse erforderlich sind.
CWLJM2363E=Die Jobdefinition {0} kann nicht \u00fcbergeben werden, weil die angegebene Edition nicht installiert oder nicht aktiv ist.
CWLJM2364E=Die Jobdefinition {0} kann nicht \u00fcbergeben werden, weil mehrdeutige Editionen gefunden wurden. Geben Sie die gew\u00fcnschte Edition in der Jobdefinition an.
CWLJM2400E=Der Job konnte nicht entfernt werden, weil der Name {0} ung\u00fcltig ist.
CWLJM2401E=Der Job {0} kann nicht entfernt werden.
CWLJM2402I=W\u00e4hlen Sie einen Job aus.
CWLJM2403E=Der Job {0} kann nicht entfernt werden, weil er zu einem vorhandenen Plan geh\u00f6rt.
CWLJM2500E=Sie sind nicht berechtigt, die Aktion {0} f\u00fcr den Plan {1} auszuf\u00fchren.

CWLJM2501E=Die Aktion {0} konnte nicht f\u00fcr die Pl\u00e4ne ausgef\u00fchrt werden.
CWLJM2502E=Die Aktion {0} f\u00fcr den Plan {1} konnte nicht ausgef\u00fchrt werden.
CWLJM2503E=Die Aktion {0} f\u00fcr den Plan {1} konnte nicht ausgef\u00fchrt werden, weil der Plan nicht vorhanden ist.
CWLJM2504E=Der Plan {0} kann nicht permanent abgebrochen werden.
CWLJM2600I=Es ist kein Job im Job-Scheduler vorhanden.
CWLJM2601I=Nach der Anwendung des Filters wurde kein Job mehr gefunden.
CWLJM2602I=Es ist kein gespeicherter Job im Job-Repository enthalten.
CWLJM2603I=Nach der Anwendung des Filters wurde kein gespeicherter Job mehr gefunden.
CWLJM2604I=Es ist kein Plan im Job-Scheduler vorhanden.
CWLJM2605I=Nach der Anwendung des Filters wurde kein Plan mehr gefunden.

JMCAction.execute.exception.step=CWLJM2606I: Der aktuelle Schritt kann nicht ermittelt werden.
JMCAction.execute.exception.step.explanation=Das System kann den aktuellen Schritt der Aktion in der Job-Management-Konsole nicht ermitteln.
JMCAction.execute.exception.step.useraction=Lesen Sie die Informationen zur Fehlerbestimmung auf der Unterst\u00fctzungswebseite von WebSphere Application Server (http://www.ibm.com/software/webservers/appserv/was/support).

JMCAction.execute.exception.next=CWLJM2607I: Die n\u00e4chste Aktion kann nicht ermittelt werden.
JMCAction.execute.exception.next.explanation=Das System kann die n\u00e4chste Aktion der Job-Management-Konsolenaktion nicht ermitteln.
JMCAction.execute.exception.next.useraction=Lesen Sie die Informationen zur Fehlerbestimmung auf der Unterst\u00fctzungswebseite von WebSphere Application Server (http://www.ibm.com/software/webservers/appserv/was/support).

JMCAction.NamingException=CWLJM2608I: JobSchedulerHome konnte nicht erstellt werden.
JMCAction.NamingException.explanation=Die Job-Scheduler-Referenz wurde nicht gefunden.
JMCAction.NamingException.useraction=Vergewissern Sie sich, dass der Job-Scheduler ordnungsgem\u00e4\u00df konfiguriert wurde.

JMCAction.Exception=CWLJM2609I: JobScheduler konnte nicht erstellt werden.
JMCAction.Exception.explanation=Die Job-Scheduler-Referenz wurde nicht gefunden.
JMCAction.Exception.useraction=Vergewissern Sie sich, dass der Job-Scheduler ordnungsgem\u00e4\u00df konfiguriert wurde.

JMCAction.Exception.Message=CWLJM2610I: Fehler beim Erstellen von JobScheduler: {0}
JMCAction.Exception.Message.explanation=Die Job-Scheduler-Referenz wurde nicht gefunden.
JMCAction.Exception.Message.useraction=Vergewissern Sie sich, dass der Job-Scheduler ordnungsgem\u00e4\u00df konfiguriert wurde.

SaveJobAction.execute.exception=CWLJM2611I: Ausnahme bei der Ausf\u00fchrung: {0}
SaveJobAction.execute.exception.explanation=W\u00e4hrend der Operation zum Speichern eines Jobs ist eine Ausnahme aufgetreten.
SaveJobAction.execute.exception.useraction=Verwenden Sie die in dieser Nachricht angegebene Ausnahme f\u00fcr die Fehlerbestimmung. Suchen Sie in den Protokollen, Traces und im FFDC-Fehlerprotokoll (First Failure Data Capture) nach der Hauptfehlerursache f\u00fcr den Fehler. 
