<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: Se ha producido un error interno. No se ha podido analizar un filtro de servicio.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: Se ha producido un error interno. La aplicaci&#243;n OSGi {0} de la versi&#243;n {1} no est&#225; en un estado v&#225;lido para solicitar recursos.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: Se ha producido un error interno. No se ha podido analizar un filtro de servicio.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: El paquete web {1} de la versi&#243;n {2} ha encontrado varios contextos de persistencia con el nombre {0}.
  </MsgText>
  <Explanation>
    El contenedor JPA de OSGi ha encontrado varios contextos de persistencia con el mismo nombre. Esta no es una configuraci&#243;n v&#225;lida y puede dar resultados incoherentes.
  </Explanation>
  <UserResponse>
    Cambie la aplicaci&#243;n OSGi para que ya no contenga paquetes que definan varios contextos de persistencia con el mismo nombre.
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: Un paquete web OSGi {0} de la versi&#243;n {1} define una dependencia del contexto de persistencia gestionada de JPA {2} con &#225;mbito ampliado. Los contextos de persistencia de &#225;mbito ampliado no est&#225;n soportados por el contenedor JPA de OSGi.
  </MsgText>
  <Explanation>
    Una aplicaci&#243;n ha declarado una dependencia del contexto de persistencia JPA de &#225;mbito ampliado, pero los contextos de persistencia de &#225;mbito ampliado no est&#225;n soportados en el contenedor JPA de OSGi.
  </Explanation>
  <UserResponse>
    Cambie la aplicaci&#243;n para que utilice contextos de persistencia gestionados por aplicaci&#243;n o de &#225;mbito de transacci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: Se ha producido un error interno. El entorno de ejecuci&#243;n de las aplicaciones OSGi no ha podido inicializar el soporte del contexto de persistencia.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: El paquete web {1} de la versi&#243;n {2} ha encontrado varias unidades de persistencia con el nombre {0}.
  </MsgText>
  <Explanation>
    El contenedor JPA de OSGi ha encontrado varias unidades de persistencia con el mismo nombre. Esta no es una configuraci&#243;n v&#225;lida y puede dar resultados incoherentes.
  </Explanation>
  <UserResponse>
    Cambie la aplicaci&#243;n OSGi para que ya no contenga paquetes que definan varias unidades de persistencia con el mismo nombre.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
