<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: No se ha especificado el par&#225;metro symbolicName y es necesario.
  </MsgText>
  <Explanation>
    El mandato requiere que se especifique el par&#225;metro symbolicName.
  </Explanation>
  <UserResponse>
    Vuelva a emitir el mandato especificando el nombre simb&#243;lico (symbolicName).
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: No se ha encontrado el manifiesto de despliegue desde la ubicaci&#243;n {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue, DEPLOYMENT.MF, que va a importarse no existe.
  </Explanation>
  <UserResponse>
    Compruebe que la v&#237;a de acceso del manifiesto de despliegue es correcta.
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: No se han podido eliminar los paquetes {0} del repositorio de paquetes interno. El resto de paquetes {1} se han eliminado satisfactoriamente.
  </MsgText>
  <Explanation>
    No se han podido eliminar algunos paquetes del repositorio de paquetes interno.
  </Explanation>
  <UserResponse>
    Detenga las aplicaciones que puedan estar utilizando los paquetes que no han podido eliminarse e intente eliminarlos de nuevo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: El paquete {0} ya se ha detenido.
  </MsgText>
  <Explanation>
    No puede detener el paquete porque ya se ha detenido.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: No se puede suprimir el paquete {0} porque los siguientes Archivos de paquetes compuestos tienen una dependencia respecto al paquete: {1}.
  </MsgText>
  <Explanation>
    El paquete no se puede suprimir del repositorio de paquetes interno si un Archivo de paquetes compuesto depende de dicho paquete.
  </Explanation>
  <UserResponse>
    Para suprimir el paquete, primero suprima los Archivos de paquetes compuestos listados y, despu&#233;s, suprima el paquete.
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: No se pueden obtener las posibilidades de caracter&#237;sticas necesarias como la caracter&#237;stica JPA2.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: No se puede encontrar el servicio con el ID de servicio {0}.
  </MsgText>
  <Explanation>
    El ID de servicio proporcionado al mandato no coincide con un servicio del registro.
  </Explanation>
  <UserResponse>
    Vuelva a intentar el mandato con un ID de servicio v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: El paquete {1} con la versi&#243;n {2}, definido en el archivo {0}, ya existe en el repositorio.
  </MsgText>
  <Explanation>
    No se puede a&#241;adir el paquete al repositorio porque ya existe el paquete en el repositorio.
  </Explanation>
  <UserResponse>
    Compruebe si el paquete del repositorio es el correcto. Si el paquete del repositorio no es correcto, elimine primero este paquete del repositorio para pode a&#241;adir el paquete correcto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: No se ha especificado el par&#225;metro cuName y es necesario.
  </MsgText>
  <Explanation>
    El mandato requiere que se especifique el par&#225;metro cuName.
  </Explanation>
  <UserResponse>
    Vuelva a emitir el mandato especificando el nombre de unidad de composici&#243;n (cuName).
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: Las referencias de servicio en el contenido del archivo de paquetes compuesto (CBA) {0} no pueden resolverse. Si estos servicios est&#225;n proporcionados por paquetes que no est&#225;n incluidos en el CBA, el CBA debe importarlos. No se han resuelto las siguientes dependencias de servicio: {1}
  </MsgText>
  <Explanation>
    Si un paquete en el archivo de paquetes compuesto (CBA) utiliza un servicio que no est&#225; contenido en el paquete o que ha exportado otro paquete del CBA, el CBA debe  importarlo.
  </Explanation>
  <UserResponse>
    Corrija el manifiesto compuesto, COMPOSITEBUNDLE.MF, de modo que el CBA importe los servicios que utilizan los paquetes del CBA y que de otra forma no est&#225;n disponibles en el CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: Se ha producido un error interno. No se ha encontrado el manifiesto de despliegue del activo EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: Se ha producido un error interno. Los metadatos de los paquetes {0} no se han podido eliminar del repositorio de paquetes interno. Asimismo, no se han podido eliminar los paquetes {1} del repositorio. La excepci&#243;n ha sido {2}
  </MsgText>
  <Explanation>
    No se han podido eliminar algunos paquetes del repositorio de paquetes interno y de otros no se han podido eliminar los metadatos. Es posible que el sistema se encuentre en un estado incoherente.
  </Explanation>
  <UserResponse>
    Descarte los cambios del espacio de trabajo actual e intente eliminar los paquetes de uno en uno.
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: El paquete {0} se ha iniciado satisfactoriamente.
  </MsgText>
  <Explanation>
    Este mensaje es meramente informativo.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: No se puede obtener la informaci&#243;n de paquete porque no se ha conectado a una infraestructura.
  </MsgText>
  <Explanation>
    No est&#225; conectado actualmente a una infraestructura.
  </Explanation>
  <UserResponse>
    Utilice el mandato connect para conectarse a una infraestructura. Para obtener una lista de infraestructuras disponibles, utilice el mandato list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: Se ha producido un error interno. No se ha podido encontrar el servicio iniciador.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: No se ha podido encontrar el paquete con el ID de paquete {0}.
  </MsgText>
  <Explanation>
    El ID de paquete proporcionado al mandato no coincid&#237;a con un paquete de la infraestructura.
  </Explanation>
  <UserResponse>
    Vuelva a intentar el mandato con un ID de paquete v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: El archivo {0} especificado no contiene un manifiesto de paquete v&#225;lido.
  </MsgText>
  <Explanation>
    El archivo especificado no es un paquete de OSGi.
  </Explanation>
  <UserResponse>
    Compruebe y corrija el manifiesto de paquete del archivo proporcionado.
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: Se ha producido un error interno. Un servicio en tiempo de ejecuci&#243;n no est&#225; disponible en el registro de servicios OSGi: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: El activo {0} proporcionado no es un activo EBA.
  </MsgText>
  <Explanation>
    El activo proporcionado no es un activo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que el activo proporcionado es un activo EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: Se ha producido un error interno. Los metadatos de los paquetes {0} no se han podido eliminar del repositorio de paquetes interno. La excepci&#243;n ha sido {1}
  </MsgText>
  <Explanation>
    No se han podido eliminar los paquetes  del repositorio de paquetes interno. Es posible que el sistema se encuentre en un estado incoherente.
  </Explanation>
  <UserResponse>
    Descarte los cambios del espacio de trabajo actual e intente eliminar los paquetes de uno en uno.
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: El paquete {0} ya se ha iniciado.
  </MsgText>
  <Explanation>
    No puede iniciar el paquete porque ya se ha iniciado.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: El filtro de servicio no es v&#225;lido: {0}.
  </MsgText>
  <Explanation>
    El filtro de servicio proporcionado no es v&#225;lido.
  </Explanation>
  <UserResponse>
    Compruebe que el filtro de servicio es v&#225;lido y vuelva a intentar el mandato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: Se ha producido un error interno. El servicio generador de repositorios no est&#225; disponible en el registro de servicios OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: No se ha podido obtener la informaci&#243;n de servicio porque no se ha conectado a una infraestructura.
  </MsgText>
  <Explanation>
    No est&#225; conectado actualmente a una infraestructura.
  </Explanation>
  <UserResponse>
    Utilice el mandato connect para conectarse a una infraestructura. Para obtener una lista de infraestructuras disponibles, utilice el mandato list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: El paquete {0} contenido en el archivo de paquetes compuesto {1} no contiene un manifiesto de paquete v&#225;lido.
  </MsgText>
  <Explanation>
    El archivo especificado no es un paquete de OSGi.
  </Explanation>
  <UserResponse>
    Compruebe y corrija el manifiesto de paquete del archivo proporcionado.
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: El archivo de paquetes compuesto (CBA) {0} no es v&#225;lido. Los paquetes importados por los paquetes del CBA no est&#225;n en la cabecera Import-Package del archivo manifiesto de CBA. Se han notificado los siguientes problemas: {1}
  </MsgText>
  <Explanation>
    Si un paquete en el archivo de paquetes compuesto (CBA) utiliza un paquete que no est&#225; contenido en el paquete o que ha exportado otro paquete del CBA, el CBA debe  importarlo.
  </Explanation>
  <UserResponse>
    Corrija el manifiesto compuesto, COMPOSITEBUNDLE.MF, de modo que el CBA importe los paquetes que utilizan los paquetes del CBA y que de otra forma no est&#225;n disponibles en el CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: La conexi&#243;n ya no est&#225; disponible. Compruebe las conexiones disponibles y vuelva a conectarse si es necesario.
  </MsgText>
  <Explanation>
    La infraestructura a la que estaba conectado ya no est&#225; disponible. Esto puede deberse a que se ha detenido una aplicaci&#243;n.
  </Explanation>
  <UserResponse>
    Compruebe si la infraestructura todav&#237;a est&#225; disponible y vuelva a conectarse si es necesario.
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: La serie {0} no coincide con la sintaxis correcta de nombresimb&#243;lico;versi&#243;n.
  </MsgText>
  <Explanation>
    La serie suministrada en la lista de paquetes a eliminar no se ha podido procesar porque no coincide con la sintaxis esperada.
  </Explanation>
  <UserResponse>
    Corrija la sintaxis de la serie suministrada.
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: No se han podido obtener los datos de cabecera porque no se ha conectado a una infraestructura.
  </MsgText>
  <Explanation>
    No est&#225; conectado actualmente a una infraestructura.
  </Explanation>
  <UserResponse>
    Utilice el mandato connect para conectarse a una infraestructura. Para obtener una lista de infraestructuras disponibles, utilice el mandato list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: No se ha podido encontrar el paquete con el nombre de paquete {0}.
  </MsgText>
  <Explanation>
    El nombre de paquete proporcionado al mandato no coincid&#237;a con un paquete de la infraestructura.
  </Explanation>
  <UserResponse>
    Compruebe que el nombre de paquete es v&#225;lido y vuelva a intentar el mandato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: El paquete {0} especificado con versi&#243;n {1} no existe en el repositorio de paquetes local.
  </MsgText>
  <Explanation>
    No se puede mostrar o suprimir el paquete porque no existe un paquete con ese nombre.
  </Explanation>
  <UserResponse>
    Compruebe y corrija la versi&#243;n o el nombre simb&#243;lico del paquete.
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: No se ha podido obtener la informaci&#243;n de paquete porque no se ha conectado a una infraestructura.
  </MsgText>
  <Explanation>
    No est&#225; conectado actualmente a una infraestructura.
  </Explanation>
  <UserResponse>
    Utilice el mandato connect para conectarse a una infraestructura. Para obtener una lista de infraestructuras disponibles, utilice el mandato list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: No existe el repositorio de paquetes {0}.
  </MsgText>
  <Explanation>
    Se ha intentado modificar el repositorio de paquetes, pero no existe.
  </Explanation>
  <UserResponse>
    Cree el repositorio de paquetes.
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: El archivo especificado {0} no se puede analizar como un archivo manifiesto debido a la excepci&#243;n {1}
  </MsgText>
  <Explanation>
    El archivo especificado no parece ser un archivo manifiesto v&#225;lido.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo proporcionado sea un archivo manifiesto v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: No se ha podido encontrar el paquete con la ubicaci&#243;n {0}.
  </MsgText>
  <Explanation>
    La ubicaci&#243;n de paquete proporcionada al mandato no coincid&#237;a con una ubicaci&#243;n de paquete de la infraestructura.
  </Explanation>
  <UserResponse>
    Compruebe que la ubicaci&#243;n de paquete es v&#225;lida y vuelva a intentar el mandato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      Consola de aplicaciones OSGi
  
 Mandatos de visualizaci&#243;n: estos mandatos s&#243;lo funcionan si est&#225; conectado a una infraestructura
  
     ss()                - Este mandato proporciona la informaci&#243;n de resumen sobre los paquetes instalados.
     bundles()           - Este mandato proporciona informaci&#243;n completa sobre los paquetes instalados.
     packages()          - Este mandato proporciona informaci&#243;n sobre los paquetes importados/exportados.
     services()          - Este mandato proporciona informaci&#243;n sobre los servicios registrados.
 
     bundle(&lt;ID_paquete&gt;)  - Este mandato proporciona informaci&#243;n sobre el paquete especificado
     headers(&lt;ID_paquete&gt;) - Este mandato da informaci&#243;n sobre las cabeceras asociadas al paquete especificado
     packages(&lt;bundle ID&gt;) - Este mandato da informaci&#243;n sobre los paquetes exportados para este paquete.
     packages(&lt;Nombre_paquete&gt;) - Este mandato proporciona informaci&#243;n sobre el paquete especificado.
     services(&lt;ID_servicio&gt;) - Este mandato proporciona informaci&#243;n sobre el servicio especificado.
     services(&lt;Filtro_OSGI&gt;) - Este mandato da informaci&#243;n sobre los servicios que coinciden con el filtro.
 
      refresh() - Este mandato renueva la memoria cach&#233; de la consola de aplicaciones OSGi 
con la informaci&#243;n m&#225;s reciente sobre el estado de la infraestructura.
 
 Mandatos de infraestructura:
 
     list() - Este mandato lista las infraestructuras a las que se puede conectar.
     connect(&lt;ID_infraestructura&gt;) - Este mandato conecta a la infraestructura especificada.
     connect(&lt;Nombre_paquete&gt;, &lt;Versi&#243;n_paquete&gt;, &lt;Nombre_nodo&gt;, &lt;Nombre_servidor&gt;) - Este mandato 
conecta a la infraestructura especificada.
 
 Control de paquetes:
 
     start(&lt;ID_paquete&gt;) - Este mandato inicia el paquete solicitado.
     stop(&lt;ID_paquete&gt;   - Este mandato detiene el paquete solicitado.
  </MsgText>
  <Explanation>
    Ninguna.
  </Explanation>
  <UserResponse>
    Ninguna.
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: El archivo especificado {0} no es un JAR o un Archivo de paquetes compuesto.
  </MsgText>
  <Explanation>
    El nombre del archivo especificado no finaliza con una extensi&#243;n de archivo .jar o .cba.
  </Explanation>
  <UserResponse>
    Compruebe y corrija el nombre del archivo proporcionado. El archivo proporcionado debe ser un JAR o un CBA (Composite Bundle Archive) v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: No se ha podido encontrar el paquete con el ID de paquete {0}.
  </MsgText>
  <Explanation>
    El ID de paquete proporcionado al mandato no coincid&#237;a con un paquete de la infraestructura.
  </Explanation>
  <UserResponse>
    Compruebe que el ID de paquete es v&#225;lido y vuelva a intentar el mandato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: La cabecera CompositeBundle-Content del Archivo de paquetes compuesto {0} s&#243;lo debe contener paquetes con una versi&#243;n exacta. Las entradas siguientes no son v&#225;lidas: {1}.
  </MsgText>
  <Explanation>
    Una entrada CompositeBundle-Content debe utilizar un formato similar a &apos;paquete.nombre;versi&#243;n=&quot;[1.0.0,1.0.0]&quot;&apos;.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que las entradas de la cabecera CompositeBundle-Content del archivo manifiesto de paquetes compuesto especifican una versi&#243;n exacta y utilizan el formato correcto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: No se puede instalar el Archivo de paquetes compuesto, {0}, porque los siguientes paquetes de exportaci&#243;n son diferentes de los que contiene el Archivo de paquetes compuesto: {1}
  </MsgText>
  <Explanation>
    Un Archivo de paquetes compuesto (CBA) s&#243;lo puede exportar paquetes que tambi&#233;n exportan los paquetes que el CBA contiene. Los atributos y las directrices tambi&#233;n deben coincidir.
  </Explanation>
  <UserResponse>
    Corrija el manifiesto compuesto, COMPOSITEBUNDLE.MF, de modo que exporte los paquetes que tambi&#233;n son exportados por los paquetes contenidos en el CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: La funcionalidad de la extensi&#243;n de la aplicaci&#243;n no est&#225; disponible para esta unidad de composici&#243;n porque la unidad de composici&#243;n est&#225; desplegada en los siguientes destinos, que no dan soporte a la extensi&#243;n de la aplicaci&#243;n: {0}
  </MsgText>
  <Explanation>
    Los destinos en los que se ha desplegado la unidad de composici&#243;n no dan todos soporte a la funcionalidad de la extensi&#243;n de la aplicaci&#243;n.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que la unidad de composici&#243;n a la que desea a&#241;adir extensiones est&#233; desplegada en destinos que den soporte a la funcionalidad de la extensi&#243;n de la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: El paquete {0} no se puede detener. Est&#225; actualmente en estado {1}.
  </MsgText>
  <Explanation>
    El paquete no se puede detener.
  </Explanation>
  <UserResponse>
    Consulte los mensajes de error que le acompa&#241;an para obtener m&#225;s informaci&#243;n sobre por qu&#233; este paquete no se puede detener.
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: No se ha especificado el par&#225;metro {0} y es necesario para el mandato {1}.
  </MsgText>
  <Explanation>
    Este mandato necesita el par&#225;metro especificado.
  </Explanation>
  <UserResponse>
    Vuelva a intentar el mandato y especifique el par&#225;metro necesario.
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: Las infraestructuras v&#225;lidas son:
  </MsgText>
  <Explanation>
    Este mensaje es meramente informativo.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: Los paquetes siguientes necesarios para el Archivo de paquetes compuesto, {0}, no se ha encontrado en el repositorio de  paquetes interno: {1}.
  </MsgText>
  <Explanation>
    Un Archivo de paquetes compuesto solo se puede desplegar si todas las dependencias se pueden encontrar en el repositorio de paquetes interno.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que las dependencias del Archivo de paquetes compuesto listadas est&#225;n en el Archivo de paquetes compuesto o instaladas en el repositorio de paquetes interno.
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: Se ha producido un problema de resoluci&#243;n al a&#241;adir una extensi&#243;n a la unidad de composici&#243;n {0}. La excepci&#243;n es: {1}
  </MsgText>
  <Explanation>
    El sistema no puede resolver la extensi&#243;n seleccionada conjuntamente con el despliegue actual del activo. Puede que a los paquetes les falten dependencias, sean incompatibles o no existan.
  </Explanation>
  <UserResponse>
    Inspeccione el error. Realice los cambios necesarios en el activo y en la extensi&#243;n, y vuelva a aplicar la extensi&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: El repositorio de paquetes en {0} ya se ha definido como el nombre {1}.
  </MsgText>
  <Explanation>
    Se ha intentado definir un nuevo repositorio de paquetes, pero otro repositorio de paquetes ya utiliza el URL especificado.
  </Explanation>
  <UserResponse>
    Especifique otro URL.
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: Se ha producido un error interno. Se ha intentado generar un objeto AriesApplicationModel desde un URL no de archivo {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: No se ha encontrado el activo EBA {0}.
  </MsgText>
  <Explanation>
    Ha importado un manifiesto de despliegue a un activo, pero el activo EBA (Enterprise Bundle Archive) no existe.
  </Explanation>
  <UserResponse>
    Compruebe que el activo EBA est&#225; instalado.
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: Deteniendo el paquete {0}.
  </MsgText>
  <Explanation>
    Este mensaje es meramente informativo.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: Se ha producido un problema de resoluci&#243;n al eliminar una extensi&#243;n de la unidad de composici&#243;n {0}. La excepci&#243;n es: {1}
  </MsgText>
  <Explanation>
    El sistema no puede resolver la extensi&#243;n seleccionada conjuntamente con el despliegue actual del activo. Puede que a los paquetes les falten dependencias, sean incompatibles o no existan.
  </Explanation>
  <UserResponse>
    Inspeccione el error. Realice los cambios necesarios en el activo y, a continuaci&#243;n, elimine como un activo la extensi&#243;n y otras extensiones interdependientes.
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: El manifiesto de despliegue que se va a importar no es v&#225;lido para el activo {0} porque no cumple los requisitos del manifiesto de aplicaci&#243;n.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue, DEPLOYMENT.MF, no es compatible con el manifiesto de aplicaci&#243;n, APPLICATION.MF, del activo.
  </Explanation>
  <UserResponse>
    Compruebe lo siguiente para el nuevo manifiesto de despliegue:
   1. Application-SymbolicName y Application-Version en el archivo DEPLOYMENT.MF deben coincidir con las entradas correspondientes en el archivo APPLICATION.MF.
 2. Los paquetes listados en la cabecera Deployed-Content del archivo DEPLOYMENT.MF deben coincidir con los paquetes listados en la cabecera Application-Content del archivo APPLICATION.MF.
 3. La versi&#243;n de paquete en la cabecera Deployed-Content del archivo DEPLOYMENT.MF debe estar dentro del rango de versiones para el paquete correspondiente del archivo APPLICATION.MF.
 4. Los paquetes listados en la cabecera Deployed-Use-Bundle del archivo DEPLOYMENT.MF tambi&#233;n deben listarse en la cabecera Use-Bundle del archivo APPLICATION.MF.
   5. La versi&#243;n de paquete en la cabecera Deployed-Use-Bundle del archivo DEPLOYMENT.MF debe estar dentro del rango de versiones para el paquete correspondiente en la cabecera Use-Bundle del archivo APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: El Archivo de paquetes compuesto, {0}, tiene una dependencia de despliegue sobre otro Archivo de paquetes compuesto, {1}.
  </MsgText>
  <Explanation>
    No se admite la anidaci&#243;n de archivos de paquetes compuestos.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo de paquetes compuesto depende s&#243;lo de paquetes de la cabecera CompositeBundle-Content del manifiesto del Archivo de paquetes compuesto.
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: No se ha podido conectar a una infraestructura con el nombre de infraestructura {0}, el nombre de nodo {1} y el nombre de servidor {2}.
  </MsgText>
  <Explanation>
    No se ha encontrado una infraestructura con los atributos especificados.
  </Explanation>
  <UserResponse>
    Compruebe que los atributos de la infraestructura son v&#225;lidos y vuelva a intentar el mandato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: Ya existe un repositorio de paquetes con el nombre {0}.
  </MsgText>
  <Explanation>
    Se ha intentado definir un nuevo repositorio de paquetes, pero el nombre especificado ya est&#225; en uso.
  </Explanation>
  <UserResponse>
    Especifique otro nombre.
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: No es posible crear un modelo de la aplicaci&#243;n Aries {0} porque algunos de sus componentes necesarios se est&#225; descargando todav&#237;a.
  </MsgText>
  <Explanation>
    Uno o m&#225;s paquetes necesarios para la aplicaci&#243;n se est&#225;n descargando. No se puede crear un modelo de la aplicaci&#243;n hasta no est&#233;n completas que todas las descargas.
  </Explanation>
  <UserResponse>
    Espere a que se descarguen todos los paquetes necesarios, e int&#233;ntelo de nuevo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: No se pueden a&#241;adir extensiones porque la unidad de composici&#243;n est&#225; desplegada en los siguientes destinos, que no dan soporte a la extensi&#243;n de la aplicaci&#243;n: {0}
  </MsgText>
  <Explanation>
    Los destinos en los que se ha desplegado la unidad de composici&#243;n no dan todos soporte a la funcionalidad de la extensi&#243;n de la aplicaci&#243;n.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que la unidad de composici&#243;n a la que desea a&#241;adir extensiones est&#233; desplegada en destinos que den soporte a la funcionalidad de la extensi&#243;n de la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: No se puede crear la estructura de directorios {0}.
  </MsgText>
  <Explanation>
    El directorio no se puede crear.
  </Explanation>
  <UserResponse>
    Compruebe que existe espacio de almacenamiento y que el producto tiene los permisos necesarios para crear el directorio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: El nombre simb&#243;lico {0} y la versi&#243;n {1} no coinciden con ninguna extensi&#243;n existente.
  </MsgText>
  <Explanation>
    Hay extensiones en la unidad de composici&#243;n que coinciden con el nombre simb&#243;lico y la versi&#243;n especificados.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: El paquete {0} no se puede iniciar. Est&#225; actualmente en estado {1}.
  </MsgText>
  <Explanation>
    El paquete no se puede iniciar.
  </Explanation>
  <UserResponse>
    Consulte los mensajes de error que le acompa&#241;an para obtener m&#225;s informaci&#243;n sobre por qu&#233; este paquete no se puede iniciar.
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: El manifiesto de despliegue que se va a importar no se puede resolver. Los requisitos que no cumplen son {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue, DEPLOYMENT.MF, que se va a importar tiene un requisito que no se puede cumplir.
  </Explanation>
  <UserResponse>
    Compruebe que el nuevo manifiesto de despliegue est&#225; completo e incluye los paquetes necesarios para resolver el activo EBA (Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: Se ha producido un problema al procesar el manifiesto del Archivo de paquetes compuesto, {0}.
  </MsgText>
  <Explanation>
    El manifiesto no est&#225; presente o el nombre o el formato no son correctos.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que el manifiesto est&#233; presente y tenga el formato y nombre correctos.
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: No se ha podido conectar a una infraestructura con el ID {0}.
  </MsgText>
  <Explanation>
    No se ha encontrado una infraestructura con el ID especificado.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que el ID de la infraestructura es v&#225;lido y vuelva a intentar el mandato.
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: El archivo de paquetes compuesto (CBA) {0} exporta los servicios que no proporcionan los paquetes contenidos en el CBA. Los paquetes no podr&#225;n utilizar estos servicios fuera del CBA. Se han notificado los siguientes problemas: {1}
  </MsgText>
  <Explanation>
    Un CBA no puede exportar servicios para los que no existe ninguna declaraci&#243;n de Blueprint o cabecera Bundle-ExportService: en uno de los paquetes del CBA.
  </Explanation>
  <UserResponse>
    A&#241;ada las declaraciones de servicio de Blueprint que faltan al contenido del CBA o elimine los detalles de las exportaciones incorrectas del manifiesto compuesto COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: No se ha especificado el par&#225;metro name y es necesario.
  </MsgText>
  <Explanation>
    El mandato requiere que se especifique el par&#225;metro name.
  </Explanation>
  <UserResponse>
    Vuelva a emitir el mandato especificando el nombre.
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: No se ha especificado el par&#225;metro URL y es necesario.
  </MsgText>
  <Explanation>
    El par&#225;metro URL es necesario para el mandato addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    Vuelva a emitir el mandato y especifique el URL del repositorio de paquetes externo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: No se ha podido crear la estructura de directorios {0}.
  </MsgText>
  <Explanation>
    Ha intentado exportar un manifiesto de despliegue a un directorio que no existe y no se puede crear la estructura de directorios.
  </Explanation>
  <UserResponse>
    Compruebe que existe espacio de almacenamiento y que el producto tiene los permisos necesarios para crear el directorio.
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: El nombre simb&#243;lico {0} y la versi&#243;n {1} no coinciden con ninguna extensi&#243;n disponible en ning&#250;n repositorio de paquetes disponible.
  </MsgText>
  <Explanation>
    No hay ning&#250;n paquete compuesto con el nombre simb&#243;lico y la versi&#243;n que se han especificado en ning&#250;n repositorio disponible para el entorno.
  </Explanation>
  <UserResponse>
    A&#241;ada el paquete compuesto a un repositorio disponible o seleccione otro paquete compuesto para a&#241;adirlo como una extensi&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: Iniciando el paquete {0}.
  </MsgText>
  <Explanation>
    Este mensaje es meramente informativo.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: Se ha producido un error interno. El proceso de resoluci&#243;n no genera una lista de paquetes para instalar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: Se ha conectado satisfactoriamente a la infraestructura {0}.
  </MsgText>
  <Explanation>
    Este mensaje es meramente informativo.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: Se ha producido un error interno al extraer el paquete {0} del Archivo de paquetes compuesto, {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: No se ha especificado el par&#225;metro name y es necesario.
  </MsgText>
  <Explanation>
    El par&#225;metro name es necesario para el mandato addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    Vuelva a emitir el mandato y especifique el nombre del repositorio de paquetes externo.
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: La extensi&#243;n con el nombre simb&#243;lico {0} y la versi&#243;n {1} ya se ha a&#241;adido a la unidad de composici&#243;n.
  </MsgText>
  <Explanation>
    La extensi&#243;n ya est&#225; incluida en la unidad de composici&#243;n.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: El contenido del manifiesto de despliegue no es correcto. Los siguientes paquetes son redundantes: {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue, DEPLOYMENT.MF, que se va a importar incluye paquetes que no son necesarios para resolver el activo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Compruebe que el nuevo manifiesto de despliegue no incluye los paquetes que se listan en el mensaje.
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: Conect&#225;ndose a la infraestructura {0} en el nodo {1} y el servidor {2}.
  </MsgText>
  <Explanation>
    No est&#225; conectado actualmente a la infraestructura.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: Se ha producido un error interno. Se ha intentado generar un objeto AriesApplicationModel desde un manifiesto de despliegue nulo.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: No se ha especificado el par&#225;metro version y es necesario.
  </MsgText>
  <Explanation>
    El mandato requiere que se especifique el par&#225;metro version.
  </Explanation>
  <UserResponse>
    Vuelva a emitir el mandato especificando la versi&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: El contenido del manifiesto de despliegue no es correcto. Son necesarios los siguientes paquetes adicionales {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue, DEPLOYMENT.MF, que va a importarse no incluye todos los paquetes necesarios para resolver el activo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Compruebe que el nuevo manifiesto de despliegue incluye todos los paquetes que se listan en el mensaje.
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: El paquete {0} se ha detenido satisfactoriamente.
  </MsgText>
  <Explanation>
    Este mensaje es meramente informativo.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: Se ha producido un error interno. Se ha intentado generar un objeto AriesApplicationModel desde un manifiesto de aplicaci&#243;n nulo.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
