<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: La resoluci&#243;n del activo {0} indica dependencias no v&#225;lidas de contenido compartido en el contenido de la aplicaci&#243;n: {1}
  </MsgText>
  <Explanation>
    Los paquetes de aplicaciones no pueden proporcionar paquetes o servicios a los paquetes compartidos. Adem&#225;s, los paquetes no se pueden desplegar como paquetes compartidos y de aplicaciones. Los despliegues que requieran paquetes compartidos que dependan de paquetes de aplicaciones no son v&#225;lidos.
  </Explanation>
  <UserResponse>
    Compruebe que todos los paquetes compartidos no v&#225;lidos sean necesarios para la aplicaci&#243;n. Si lo son, aseg&#250;rese de que no dependan del contenido de la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: No se ha podido leer el manifiesto de paquete del archivo JAR {0} en el archivo EBA {1}.
  </MsgText>
  <Explanation>
    Se ha producido una IOException al ubicar el manifiesto de un archivo JAR en un archivo EBA (Enterprise Bundle Archive) migrado. Puede que el archivo est&#233; corrompido o sea ilegible.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo tenga los permisos adecuados y que est&#233; en el formato correcto.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Se ha producido un error interno. El servicio proveedor {0} no est&#225; disponible.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: La aplicaci&#243;n OSGi desplegada en la unidad de composici&#243;n {0} en la aplicaci&#243;n de nivel empresarial {1} no se ha iniciado.
  </MsgText>
  <Explanation>
    Se ha producido una excepci&#243;n durante la operaci&#243;n de inicio.
  </Explanation>
  <UserResponse>
    Inspeccione los registros del servidor anteriores a esta excepci&#243;n para conseguir un diagn&#243;stico m&#225;s espec&#237;fico del problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: El archivo EBA (Enterprise Bundle Archive) {1} contiene el directorio {0}, que no tiene soporte.
  </MsgText>
  <Explanation>
    El archivo EBA especificado contiene un directorio llamado byValue, o byReference. Ninguno de estos nombres de directorio tiene soporte en el directorio ra&#237;z de un archivo EBA.
  </Explanation>
  <UserResponse>
    Elimine o renombre el directorio relevante.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: No existe el rol especificado {0}.
  </MsgText>
  <Explanation>
    Se ha intentado correlacionar los usuarios o grupos con un rol de seguridad que no existe.
  </Explanation>
  <UserResponse>
    Compruebe que el rol de seguridad especificado existe o cree el rol en la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: El manifiesto de despliegue que se va a importar no es v&#225;lido para el activo {0} porque no cumple los requisitos del manifiesto de aplicaci&#243;n.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue, DEPLOYMENT.MF, no es compatible con el manifiesto de aplicaci&#243;n, APPLICATION.MF, del activo.
  </Explanation>
  <UserResponse>
    Compruebe lo siguiente para el nuevo manifiesto de despliegue:
   1. Application-SymbolicName y Application-Version en el archivo DEPLOYMENT.MF deben coincidir con las entradas correspondientes en el archivo APPLICATION.MF.
 2. Los paquetes listados en la cabecera Deployed-Content del archivo DEPLOYMENT.MF deben coincidir con los paquetes listados en la cabecera Application-Content del archivo APPLICATION.MF.
 3. La versi&#243;n de paquete en la cabecera Deployed-Content del archivo DEPLOYMENT.MF debe estar dentro del rango de versiones para el paquete correspondiente del archivo APPLICATION.MF.
 4. Los paquetes listados en la cabecera Deployed-Use-Bundle del archivo DEPLOYMENT.MF tambi&#233;n deben listarse en la cabecera Use-Bundle del archivo APPLICATION.MF.
   5. La versi&#243;n de paquete en la cabecera Deployed-Use-Bundle del archivo DEPLOYMENT.MF debe estar dentro del rango de versiones para el paquete correspondiente en la cabecera Use-Bundle del archivo APPLICATION.MF.
 No edite manualmente el manifiesto de despliegue. Si es necesario, elimine el manifiesto de despliegue del EBA. Esto generar&#225; un nuevo archivo manifiesto de despliegue al importar el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: No se pueden resolver las versiones de paquete seleccionadas o no son compatibles.
  </MsgText>
  <Explanation>
    El sistema no puede resolver las versiones de paquete seleccionadas. Puede que a los paquetes les falten dependencias, sean incompatibles o no existan.
  </Explanation>
  <UserResponse>
    Modifique el conjunto de paquetes de entrada seleccionados e int&#233;ntelo de nuevo. Puede utilizar la consola de administraci&#243;n para ver u obtener la vista previa del estado del activo.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: El usuario {0} no es un usuario correlacionado ni un miembro de un grupo correlacionado para el rol {1}.
  </MsgText>
  <Explanation>
    El usuario que se especifique debe ser un usuario correlacionado en el rol de seguridad o miembro de un grupo correlacionado en el rol de seguridad. El usuario especificado no cumpl&#237;a ninguno de estos requisitos.
  </Explanation>
  <UserResponse>
    Configure las correlaciones de rol de seguridad con usuario/grupo para permitir que el usuario especificado act&#250;e en el rol especificado, o especifique otro usuario que ya tenga los permisos necesarios.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: La aplicaci&#243;n {0} contiene uno o varios archivos de paquetes compuestos (CBA) {1} en Application-Content. Esto no est&#225; soportado en OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7.
  </MsgText>
  <Explanation>
    Los CBA est&#225;n soportados en Application-Content para WebSphere Application Server Versi&#243;n 8 y posteriores.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n. Si la aplicaci&#243;n debe ejecutarse en OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7, vuelva a escribir la aplicaci&#243;n para que no haya CBA en Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: Se ha producido una IOException al leer el archivo manifiesto de aplicaci&#243;n del EBA (Enterprise Bundle Archive) {0}. Puede que el archivo no sea v&#225;lido, est&#233; da&#241;ado o sea ilegible.
  </MsgText>
  <Explanation>
    Se ha producido una IOException al leer un archivo manifiesto de aplicaci&#243;n EBA (Enterprise Bundle Archive) migrado. Puede que el archivo no sea v&#225;lido, est&#233; da&#241;ado o sea ilegible.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo manifiesto de la aplicaci&#243;n, APPLICATION.MF, siga la especificaci&#243;n de los archivos manifiesto.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Se ha producido un error interno. El URI del archivo de configuraci&#243;n de plug-in no tiene el formato esperado {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Se ha producido un error interno. Se ha devuelto un resultado incorrecto durante el suministro del archivo EBA (Enterprise Bundle Archive) {0}, se esperaba que la versi&#243;n m&#225;xima {1} fuera igual que la versi&#243;n m&#237;nima {2}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: La aplicaci&#243;n {0} no se ha podido suministrar para todos los nodos de la c&#233;lula. La aplicaci&#243;n s&#243;lo puede desplegarse en nodos de la versi&#243;n 7 que ejecutan OSGi Applications Feature Pack. El error de resoluci&#243;n era {1}.
  </MsgText>
  <Explanation>
    La aplicaci&#243;n que se est&#225; importando se ha suministrado correctamente en OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7, pero no se ha podido suministrar en WebSphere Application Server Versi&#243;n 8.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n. No obstante, este aviso indica que la aplicaci&#243;n puede contener un requisito de versi&#243;n demasiado estricto. Puede utilizar la informaci&#243;n del error de resoluci&#243;n para modificar la aplicaci&#243;n, para que pueda desplegarse en nodos de la versi&#243;n 8.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: No puede crearse un miembro del cl&#250;ster en el nodo {0} porque las aplicaciones OSGi {1} definen roles Run As.
  </MsgText>
  <Explanation>
    Todos los miembros del cl&#250;ster deben poder ejecutar las mismas aplicaciones, pero el nuevo miembro del cl&#250;ster no da soporte a las aplicaciones OSGi con roles Run As definidos.
  </Explanation>
  <UserResponse>
    Seleccione un nodo de la versi&#243;n 8 para alojar el miembro del cl&#250;ster o modifique la configuraci&#243;n de las aplicaciones para que no definan roles Run As.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: El manifiesto de despliegue de la aplicaci&#243;n {0} de versi&#243;n {1} lista contenido con el mismo nombre simb&#243;lico y versi&#243;n que la aplicaci&#243;n.
  </MsgText>
  <Explanation>
    Las aplicaciones, los paquetes y los paquetes compuestos comparten todos el mismo espacio de nombres, por lo que deben tener identificadores exclusivos en el espacio de nombres. Al validar el despliegue de la aplicaci&#243;n, el entorno de ejecuci&#243;n ha encontrado una referencia a un paquete con el mismo nombre simb&#243;lico y versi&#243;n que la aplicaci&#243;n.
  </Explanation>
  <UserResponse>
    Corrija el nombre simb&#243;lico del paquete, paquete compuesto o aplicaci&#243;n para que deje de haber una clase en el espacio de nombres.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: No se puede resolver el activo {0}. El atributo {1} de una importaci&#243;n para el paquete {2} no se puede cumplir durante el despliegue.
  </MsgText>
  <Explanation>
    Para los paquetes listados en la cabecera Application-Content de APPLICATION.MF, todas las importaciones de paquetes deben tener atributos que se puedan cumplir durante el despliegue.
  </Explanation>
  <UserResponse>
    Cambie el empaquetado o la configuraci&#243;n de la aplicaci&#243;n para que todos los paquetes listados en la cabecera Application-Content tengan importaciones de paquetes que se puedan cumplir durante el despliegue.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Se ha producido un error interno. No se pueden localizar los datos de configuraci&#243;n necesarios para expandir {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Se ha producido una excepci&#243;n al modelar el paquete {0}: {1}
  </MsgText>
  <Explanation>
    La excepci&#243;n especificada se ha producido al modelar el paquete especificado.
  </Explanation>
  <UserResponse>
    Analice la excepci&#243;n especificada para obtener informaci&#243;n del problema y solucionarlo.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Se ha producido un error interno. No se ha podido obtener la corriente de entrada de la entrada zip de web.xml en War {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: No se ha encontrado ning&#250;n alias de aut de escucha MDB que coincida con el nombre {0} en el destino {1} para el recurso utilizado por el bean {2} en el paquete {3} de la versi&#243;n {4}.
  </MsgText>
  <Explanation>
    El alias de aut especificado no existe o no es visible para esta aplicaci&#243;n.
  </Explanation>
  <UserResponse>
    Configure el alias de aut necesario o compruebe que se ha configurado en el &#225;mbito correcto de la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: No se puede resolver el activo {0}. Necesita el paquete {1}, que no se lista en la cabecera Application-Content del manifiesto de aplicaci&#243;n, APPLICATION.MF. Este paquete utiliza el servicio {2} del paquete {3}, que se lista en la cabecera Application-Content.
  </MsgText>
  <Explanation>
    La aplicaci&#243;n no se ha configurado correctamente. Un paquete compartido no puede utilizar un servicio de un paquete aislado. Los paquetes que se listan en la cabecera Application-Content est&#225;n aislados y s&#243;lo pueden exportar servicios a otras aplicaciones a trav&#233;s del mecanismo Application-ExportService.
  </Explanation>
  <UserResponse>
    Cambie el empaquetado o la configuraci&#243;n de la aplicaci&#243;n para que los paquetes que se listan en la cabecera Use-Bundle, o a&#241;adidos por el resolvedor, no necesiten servicios proporcionados por los paquetes que se listan en la cabecera Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: El activo {0} requiere descargas externas para poder desplegarse en una unidad de composici&#243;n.
  </MsgText>
  <Explanation>
    El activo nuevo o actualizado requiere que se descarguen uno o varios paquetes de un repositorio para poder a&#241;adirse a una unidad de composici&#243;n o actualizarse en una unidad de composici&#243;n.
  </Explanation>
  <UserResponse>
    Para iniciar el proceso de descarga de paquetes, guarde los cambios en la configuraci&#243;n maestra. Puede ver el estado de descarga del paquete del activo desde el panel de detalles del activo en la consola de administraci&#243;n. Cuando finalicen las descargas de paquetes, vuelva a intentar a&#241;adir o actualizar el activo en una unidad de composici&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: La conversi&#243;n del archivo archivo WAR {0} del archivo EBA {1} a un archivo WAB no se ha completado satisfactoriamente.
  </MsgText>
  <Explanation>
    Los archivos WAR (archivadores de aplicaciones web) de un EBA (Enterprise Bundle Archive) se deben convertir a WAB (paquetes de aplicaciones web) antes de que se puedan desplegar. El proceso de conversi&#243;n no se ha completado satisfactoriamente.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo WAR sea v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Se ha producido un error interno. El servicio RepositoryAdminSupport no est&#225; disponible en el registro de servicios OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: El alias de autenticaci&#243;n {0} no existe en el dominio de seguridad {2} del destino {1}.
  </MsgText>
  <Explanation>
    Debe existir un alias de autenticaci&#243;n en el dominio de seguridad global o de destino cuando las referencias de recurso de Blueprint est&#225;n enlazadas.
  </Explanation>
  <UserResponse>
    Seleccione un alias de autenticaci&#243;n que exista en el dominio de seguridad global o de destino, o cree un alias de autenticaci&#243;n v&#225;lido.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: No puede crearse un miembro del cl&#250;ster en el nodo {0} porque las aplicaciones OSGi {1} contienen archivos de paquetes compuestos (CBA) en Application-Content.
  </MsgText>
  <Explanation>
    Todos los miembros del cl&#250;ster deben poder ejecutar las mismas aplicaciones, pero el nuevo miembro del cl&#250;ster no da soporte a las aplicaciones OSGi con CBA en Application-Content.
  </Explanation>
  <UserResponse>
    Seleccione un nodo de la versi&#243;n 8 para alojar el miembro del cl&#250;ster o modifique las aplicaciones para que no contengan CBA en Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: La unidad de composici&#243;n {0} no se corresponde a una aplicaci&#243;n OSGi.
  </MsgText>
  <Explanation>
    La operaci&#243;n invocada opera en una unidad de composici&#243;n para una aplicaci&#243;n OSGi. La unidad de composici&#243;n seleccionada no contiene una aplicaci&#243;n OSGi.
  </Explanation>
  <UserResponse>
    Compruebe que un activo con el aspecto de tipo &quot;EBA, versi&#243;n=1.0&quot; respalda a la unidad de composici&#243;n seleccionada.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Se ha producido un error interno. No se ha podido extraer el manifiesto de despliegue del binario de activo {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Se ha producido un error interno. El servicio ModelledResourceManager no est&#225; disponible en el registro de servicios OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Se ha producido un error interno. No se puede modelar el paquete CBA {0} de la versi&#243;n {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: No se ha encontrado el archivo descriptor de aplicaci&#243;n Java EE en el archivo EBA {0}. Sin este archivo descriptor, los ra&#237;ces de contexto de los archivos WAR se establecen en los valores por omisi&#243;n.
  </MsgText>
  <Explanation>
    El sistema ha procesado un WAR (archivador de aplicaci&#243;n web) sin un archivo descriptor de aplicaci&#243;n asociado, application.xml, que define los ra&#237;ces de contexto. Se establecer&#225;n los ra&#237;ces de contexto del archivo WAR migrado en los valores por omisi&#243;n.
  </Explanation>
  <UserResponse>
    Si es necesario un archivo descriptor de aplicaci&#243;n, compruebe que se haya proporcionado este &#250;ltimo y que est&#233; correctamente empaquetado en el archivo EBA (Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: No se puede procesar el archivo manifiesto de despliegue proporcionado por la aplicaci&#243;n desde esta ubicaci&#243;n {0}.
  </MsgText>
  <Explanation>
    Se ha intentado importar un EBA que contiene un archivo manifiesto de despliegue. No se ha podido procesar este archivo.
  </Explanation>
  <UserResponse>
    Compruebe que el servidor de aplicaciones tenga permiso para acceder al archivo y que el archivo no est&#233; da&#241;ado. No edite manualmente el manifiesto de despliegue. Si es necesario, elimine el manifiesto de despliegue del EBA. Esto genera un nuevo archivo manifiesto de despliegue al importar el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Se ha producido un error interno. El servicio {0} no est&#225; disponible en el registro de servicios OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: No se ha podido crear el directorio {0}.
  </MsgText>
  <Explanation>
    No se ha podido crear el directorio especificado.
  </Explanation>
  <UserResponse>
    Compruebe que existe espacio de almacenamiento y que el producto tiene los permisos necesarios para crear el directorio.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Se ha producido un error interno. El m&#243;dulo {0} es de un tipo inesperado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: El archivo EBA {0} se ha instalado con errores.
  </MsgText>
  <Explanation>
    La validaci&#243;n y la instalaci&#243;n del archivo EBA (Enterprise Bundle Archive) se ha completado con errores.
  </Explanation>
  <UserResponse>
    Consulte los mensajes de error que le acompa&#241;an en el archivo SystemOut.log para obtener m&#225;s informaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: No se ha podido crear ning&#250;n enlace por omisi&#243;n para la referencia EJB {0} en el paquete {1} de la versi&#243;n {2} con la interfaz {3}, ya que no existen enterprise bean que coincidan en la aplicaci&#243;n.
  </MsgText>
  <Explanation>
    Se deben crear enlaces por omisi&#243;n para las referencias EJB no enlazadas. No se ha podido encontrar ning&#250;n enterprise bean con el que enlazar esta referencia.
  </Explanation>
  <UserResponse>
    Enlace la referencia a una ubicaci&#243;n JNDI conocida o corrija la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Se ha producido un error interno. No se encuentra el objeto de activo de configuraci&#243;n para el activo {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: No se puede encontrar la referencia de recurso con el nombre JNDI {0} y el tipo {1} en el destino {2} para la referencia de recurso EJB {3} definida en el paquete {4} con la versi&#243;n {5}.
  </MsgText>
  <Explanation>
    Un EBA (Enterprise Bundle Archive) que incluye referencias de recursos en un m&#243;dulo EJB especifica un nombre JNDI para una referencia de recurso que no existe en el espacio de nombres JNDI.
  </Explanation>
  <UserResponse>
    Si la referencia de recurso debe estar en el espacio de nombres JNDI, enlace un objeto al nombre o corrija la referencia de recurso y actualice el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: La aplicaci&#243;n OSGi desplegada en la unidad de composici&#243;n {0} en la aplicaci&#243;n de nivel empresarial {1} no se ha detenido.
  </MsgText>
  <Explanation>
    Se ha producido una excepci&#243;n durante la operaci&#243;n de detenci&#243;n.
  </Explanation>
  <UserResponse>
    Inspeccione los registros del servidor anteriores a esta excepci&#243;n para conseguir un diagn&#243;stico m&#225;s espec&#237;fico del problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: El rol {0} no es un rol v&#225;lido.
  </MsgText>
  <Explanation>
    El rol especificado no se ha configurado.
  </Explanation>
  <UserResponse>
    Configure el rol especificado.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: El miembro del cl&#250;ster {0} no se ha aumentado con las caracter&#237;sticas, {2}, necesarias para la aplicaci&#243;n OSGi {1}.
  </MsgText>
  <Explanation>
    Para que una aplicaci&#243;n OSGi pueda instalarse en un cl&#250;ster, todos los miembros del cl&#250;ster tienen que tener todas las caracter&#237;sticas necesarias de la aplicaci&#243;n. Al a&#241;adir un nuevo miembro del cl&#250;ster, dicho miembro tambi&#233;n necesita tener todas las caracter&#237;sticas que necesitan todas las aplicaciones OSGi que est&#225;n instaladas en el cl&#250;ster.
  </Explanation>
  <UserResponse>
    Compruebe que el miembro propuesto del cl&#250;ster tenga todas las caracter&#237;sticas necesarias para la aplicaci&#243;n OSGi listada en el mensaje de error.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: No se ha podido crear el directorio {0}.
  </MsgText>
  <Explanation>
    No se ha podido crear el directorio especificado.
  </Explanation>
  <UserResponse>
    Compruebe que existe espacio de almacenamiento y que el producto tiene los permisos necesarios para crear el directorio.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: El contenido del manifiesto de despliegue no es correcto. Los siguientes paquetes son redundantes: {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue que se va a importar incluye paquetes que no son necesarios para resolver el activo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Compruebe que el nuevo manifiesto de despliegue, DEPLOYMENT.MF,  no incluya los paquetes que se listan en el mensaje de excepci&#243;n. No edite manualmente el manifiesto de despliegue. Si es necesario, elimine el manifiesto de despliegue del EBA. Esto generar&#225; un nuevo archivo manifiesto de despliegue al importar el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: El grupo especificado {0} no es v&#225;lido.
  </MsgText>
  <Explanation>
    Ha intentado correlacionar un rol de seguridad con un grupo que no es v&#225;lido.
  </Explanation>
  <UserResponse>
    Compruebe que existe el grupo especificado.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Se ha producido un error interno. El servicio de administraci&#243;n no se ha registrado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Una extensi&#243;n de la unidad de composici&#243;n {0} requiere descargas externas.
  </MsgText>
  <Explanation>
    Ha creado o actualizado un archivo de paquetes compuesto (CBA) para utilizarlo como extensi&#243;n de una unidad de composici&#243;n. Esta extensi&#243;n requiere que se descarguen uno o varios paquetes desde un repositorio para poder a&#241;adir la extensi&#243;n a la unidad de composici&#243;n.
  </Explanation>
  <UserResponse>
    Para iniciar el proceso de descarga, guarde los cambios en la configuraci&#243;n maestra.  Puede ver el estado de descarga del paquete desde el panel de detalles de la unidad de composici&#243;n en la consola de administraci&#243;n. Espere a que se complete la descarga del paquete y, a continuaci&#243;n, a&#241;ada la extensi&#243;n a la unidad de composici&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: Ning&#250;n servidor o cl&#250;ster tiene la caracter&#237;stica necesaria {0} desplegada para el activo {1}.
  </MsgText>
  <Explanation>
    No se ha encontrado la caracter&#237;stica necesaria en ning&#250;n servidor.
  </Explanation>
  <UserResponse>
    Instale la caracter&#237;stica necesaria como m&#237;nimo en uno de los servidores.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Se ha producido un error interno. Falta el archivo EBA (Enterprise Bundle Archive) {0} de los paquetes siguientes: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: No se puede a&#241;adir el activo {0} a esta aplicaci&#243;n de nivel empresarial porque ya se ha a&#241;adido a la aplicaci&#243;n de nivel empresarial: {1}
  </MsgText>
  <Explanation>
    Un activo EBA (Enterprise Bundle Archive) s&#243;lo puede estar en una aplicaci&#243;n de nivel empresarial (BLA).
  </Explanation>
  <UserResponse>
    Cree una nueva aplicaci&#243;n con el mismo contenido pero con otro nombre simb&#243;lico de aplicaci&#243;n. Importe la nueva aplicaci&#243;n como un activo EBA y, a continuaci&#243;n, a&#241;&#225;dala a esta BLA.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: El suministro de la aplicaci&#243;n {0} ha dado  resultados diferentes para WebSphere Application Server Versi&#243;n 8 y OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7. Se utilizar&#225;n los resultados de la versi&#243;n 8.
  </MsgText>
  <Explanation>
    La aplicaci&#243;n que se est&#225; importando se ha suministrado correctamente en WebSphere Application Server Versi&#243;n 8 y OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7. No obstante, se han obtenido resultados diferentes para las dos operaciones de suministro. No puede ejecutar la misma aplicaci&#243;n con distintos despliegues.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1} se ha asignado al directorio {0}.
  </MsgText>
  <Explanation>
    Se va a a&#241;adir un activo EBA (Enterprise Bundle Archive) a una unidad de composici&#243;n. Para configurar la aplicaci&#243;n web contenida en el EBA, se ha asignado un directorio a la aplicaci&#243;n web.
  </Explanation>
  <UserResponse>
    Ninguna
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Se ha producido un error interno. No se ha podido leer el manifiesto de aplicaci&#243;n o el manifiesto de despliegue del archivo EBA (Enterprise Bundle Archive) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Se ha producido un error interno. No se encuentra el paso {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: El activo {0} contiene un archivo JAR {1} que no es un paquete y no se convertir&#225;. Si otros componentes de la aplicaci&#243;n dependen de este archivo, la aplicaci&#243;n producir&#225;  un error durante la ejecuci&#243;n.
  </MsgText>
  <Explanation>
    La conversi&#243;n de archivos JAR (Java Archive) de programa de utilidad y archivos JAR EJB (Enterprise JavaBeans) no est&#225; soportada.
  </Explanation>
  <UserResponse>
    Compruebe que ning&#250;n paquete de aplicaci&#243;n web (WAB) dependa de las clases del archivo JAR. Para evitar el mensaje de aviso, elimine el archivo JAR del archivo EBA (Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Se ha producido un error interno. No se ha podido leer el manifiesto de aplicaci&#243;n o el manifiesto de despliegue del archivo EBA (Enterprise Bundle Archive) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: La interfaz EJB {0} del enterprise bean {1} en el paquete {2} de la versi&#243;n {3} no se puede enlazar a la ubicaci&#243;n {4}. Las interfaces EJB accesibles localmente deben estar enlazadas al ejblocal: espacio de nombres.
  </MsgText>
  <Explanation>
    Las vistas locales, &quot;No hay interfaz&quot; e &quot;Inicio local&quot; de un enterprise s&#243;lo se pueden enlazar al JNDI accesible localmente. Esto significa que sus nombres de enlace debe empezar por &quot;ejblocal:&quot;.
  </Explanation>
  <UserResponse>
    Ajuste los nombres de enlace de las vistas EJB accesibles localmente para que utilicen el ejblocal: prefijo de espacio de nombres.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: El CompUnitStatusStep indica que la unidad de composici&#243;n  {0} deber&#237;a actualizarse a la &#250;ltima versi&#243;n de despliegue disponible desde el activo {1}. No obstante, la unidad de composici&#243;n {0} est&#225; actualizada.
  </MsgText>
  <Explanation>
    Para poder actualizar el activo desplegado en una unidad de composici&#243;n, debe estar disponible una versi&#243;n actualizada del activo y todos los paquetes que necesita el activo actualizado deben haber terminado de descargarse.
  </Explanation>
  <UserResponse>
    Compruebe que haya disponible una versi&#243;n posterior del activo y que hayan finalizado todas las descargas de paquetes.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Se ha producido un error interno. No se puede obtener la unidad de composici&#243;n para el activo {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: No puede crearse un miembro del cl&#250;ster en el nodo {0} porque las aplicaciones OSGi {1} se han extendido.
  </MsgText>
  <Explanation>
    Todos los miembros del cl&#250;ster deben poder ejecutar las mismas aplicaciones, pero el nuevo miembro del cl&#250;ster no da soporte a las extensiones de aplicaciones OSGi.
  </Explanation>
  <UserResponse>
    Seleccione un nodo de la versi&#243;n 8 para alojar el miembro del cl&#250;ster o elimine las extensiones de las aplicaciones para que puedan ejecutarse utilizando el nodo seleccionado.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: El paquete {0} de la unidad de composici&#243;n {1} no se ha podido actualizar, ya que hay un conflicto de extensi&#243;n con el mismo nombre simb&#243;lico.
  </MsgText>
  <Explanation>
    No es posible actualizar un paquete cba a la versi&#243;n solicitada porque ya existe una extensi&#243;n con el mismo nombre simb&#243;lico en esa versi&#243;n.
  </Explanation>
  <UserResponse>
    Elimine la extensi&#243;n o modifique la versi&#243;n del paquete a la que intenta actualizar.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: No se ha encontrado ning&#250;n nombre JNDI de especificaci&#243;n de activaci&#243;n de MDB que coincida con {0} en el destino {1} para el recurso utilizado por el bean {2} en el paquete {3} de la versi&#243;n {4}.
  </MsgText>
  <Explanation>
    No existe el nombre JNDI de referencia de especificaci&#243;n de activaci&#243;n de enlaces de escucha de MDB especificado.
  </Explanation>
  <UserResponse>
    Si la referencia debe estar en el espacio de nombres JNDI, enlace un objeto al nombre o corrija la referencia y actualice el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Se ha producido un error interno. No se ha podido consultar el contenido del activo {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: La aplicaci&#243;n {0} incluye un paquete compuesto {1} en el contenido de la aplicaci&#243;n. No se da soporte a esta operaci&#243;n.
  </MsgText>
  <Explanation>
    No puede utilizar la cabecera Application-Content para incluir archivos de paquetes compuestos directamente en un EBA.
  </Explanation>
  <UserResponse>
    Elimine el paquete compuesto del contenido de la aplicaci&#243;n. Puede incluir los paquetes individuales en Application-Content o instalar el paquete compuesto en un repositorio de paquetes para compartirlo.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Se ha producido un error interno. Existe un archivo con el nombre correcto en la antememoria de paquete, pero no contiene el paquete esperado {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: No se puede encontrar la referencia de destino de mensajes o la referencia de entorno de recursos con el nombre JNDI {0} y el tipo {1} en el destino {2} de la referencia de destino de mensajes EJB o la referencia de entorno de recursos {3} definida en el paquete {4} con la versi&#243;n {5}.
  </MsgText>
  <Explanation>
    Un EBA (Enterprise Bundle Archive) que incluye referencias de destinos de mensajes o referencias de entornos de recursos en un m&#243;dulo EJB especifica un nombre JNDI para una referencia de destino de mensajes o una referencia de entorno de recursos que no existe en el espacio de nombres JNDI.
  </Explanation>
  <UserResponse>
    Si la referencia de destino de mensajes o la referencia de entorno de recursos debe estar en el espacio de nombres JNDI, enlace un objeto al nombre o corrija la referencia de destino de mensajes o la referencia de entorno de recursos y actualice el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: La aplicaci&#243;n OSGi {0} no es v&#225;lida, ya que su nombre simb&#243;lico contiene dos caracteres de punto consecutivos.
  </MsgText>
  <Explanation>
    El nombre simb&#243;lico de una aplicaci&#243;n OSGi no puede contener la serie &quot;..&quot;, es decir, dos caracteres de punto consecutivos.
  </Explanation>
  <UserResponse>
    Cambie el nombre simb&#243;lico de la aplicaci&#243;n OSGi.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: No se ha podido leer el archivo EBA {0}.
  </MsgText>
  <Explanation>
    Se ha producido una IOException al leer un archivo EBA (Enterprise Bundle Archive) migrado. Puede que el archivo est&#233; corrompido o sea ilegible.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo tenga los permisos adecuados y que est&#233; en el formato correcto.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Se ha producido un error interno. El MBean SecurityAdmin no se ha registrado.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: Las referencias de servicio en el contenido del archivo de paquetes compuesto (CBA) {0} no pueden resolverse. Si estos servicios est&#225;n proporcionados por paquetes que no est&#225;n incluidos en el CBA, el CBA debe importarlos. No se han resuelto las siguientes dependencias de servicio: {1}
  </MsgText>
  <Explanation>
    Si un paquete en el archivo de paquetes compuesto (CBA) utiliza un servicio que no est&#225; contenido en el paquete o que ha exportado otro paquete del CBA, el CBA debe  importarlo.
  </Explanation>
  <UserResponse>
    Corrija el manifiesto compuesto, COMPOSITEBUNDLE.MF, de modo que el CBA importe los servicios que utilizan los paquetes del CBA y que de otra forma no est&#225;n disponibles en el CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: No se ha podido escribir el archivo EBA migrado {0}.
  </MsgText>
  <Explanation>
    Se ha producido una IOException al escribir un archivo EBA (Enterprise Bundle Archive) migrado.
  </Explanation>
  <UserResponse>
    Compruebe que el producto tiene los permisos necesarios para escribir en el directorio que corresponda, que no est&#225; bloqueado el archivo de destino y que hay espacio de almacenamiento disponible.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: La aplicaci&#243;n {0} no se ha podido suministrar para todos los nodos de la c&#233;lula. La aplicaci&#243;n s&#243;lo puede desplegarse en nodos de la versi&#243;n 8. El error de resoluci&#243;n era {1}.
  </MsgText>
  <Explanation>
    La aplicaci&#243;n que se est&#225; importando se ha suministrado correctamente en WebSphere Application Server Versi&#243;n 8, pero no se ha podido suministrar en OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n. No obstante, puede utilizar la informaci&#243;n del error de resoluci&#243;n para modificar la aplicaci&#243;n, para que pueda desplegarse en OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Utilizaci&#243;n de localhost como nombre de host para el transporte del servidor {0}.{1}. El direccionamiento de peticiones funcionar&#225; siempre que el servidor web y el servidor de aplicaciones est&#233;n en el mismo nodo.
  </MsgText>
  <Explanation>
    El nombre de host del servidor de aplicaciones especificado en el transporte se ha resuelto como localhost.
  </Explanation>
  <UserResponse>
    Si el servidor web y el servidor de aplicaciones est&#225;n en nodos distintos, investigue por qu&#233; el nombre de host del servidor de aplicaciones se ha resuelto como localhost.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: El archivo EBA {0} no se puede instalar. El Application-SymbolicName {1} del EBA ya est&#225; siendo utilizado por el archivo {2}.
  </MsgText>
  <Explanation>
    Est&#225; intentando configurar un archivo EBA, pero hay un activo existente que tiene el mismo nombre simb&#243;lico.
  </Explanation>
  <UserResponse>
    Cambie el nombre simb&#243;lico del EBA que vaya a instalar o desinstale el activo existente.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: No puede crearse un miembro del cl&#250;ster en el nodo {0} porque no se pueden suministrar en &#233;l las aplicaciones OSGi {1}. El error de resoluci&#243;n era {2}.
  </MsgText>
  <Explanation>
    Todos los miembros del cl&#250;ster deben poder ejecutar las mismas aplicaciones, pero el nuevo miembro del cl&#250;ster no puede ejecutar las aplicaciones OSGi especificadas.
  </Explanation>
  <UserResponse>
    Seleccione otro nodo compatible para alojar el miembro del cl&#250;ster o modifique las aplicaciones para que puedan ejecutarse utilizando el nodo seleccionado.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: No se puede analizar el archivo {0} para el archivo EBA (Enterprise Bundle Archive) {1}.
  </MsgText>
  <Explanation>
    No se ha podido analizar el archivo especificado.
  </Explanation>
  <UserResponse>
    Compruebe que el archivo tiene un formato correcto y no est&#225; da&#241;ado.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Se ha producido un error interno. No se ha podido leer el manifiesto de aplicaci&#243;n o el manifiesto de despliegue del archivo EBA (Enterprise Bundle Archive) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: No se puede crear el archivo: {0}
  </MsgText>
  <Explanation>
    Se ha producido un problema al crear el nombre de v&#237;a de acceso necesario durante la exportaci&#243;n del activo.
  </Explanation>
  <UserResponse>
    Compruebe que el servidor de aplicaciones tenga permiso para crear este nombre de v&#237;a de acceso.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: El mandato UpdateAppContentVersionStep de WAS V7 se ha sustituido por el mandato UpdateAppContentVersions de WAS V8.
  </MsgText>
  <Explanation>
    El mandato UpdateAppContentVersionStep de WAS V7 se ha sustituido por el mandato UpdateAppContentVersions de WAS V8. Consulte el InfoCenter para obtener m&#225;s informaci&#243;n.
  </Explanation>
  <UserResponse>
    Cambie el script para poder utilizar el mandato UpdateAppContentVersions.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Se ha producido un error interno. El archivo EBA (Enterprise Bundle Archive) {0}, cuando se resuelve, no tiene contenido que se pueda desplegar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: No se ha podido resolver el archivo EBA. Excepci&#243;n: {0}.
  </MsgText>
  <Explanation>
    El sistema no ha podido resolver las ubicaciones de los paquetes de aplicaci&#243;n componentes, en las versiones adecuadas, del archivo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Consulte la excepci&#243;n para obtener m&#225;s informaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Se ha producido un error interno. No se ha podido resolver el archivo EBA (Enterprise Bundle Archive) {0} porque no est&#225; disponible el servicio {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: El usuario especificado {0} no es v&#225;lido.
  </MsgText>
  <Explanation>
    Ha intentado correlacionar un rol de seguridad con un usuario que no es v&#225;lido.
  </Explanation>
  <UserResponse>
    Compruebe que existe el usuario especificado.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Se ha producido un error interno. No se ha podido encontrar un MBean para BundleCacheManager del perfil {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: Puede que el enlace {0} de la referencia EJB {1} en el paquete {2} de la versi&#243;n {3} con la interfaz {4} haya provocado que la aplicaci&#243;n no funcione correctamente despu&#233;s de una actualizaci&#243;n.
  </MsgText>
  <Explanation>
    Las partes constituyentes de las referencias de b&#250;squeda de java:global/application_name/module_name/ejb_name o java:app/module_name/ejb_name pueden cambiar despu&#233;s de la actualizaci&#243;n de una aplicaci&#243;n OSGi, de modo que las referencias deben modificarse en consecuencia, lo que hace que este acercamiento no sea pr&#225;ctico.
  </Explanation>
  <UserResponse>
    Utilice los servicios OSGi para configurar las dependencias EJB o declare una referencia EJB y correlaci&#243;nela con el nombre JNDI de EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: No se puede expandir el archivo EBA (Enterprise Bundle Archive) {0}, no se puede crear el directorio {1}.
  </MsgText>
  <Explanation>
    Al intentar expandir el archivo EBA especificado, no se ha podido crear un directorio necesario.
  </Explanation>
  <UserResponse>
    Compruebe que el servidor de aplicaciones tenga permiso para crear el directorio especificado.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: No se puede resolver el activo {0}. Tiene requisitos de versi&#243;n incompatibles en los siguientes paquetes: {1}.
  </MsgText>
  <Explanation>
    Para los paquetes listados en la cabecera Application-Content de APPLICATION.MF, todas las importaciones para un determinado paquete deben tener requisitos de versi&#243;n compatibles.
  </Explanation>
  <UserResponse>
    Cambie el empaquetado o la configuraci&#243;n de la aplicaci&#243;n para que todos los paquetes listados en la cabecera Application-Content tengan requisitos de versi&#243;n de paquete compatibles.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: No pueden configurarse roles Run As para los nodos anteriores a WebSphere Application Server Versi&#243;n 8. Cualquier configuraci&#243;n de este tipo se ignorar&#225;.
  </MsgText>
  <Explanation>
    Los roles Run As s&#243;lo pueden configurarse para WebSphere Application Server Versi&#243;n 8 y posteriores. No pueden configurarse para una unidad de composici&#243;n desplegada en destinos OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7.
  </Explanation>
  <UserResponse>
    No es necesario realizar ninguna acci&#243;n. Si deben configurarse roles Run As, elimine las correlaciones de destino de los nodos OSGi Applications Feature Pack de WebSphere Application Server Versi&#243;n 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: El ID de usuario o la contrase&#241;a es incorrecto.
  </MsgText>
  <Explanation>
    Se han proporcionado un ID de usuario o una contrase&#241;a incorrectos.
  </Explanation>
  <UserResponse>
    Vuelva a intentar la acci&#243;n con el ID de usuario y la contrase&#241;a correctos.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: La operaci&#243;n de actualizaci&#243;n no se ha ejecutado correctamente para la aplicaci&#243;n OSGi desplegada en la unidad de composici&#243;n {0} en la aplicaci&#243;n de nivel empresarial {1}.
  </MsgText>
  <Explanation>
    Se ha producido una excepci&#243;n durante la operaci&#243;n de actualizaci&#243;n.
  </Explanation>
  <UserResponse>
    Inspeccione los registros del servidor anteriores a esta excepci&#243;n para conseguir un diagn&#243;stico m&#225;s espec&#237;fico del problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Se ha producido un error interno. La entrada Application-Content del manifiesto de aplicaci&#243;n del archivo EBA (Enterprise Bundle Archive) {0} est&#225; vac&#237;a, por lo que no se instalar&#225; ning&#250;n paquete.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: No se ha podido leer el archivo descriptor de aplicaci&#243;n Java EE en el archivo EBA {0}.
  </MsgText>
  <Explanation>
    Se ha producido una IOException al leer el archivo descriptor de aplicaci&#243;n Java EE en un archivo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Compruebe que no est&#225; da&#241;ado el archivo descriptor de aplicaci&#243;n, que sea legible y que tenga establecidos los permisos adecuados.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: No se encuentra la referencia de recurso con el nombre JNDI {0} y el tipo {1} en el destino {2} para la referencia de recurso de m&#243;dulo web {3} definida en el paquete {4} con la versi&#243;n {5}.
  </MsgText>
  <Explanation>
    Un archivo EBA (Enterprise Bundle Archive) que incluye referencias de recursos en un archivo WAR (archivador de aplicaciones web) especifica un nombre JNDI para una referencia de recurso que no existe en el espacio de nombres JNDI.
  </Explanation>
  <UserResponse>
    Si la referencia de recurso debe estar en el espacio de nombres JNDI, enlace un objeto al nombre o corrija la referencia de recurso y actualice el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: No se ha podido crear ning&#250;n enlace por omisi&#243;n para la referencia EJB {0} en el paquete {1} de la versi&#243;n {2} con la interfaz {3} porque hay dos o m&#225;s enlaces posibles. La referencia se puede enlazar a cualquiera de los siguientes enterprise beans: {4}.
  </MsgText>
  <Explanation>
    Se deben crear enlaces por omisi&#243;n para las referencias EJB no enlazadas. Se ha encontrado m&#225;s de un enterprise bean posible al que enlazar esta referencia.
  </Explanation>
  <UserResponse>
    Enlace la referencia a un enterprise bean concreto o corrija la aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: El alias de autenticaci&#243;n {0} est&#225; configurado incorrectamente. No es aplicable enlazar un alias a referencias con un tipo de autenticaci&#243;n de Aplicaci&#243;n.
  </MsgText>
  <Explanation>
    Los alias de autenticaci&#243;n con un tipo de autenticaci&#243;n de Aplicaci&#243;n no se pueden enlazar a referencias de recurso de Blueprint.
  </Explanation>
  <UserResponse>
    Elimine el alias de autenticaci&#243;n de la referencia de recurso que corresponda.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: No existe el host virtual {0} especificado para el paquete {1}.
  </MsgText>
  <Explanation>
    Se ha intentado correlacionar un WAB (paquete de aplicaci&#243;n web) con un host virtual que no es v&#225;lido.
  </Explanation>
  <UserResponse>
    Compruebe que existe el host virtual especificado.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: El manifiesto de aplicaci&#243;n del archivo EBA {0} lista paquetes de la cabecera Application-Content que tambi&#233;n se listan en la cabecera Use-Bundle.
  </MsgText>
  <Explanation>
    Los nombres de paquete listados en la cabecera Application-Content de APPLICATION.MF no se pueden listar tambi&#233;n en la cabecera Use-Bundle, independientemente de las versiones de paquete.
  </Explanation>
  <UserResponse>
    Cambie el empaquetado del archivo EBA (Enterprise Bundle Archive) para que los nombres de paquete no est&#233;n duplicados en las cabeceras Application-Content y Use-Bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: El archivo de paquetes compuesto (CBA) {0} no es v&#225;lido. Los paquetes importados por los paquetes del CBA no est&#225;n en la cabecera Import-Package del archivo manifiesto de CBA. Se han notificado los siguientes problemas: {1}
  </MsgText>
  <Explanation>
    Si un paquete en el archivo de paquetes compuesto (CBA) utiliza un paquete que no est&#225; contenido en el paquete o que ha exportado otro paquete del CBA, el CBA debe  importarlo.
  </Explanation>
  <UserResponse>
    Corrija el manifiesto compuesto, COMPOSITEBUNDLE.MF, de modo que el CBA importe los paquetes que utilizan los paquetes del CBA y que de otra forma no est&#225;n disponibles en el CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: El enterprise bean {0} en el paquete {1} de la versi&#243;n {2} tiene varias correlaciones para la interfaz {3} en su archivo de enlaces. Las correlaciones son {4} y {5}.
  </MsgText>
  <Explanation>
    El archivo de enlaces EJB incluido en el paquete contiene informaci&#243;n de configuraci&#243;n de correlaci&#243;n ambigua para una interfaz EJB.
  </Explanation>
  <UserResponse>
    Corrija el archivo de enlaces para que s&#243;lo haya una correlaci&#243;n configurada para cada interfaz EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: No se puede encontrar una unidad de composici&#243;n con el nombre {0} en la c&#233;lula actual.
  </MsgText>
  <Explanation>
    El nombre dado no coincide con ning&#250;n nombre de unidad de composici&#243;n existente.
  </Explanation>
  <UserResponse>
    Compruebe el nombre de unidad de composici&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: El archivo EBA {0} contiene un MANIFEST.MF con la cabecera Extension-List. No puede soportarse la conversi&#243;n de esta cabecera.
  </MsgText>
  <Explanation>
    Ha intentado convertir un archivo archivo de empresa (EAR) en un archivo archivo paquete de empresa (EBA) en el que EAR contiene un MANIFEST.MF con una cabecera Extension-List, pero la conversi&#243;n de esta cabecera no se soporta. Un archivo EAR utiliza la cabecera Extension-List para identificar JAR externos que la aplicaci&#243;n necesita cuando se ejecuta.
  </Explanation>
  <UserResponse>
    Aseg&#250;rese de que los JAR externos listados en la cabecera Extension-List est&#225;n disponibles como paquetes en el repositorio de paquetes.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: No se puede resolver el activo {0}. Necesita el paquete {1}, que no se lista en la cabecera Application-Content del manifiesto de aplicaci&#243;n, APPLICATION.MF. Este paquete importa el paquete {2} del paquete {3}, listado en la cabecera Application-Content.
  </MsgText>
  <Explanation>
    La aplicaci&#243;n no se ha configurado correctamente. Un paquete compartido no puede importar un paquete de un paquete aislado. Los paquetes que se listan en la cabecera Application-Content est&#225;n aislados y s&#243;lo pueden proporcionar paquetes a otros paquetes que se listen en esta cabecera.
  </Explanation>
  <UserResponse>
    Cambie el empaquetado o la configuraci&#243;n de la aplicaci&#243;n para que los paquetes que se listan en la cabecera Use-Bundle, o a&#241;adidos por el resolvedor, no necesiten paquetes de los paquetes listados en la cabecera Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep no se ha ejecutado, pero deber&#237;a haberlo hecho.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: No se ha podido descargar el activo {0} en el destino {1} del dominio de seguridad {2} y en el destino {3} del dominio de seguridad {4}.
  </MsgText>
  <Explanation>
    Para desplegar un activo en m&#225;s de un destino, todos los destinos deben estar el mismo dominio de seguridad.
  </Explanation>
  <UserResponse>
    Cambie los destinos de despliegue para seleccionar un conjunto que est&#233; en un &#250;nico dominio de seguridad.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: El manifiesto compuesto del archivo de paquetes compuesto (CBA) {0} contiene una cabecera CompositeBundle-ExportService, pero ninguno de los servicios definidos en el CBA coinciden con este filtro.
  </MsgText>
  <Explanation>
    El manifiesto de paquete compuesto define una cabecera CompositeBundle-ExportService, pero no hay declaraciones de servicio de znBlueprint que coincidan con este filtro.
  </Explanation>
  <UserResponse>
    A&#241;ada las declaraciones de servicio de Blueprint que faltan al contenido del CBA o corrija la cabecera CompositeBundle-ExportService del manifiesto compuesto, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: El enterprise bean {0} en el paquete {1} de la versi&#243;n {2} tiene definido un nombre de correlaci&#243;n simple, pero tambi&#233;n tiene correlaciones espec&#237;ficas en su archivo de enlaces.
  </MsgText>
  <Explanation>
    El archivo de enlaces EJB incluido en el paquete contiene una configuraci&#243;n de correlaci&#243;n no v&#225;lida para un enterprise bean.
  </Explanation>
  <UserResponse>
    Corrija el archivo de enlaces para que haya un nombre de correlaci&#243;n simple o informaci&#243;n de configuraci&#243;n de correlaci&#243;n espec&#237;fica, pero no ambas cosas.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Se ha producido un error interno. No se puede suprimir el directorio de hoja de {0} para que pueda continuar la redenominaci&#243;n de un directorio.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Se ha producido un error interno. No se puede expandir el EBA (Enterprise Bundle Archive), no se ha especificado ning&#250;n directorio de expansi&#243;n en la configuraci&#243;n de {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: Se ha intentado actualizar un activo de la aplicaci&#243;n OSGi. No se da soporte a esta operaci&#243;n. La actualizaci&#243;n de activos de aplicaci&#243;n OSGi puede realizarse utilizando el panel &quot;Actualizar versiones de paquete en esta aplicaci&#243;n&quot; de la p&#225;gina de configuraci&#243;n de activos de aplicaci&#243;n OSGi.
  </MsgText>
  <Explanation>
    La actualizaci&#243;n de un activo de la aplicaci&#243;n OSGi con un nuevo binario no est&#225; soportada.
  </Explanation>
  <UserResponse>
    Si necesita hacer algo m&#225;s que actualizar las versiones de los paquetes dentro del activo existente, debe desinstalar el activo antes de importar su sustituto. O bien, puede a&#241;adir nuevos paquetes a una aplicaci&#243;n existente empaquet&#225;ndolos en un archivo de paquetes compuesto (CBA) y a&#241;adiendo el CBA como una extensi&#243;n a la unidad de composici&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: No se ha configurado ning&#250;n nombre JNDI de especificaci&#243;n de activaci&#243;n de bean controlado por mensajes (MDB) para el bean {0} en el paquete {1} de la versi&#243;n {2}, en el destino {3}.
  </MsgText>
  <Explanation>
    No se ha configurado ning&#250;n nombre JNDI de especificaci&#243;n de activaci&#243;n de enlaces de escucha de bean controlado por mensajes.
  </Explanation>
  <UserResponse>
    Debe configurar una referencia JNDI de especificaci&#243;n de activaci&#243;n para el MDB.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: No se puede renombrar el archivo {0} por el de {1} como parte de la expansi&#243;n del archivo EBA (Enterprise Bundle Archive) {2}.
  </MsgText>
  <Explanation>
    Para completar la expansi&#243;n del archivo EBA especificado, se debe renombrar un archivo. Este cambio de nombre no ha sido posible.
  </Explanation>
  <UserResponse>
    Compruebe que el servidor de aplicaciones tenga permiso para renombrar el archivo.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: El archivo de paquetes compuesto (CBA) {0} no es v&#225;lido. Los siguientes paquetes exportados que se incluyen en el manifiesto compuesto no est&#225;n exportados por los paquetes del CBA: {1}
  </MsgText>
  <Explanation>
    Un CBA s&#243;lo puede exportar paquetes exportados por los paquetes del CBA.
  </Explanation>
  <UserResponse>
    A&#241;ada los paquetes exportados que faltan a los paquetes del CBA o elimine los detalles de las exportaciones incorrectas del manifiesto compuesto COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: No se ha podido a&#241;adir el activo {0} porque no se han descargado los paquetes que requiere. Para iniciar la descarga del paquete, guarde los cambios en la configuraci&#243;n maestra despu&#233;s de importar el activo.
  </MsgText>
  <Explanation>
    Ha intentado a&#241;adir un activo que requiere que se descarguen uno o varios paquetes desde un repositorio. O bien no se ha iniciado la descarga o todav&#237;a no se ha completado.
  </Explanation>
  <UserResponse>
    Si no ha guardado los cambios despu&#233;s de importar el activo, gu&#225;rdelos ahora. Espere a que se complete la descarga del paquete, luego intente de nuevo a&#241;adir el activo a la aplicaci&#243;n de nivel empresarial (BLA). Puede ver el estado de descarga del paquete del activo desde el panel de detalles del activo en la consola de administraci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: El contenido del manifiesto de despliegue no es correcto. Son necesarios los siguientes paquetes adicionales {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue que va a importarse no incluye todos los paquetes necesarios para resolver el activo EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Compruebe que el nuevo manifiesto de despliegue, DEPLOYMENT.MF, incluya todos los paquetes que se listan en el mensaje. No edite manualmente el manifiesto de despliegue. Si es necesario, elimine el manifiesto de despliegue del EBA. Esto genera un nuevo archivo manifiesto de despliegue al importar el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: No se ha podido crear el directorio {0}.
  </MsgText>
  <Explanation>
    No se ha podido crear el directorio especificado.
  </Explanation>
  <UserResponse>
    Compruebe que existe espacio de almacenamiento y que el producto tiene los permisos necesarios para crear el directorio.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: No se puede exportar el activo {0} porque el paquete {1} que requiere no se ha terminado de descargar.
  </MsgText>
  <Explanation>
    Ha intentado exportar un activo que requiere que se descarguen uno o m&#225;s paquetes desde un repositorio. O bien no se ha iniciado la descarga o todav&#237;a no se ha completado.
  </Explanation>
  <UserResponse>
    Si no ha guardado los cambios despu&#233;s de importar el activo, gu&#225;rdelos ahora. Espere a que se complete la descarga del paquete, luego vuelva a intentar exportar el activo.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Se ha producido un error interno. El servicio DeploymentManifestManager no est&#225; disponible en el registro de servicios OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: No se ha podido resolver el archivo EBA. El manifiesto de despliegue incluido no es v&#225;lido en este sistema. Excepci&#243;n: {0}.
  </MsgText>
  <Explanation>
    El manifiesto de despliegue lista versiones espec&#237;ficas de los paquetes necesarios. El sistema no puede resolver estas versiones de paquetes. Cuando se incluye un manifiesto de despliegue en un archivo EBA, el resolvedor s&#243;lo utiliza las versiones de paquetes que est&#225;n especificadas en el manifiesto. En el sistema podr&#237;a haber otras versiones de paquetes v&#225;lidas, pero no se utilizan porque no se han especificado en el manifiesto de despliegue.
  </Explanation>
  <UserResponse>
    Si es necesario que la aplicaci&#243;n utilice un manifiesto de despliegue, por ejemplo, para garantizar que se ejecuta exactamente la misma configuraci&#243;n de paquete en varios entornos diferentes, utilice la informaci&#243;n proporcionada en la excepci&#243;n para identificar qu&#233; versiones de paquetes se necesitan y despu&#233;s haga que est&#233;n disponibles en el sistema. Si la aplicaci&#243;n no necesita este nivel extra de control, elimine el manifiesto de despliegue. No edite manualmente el manifiesto de despliegue.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: El valor especificado para la versi&#243;n del manifiesto de aplicaci&#243;n {0} no est&#225; soportado. La versi&#243;n soportada es {1}.
  </MsgText>
  <Explanation>
    El valor especificado para la cabecera Aplicaci&#243;n-ManifestVersion en APPLICATION.MF es incorrecto.
  </Explanation>
  <UserResponse>
    Corrija el valor de Application-ManifestVersion en APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Los requisitos especificados por el manifiesto de despliegue del EBA no se pueden cumplir. La excepci&#243;n generada es {0}.
  </MsgText>
  <Explanation>
    Se ha intentado importar un EBA que contiene un archivo manifiesto de despliegue. Los requisitos especificados por este archivo no se han podido cumplir.
  </Explanation>
  <UserResponse>
    Compruebe el contenido del archivo manifiesto de despliegue y verifique que el sistema en el que se va a desplegar este EBA sea compatible. Compruebe que se hayan configurado los repositorios de paquetes internos o externos necesarios. No edite manualmente el manifiesto de despliegue. Si es necesario, elimine el manifiesto de despliegue del EBA. Esto genera un nuevo archivo manifiesto de despliegue al importar el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: El archivo EBA {0} especifica Application-Content en su manifiesto de aplicaci&#243;n, pero la entrada est&#225; vac&#237;a.
  </MsgText>
  <Explanation>
    El archivo EBA (Enterprise Bundle Archive) contiene una cabecera Application-Content en su manifiesto de aplicaci&#243;n, application.mf. Si se proporciona, esta entrada debe enumerar como m&#237;nimo un paquete v&#225;lido.
  </Explanation>
  <UserResponse>
    Modifique la cabecera Application-Content del archivo application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: No se ha encontrado ning&#250;n destino MDB que coincida con {0} en el destino {1} para el recurso utilizado por el bean {2} en el paquete {3} de la versi&#243;n {4}.
  </MsgText>
  <Explanation>
    No existe el nombre JNDI de referencia de destino de enlaces de escucha de MDB especificado.
  </Explanation>
  <UserResponse>
    Si la referencia debe estar en el espacio de nombres JNDI, enlace un objeto al nombre o corrija la referencia y actualice el EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: El archivo EBA {0} no especifica Application-Content y no contiene paquetes v&#225;lidos.
  </MsgText>
  <Explanation>
    Un archivo EBA (Enterprise Bundle Archive) debe contener como m&#237;nimo un paquete OSGi v&#225;lido o un archivo WAR (archivador de aplicaciones web), o bien, incluir como m&#237;nimo un paquete OSGi en la cabecera Application-Content de su archivo manifiesto de aplicaci&#243;n.
  </Explanation>
  <UserResponse>
    Modifique el archivo EBA para que contenga al menos un paquete o WAR v&#225;lido (incluido por valor) o enumere como m&#237;nimo un paquete en la cabecera Application-Content de su archivo manifiesto de aplicaci&#243;n.
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: No se puede crear el directorio: {0}
  </MsgText>
  <Explanation>
    Se ha producido un problema al crear el nombre de v&#237;a de acceso necesario durante la exportaci&#243;n del activo.
  </Explanation>
  <UserResponse>
    Compruebe que el servidor de aplicaciones tenga permiso para crear este nombre de v&#237;a de acceso.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
