<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.app.container.aries/src/com/ibm/ws/app/container/aries/messages/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAI0045E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_FIND_ALL_BUNDLES_TO_UPDATE" varFormat="Java">
    COULD_NOT_FIND_ALL_BUNDLES_TO_UPDATE=CWSAI0045E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1081;&#1090;&#1080; &#1074;&#1089;&#1077; &#1080;&#1079;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WAITING_FOR_QUIESCE" varFormat="Java">
    EXCEPTION_WHILE_WAITING_FOR_QUIESCE=CWSAI0044E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1074; &#1093;&#1086;&#1076;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0006E" severity="E" prefix="yes">
  <MsgText pgmKey="COMPOSITE_FAILED_START_APPCONMSG0006" varFormat="Java">
    COMPOSITE_FAILED_START_APPCONMSG0006=CWSAI0006E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073; &#1076;&#1083;&#1103; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0005E" severity="E" prefix="yes">
  <MsgText pgmKey="COMPOSITE_FAILED_START_APPCONMSG0005" varFormat="Java">
    COMPOSITE_FAILED_START_APPCONMSG0005=CWSAI0005E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_PACKAGE_ADMIN" varFormat="Java">
    NO_PACKAGE_ADMIN=CWSAI0035E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1083;&#1091;&#1078;&#1073;&#1072; PackageAdmin &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_RB" varFormat="Java">
    UNABLE_TO_FIND_RB=CWSAI0031E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; {0}, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {1}, &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0032E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_RB_2" varFormat="Java">
    UNABLE_TO_FIND_RB_2=CWSAI0032E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; {0}, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {1}, &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0047E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_INSTALL_UPDATES" varFormat="Java">
    COULD_NOT_INSTALL_UPDATES=CWSAI0047E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1048;&#1079;-&#1079;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1086;&#1090;&#1082;&#1072;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1099; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1093; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1099; &#1089;&#1073;&#1086;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1074; &#1085;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;&#1093;.
  </UserResponse>
</Message>
<Message ID="CWSAI0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_EVENTHANDLERMSG0001" varFormat="Java">
    ARIES_APP_EVENTHANDLERMSG0001=CWSAI0014E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0017W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0003W" varFormat="Java">
    SERVICE_PUBLISHER0003W=CWSAI0017W: &#1057;&#1083;&#1091;&#1078;&#1073;&#1072; {0} &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1072; &#1085;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1072; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;, &#1085;&#1086; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1048;&#1044; &#1085;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1048;&#1044; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099;.
  </UserResponse>
</Message>
<Message ID="CWSAI0058E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_FAILED" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_FAILED=CWSAI0058E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1087;&#1088;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; Aries {0}. &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1090;&#1082;&#1072;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}.
  </MsgText>
  <Explanation>
    &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; Aries. &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1090;&#1082;&#1072;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    &#1047;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072;&#1084;. &#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1074;&#1089;&#1077; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080;.
  </UserResponse>
</Message>
<Message ID="CWSAI0024E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_REGISTRATION_FAILURE0001" varFormat="Java">
    MBEAN_REGISTRATION_FAILURE0001=CWSAI0024E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; JMX MBeans &#1076;&#1083;&#1103; {0}. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1072;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1072; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; JMX MBeans. &#1053;&#1077;&#1083;&#1100;&#1079;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; OSGi &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0050E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_START_ERROR" varFormat="Java">
    ARIES_APPLICATION_START_ERROR=CWSAI0050E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; Aries &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0056E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_STOPPING" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_STOPPING=CWSAI0056E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1087;&#1088;&#1080; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; Aries {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}.
  </MsgText>
  <Explanation>
    &#1053;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1072; &#1087;&#1088;&#1080; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; Aries.
  </Explanation>
  <UserResponse>
    &#1047;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072;&#1084;. &#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1074;&#1089;&#1077; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080;.
  </UserResponse>
</Message>
<Message ID="CWSAI0016W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0002W" varFormat="Java">
    SERVICE_PUBLISHER0002W=CWSAI0016W: &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; {0} &#1085;&#1077; &#1072;&#1085;&#1085;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1072; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; &#1085;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1072; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099;, &#1085;&#1086; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1048;&#1044; &#1085;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1048;&#1044; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099;.
  </UserResponse>
</Message>
<Message ID="CWSAI0052E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_UPDATE_ERROR" varFormat="Java">
    ARIES_APPLICATION_UPDATE_ERROR=CWSAI0052E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; Aries &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0040W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_LIST_FILTER_ID" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_LIST_FILTER_ID=CWSAI0040W: &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; {0} &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1089; &#1048;&#1044; {1}. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088; {2} &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1080; &#1089;&#1088;&#1077;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1101;&#1090;&#1091; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;.
  </MsgText>
  <Explanation>
    &#1044;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; OSGi, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1089;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073; &#1077;&#1097;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;-&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;.
  </UserResponse>
</Message>
<Message ID="CWSAI0015W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0001W" varFormat="Java">
    SERVICE_PUBLISHER0001W=CWSAI0015W: &#1057;&#1083;&#1091;&#1078;&#1073;&#1072; {0} &#1091;&#1078;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1072; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1078;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;. &#1053;&#1086;&#1074;&#1072;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1045;&#1089;&#1083;&#1080; &#1085;&#1086;&#1074;&#1072;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1083;&#1080;&#1073;&#1086; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1102;, &#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1077;&#1077;.
  </UserResponse>
</Message>
<Message ID="CWSAI0033E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_PKG" varFormat="Java">
    UNABLE_TO_FIND_PKG=CWSAI0033E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1055;&#1072;&#1082;&#1077;&#1090; {0}, &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1084; {1}, &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0057E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_PASSED" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_PASSED=CWSAI0057E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1087;&#1088;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; Aries {0}. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1086;&#1090;&#1082;&#1072;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}.
  </MsgText>
  <Explanation>
    &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; Aries. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1086;&#1090;&#1082;&#1072;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    &#1047;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072;&#1084;. &#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1074;&#1089;&#1077; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080;.
  </UserResponse>
</Message>
<Message ID="CWSAI0051E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_STOP_ERROR" varFormat="Java">
    ARIES_APPLICATION_STOP_ERROR=CWSAI0051E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089;&#1088;&#1077;&#1076;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; Aries &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0046E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_REINSTALL_BUNDLES" varFormat="Java">
    COULD_NOT_REINSTALL_BUNDLES=CWSAI0046E: &#1042;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;: &#1055;&#1086;&#1089;&#1083;&#1077; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1086;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1054;&#1090;&#1082;&#1072;&#1090; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0041E" severity="E" prefix="yes">
  <MsgText pgmKey="BAD_BLUEPRINT_CONTAINER_FILTER" varFormat="Java">
    BAD_BLUEPRINT_CONTAINER_FILTER=CWSAI0041E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0003E" severity="E" prefix="yes">
  <MsgText pgmKey="FAILED_START_APPCONMSG0003" varFormat="Java">
    FAILED_START_APPCONMSG0003=CWSAI0003E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; {0}, &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;: {1}.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1091; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1090;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1089;&#1090;&#1077;&#1082;&#1072; &#1080; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;.
  </UserResponse>
</Message>
<Message ID="CWSAI0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_PKG_2" varFormat="Java">
    UNABLE_TO_FIND_PKG_2=CWSAI0034E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1055;&#1072;&#1082;&#1077;&#1090; {0}, &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1084; {1}, &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0048E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_QUIESCE_MANAGER" varFormat="Java">
    NO_QUIESCE_MANAGER=CWSAI0048E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; QuiesceManager.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0049E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_SERVICE_UNAVAILABLE" varFormat="Java">
    ARIES_SERVICE_UNAVAILABLE=CWSAI0049E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; &#1089;&#1088;&#1077;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; Aries &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    &#1057;&#1083;&#1091;&#1078;&#1073;&#1099; &#1089;&#1088;&#1077;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; Aries OSGi &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1099; &#1074; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1077; &#1089;&#1083;&#1091;&#1078;&#1073;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0053I" severity="I" prefix="yes">
  <MsgText pgmKey="NO_IN_PLACE_UPDATE_ISOLATION_CHANGES" varFormat="Java">
    NO_IN_PLACE_UPDATE_ISOLATION_CHANGES=CWSAI0053I: &#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; {0}/{1} &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1086;. &#1042; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1099; &#1089;&#1083;&#1091;&#1078;&#1073; &#1080;&#1079; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;.
  </MsgText>
  <Explanation>
    &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1077;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1089;&#1083;&#1091;&#1078;&#1073; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072;&#1084;&#1080; &#1080; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072;&#1084;&#1080;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1086;&#1084; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1086;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1072; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1085;&#1086;&#1074;&#1099;&#1077; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099;.
  </UserResponse>
</Message>
<Message ID="CWSAI0029E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_APP" varFormat="Java">
    UNABLE_TO_FIND_APP=CWSAI0029E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; {0} &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1086;, &#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0037W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_FILTER" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_FILTER=CWSAI0037W: &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; {0} &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; &#1089; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; {1}. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088; {2} &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1080; &#1089;&#1088;&#1077;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1101;&#1090;&#1091; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;.
  </MsgText>
  <Explanation>
    &#1044;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; OSGi, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1089;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073; &#1077;&#1097;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;-&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;.
  </UserResponse>
</Message>
<Message ID="CWSAI0012E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0012" varFormat="Java">
    ARIES_APP_CONMSG0012=CWSAI0012E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1054;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; {0} &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0011E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0011" varFormat="Java">
    ARIES_APP_CONMSG0011=CWSAI0011E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; {0} &#1074; {1} &#1080;&#1079;-&#1079;&#1072; &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1086;&#1074;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0010E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0010" varFormat="Java">
    ARIES_APP_CONMSG0010=CWSAI0010E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; {0} &#1074; &#1082;&#1072;&#1088;&#1090;&#1091; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; {1} &#1080;&#1079;-&#1079;&#1072; &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1086;&#1074;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0036E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_UNINSTALL_ERROR" varFormat="Java">
    BUNDLE_UNINSTALL_ERROR=CWSAI0036E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {0}, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0043E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_FRAMEWORK_UNINSTALL_ERROR" varFormat="Java">
    BUNDLE_FRAMEWORK_UNINSTALL_ERROR=CWSAI0043E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1055;&#1088;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;. &#1053;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088; &#1089;&#1088;&#1077;&#1076;&#1099; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0009E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0009" varFormat="Java">
    ARIES_APP_CONMSG0009=CWSAI0009E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1089; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0007E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0007" varFormat="Java">
    ARIES_APP_CONMSG0007=CWSAI0007E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0} &#1074; &#1089;&#1088;&#1077;&#1076;&#1091; OSGi. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0002E" severity="E" prefix="yes">
  <MsgText pgmKey="FAILED_INSTALL_APPCONMSG0002" varFormat="Java">
    FAILED_INSTALL_APPCONMSG0002=CWSAI0002E: &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0} &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; OSGi, &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;: {1}.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1074; &#1089;&#1088;&#1077;&#1076;&#1091; OSGi &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1091; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;.
  </UserResponse>
</Message>
<Message ID="CWSAI0028E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_APP_UPDATE" varFormat="Java">
    INVALID_APP_UPDATE=CWSAI0028E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; {0}, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1086; &#1085;&#1077; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1086;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1091;&#1078;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1080;&#1079;-&#1079;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.
  </MsgText>
  <Explanation>
    &#1054;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;. &#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1085;&#1077;&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1089;&#1073;&#1086;&#1103;&#1093; &#1074; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;.
  </UserResponse>
</Message>
<Message ID="CWSAI0023E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0003" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0003=CWSAI0023E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1087;&#1088;&#1072;&#1074;&#1072;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1073;&#1099;&#1083;&#1072; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0022E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0002" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0002=CWSAI0022E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091; &#1087;&#1088;&#1072;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; {0} &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}
  </MsgText>
  <Explanation>
    &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1072;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;.
  </Explanation>
  <UserResponse>
    &#1057;&#1084;. &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1087;&#1088;&#1072;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1083;&#1080; &#1086;&#1085;.
  </UserResponse>
</Message>
<Message ID="CWSAI0021E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0001" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0001=CWSAI0021E: &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1072;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; {0} &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;.
  </MsgText>
  <Explanation>
    &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1072;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1072;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1080; &#1077;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;.
  </UserResponse>
</Message>
<Message ID="CWSAI0025E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_UNREGISTRATION_FAILURE0001" varFormat="Java">
    MBEAN_UNREGISTRATION_FAILURE0001=CWSAI0025E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; JMX MBeans &#1076;&#1083;&#1103; {0}. &#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1086;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1072; &#1087;&#1088;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; JMX MBeans. &#1069;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0054I" severity="I" prefix="yes">
  <MsgText pgmKey="IN_PLACE_UPDATE_WITH_REFRESH" varFormat="Java">
    IN_PLACE_UPDATE_WITH_REFRESH=CWSAI0054I: &#1042; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0}/{1} &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1080; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;: {2}
  </MsgText>
  <Explanation>
    &#1044;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;, &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1087;&#1088;&#1103;&#1084;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1083;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; Require-Bundle &#1086;&#1090; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;.
  </Explanation>
  <UserResponse>
    &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1091;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090;&#1091; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090; &#1085;&#1072; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; Require-Bundle, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1080;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1080;&#1079; &#1095;&#1080;&#1089;&#1083;&#1072; &#1090;&#1077;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;.
  </UserResponse>
</Message>
<Message ID="CWSAI0039W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_LIST_FILTER" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_LIST_FILTER=CWSAI0039W: &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; {0} &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; &#1089; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; {1}. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088; {2} &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1080; &#1089;&#1088;&#1077;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1101;&#1090;&#1091; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;.
  </MsgText>
  <Explanation>
    &#1044;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; OSGi, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1089;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073; &#1077;&#1097;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;-&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;.
  </UserResponse>
</Message>
<Message ID="CWSAI0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_SERVICE_UNAVAILABLE0001" varFormat="Java">
    MBEAN_SERVICE_UNAVAILABLE0001=CWSAI0026E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; JMX MBeans &#1076;&#1083;&#1103; {0}, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; MBeanServer &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1081;&#1090;&#1080; MBeanServer &#1074; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1077; &#1089;&#1083;&#1091;&#1078;&#1073; OSGi. &#1053;&#1077;&#1083;&#1100;&#1079;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; OSGi &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0020E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0003" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0003=CWSAI0020E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0019E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0002" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0002=CWSAI0019E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073; {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0018E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0001" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0001=CWSAI0018E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1086;&#1073;&#1097;&#1080;&#1081; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1089;&#1088;&#1077;&#1076;&#1099; {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0042E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_BLUEPRINTS" varFormat="Java">
    TOO_MANY_BLUEPRINTS=CWSAI0042E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1081;&#1090;&#1080; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_APP_STOP" varFormat="Java">
    INVALID_APP_STOP=CWSAI0027E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; {0}. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1091;&#1078;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1080;&#1079;-&#1079;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.
  </MsgText>
  <Explanation>
    &#1054;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1091;&#1078;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;. &#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1085;&#1077;&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091;. &#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1089;&#1073;&#1086;&#1103;&#1093; &#1074; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;.
  </UserResponse>
</Message>
<Message ID="CWSAI0030E" severity="E" prefix="yes">
  <MsgText pgmKey="ERROR_FINDING_SERVICES" varFormat="Java">
    ERROR_FINDING_SERVICES=CWSAI0030E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1048;&#1084;&#1087;&#1086;&#1088;&#1090;&#1099; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; {0} &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1099;, &#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088;: {1}.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1085;&#1077;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0001E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_URL_APPCONMSG0001" varFormat="Java">
    NO_URL_APPCONMSG0001=CWSAI0001E: &#1053;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; {0}.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1085;&#1077; &#1073;&#1099;&#1083; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.
  </Explanation>
  <UserResponse>
    &#1047;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; BundleCacheManager MBean &#1080;&#1083;&#1080; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;.
  </UserResponse>
</Message>
<Message ID="CWSAI0038W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_FILTER_ID" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_FILTER_ID=CWSAI0038W: &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; {0} &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1089; &#1048;&#1044; {1}. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088; {2} &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1080; &#1089;&#1088;&#1077;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1101;&#1090;&#1091; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;.
  </MsgText>
  <Explanation>
    &#1044;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; OSGi, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1089;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073; &#1077;&#1097;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1099;, &#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1072;.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;-&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;.
  </UserResponse>
</Message>
<Message ID="CWSAI0055E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_STARTING" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_STARTING=CWSAI0055E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; Aries {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}.
  </MsgText>
  <Explanation>
    &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; Aries. &#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1093;&#1086;&#1076;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;.
  </Explanation>
  <UserResponse>
    &#1047;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072;&#1084;. &#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1074;&#1089;&#1077; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
