<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.launcher/src/com/ibm/ws/eba/launcher/messages/CWSAAMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAA0036E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0036E" varFormat="Java">
    CWSAA0036E=CWSAA0036E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0020E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0020E" varFormat="Java">
    CWSAA0020E=CWSAA0020E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1076;&#1083;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; {0} &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; {1}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0026E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0026E" varFormat="Java">
    CWSAA0026E=CWSAA0026E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; &#1080;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; {0} &#1074; ClassLoader {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0010E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0010E" varFormat="Java">
    CWSAA0010E=CWSAA0010E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; EBALauncher {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0016E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0016E" varFormat="Java">
    CWSAA0016E=CWSAA0016E: &#1042;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;: {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0035E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0035W" varFormat="Java">
    CWSAA0035W=CWSAA0035E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; {0} &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0006W" severity="W" prefix="yes">
  <MsgText pgmKey="CWSAA0006E" varFormat="Java">
    CWSAA0006E=CWSAA0006W: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; EBA {0}, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; EBALauncher.properties, &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; EBALauncher.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0025E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0025E" varFormat="Java">
    CWSAA0025E=CWSAA0025E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1083;&#1091;&#1078;&#1073;&#1072; OSGi PackageAdmin &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0015E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0015E" varFormat="Java">
    CWSAA0015E=CWSAA0015E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0005E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0005E" varFormat="Java">
    CWSAA0005E=CWSAA0005E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085; &#1092;&#1072;&#1081;&#1083; JAR &#1089;&#1088;&#1077;&#1076;&#1099; OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0024E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0024E" varFormat="Java">
    CWSAA0024E=CWSAA0024E: &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; {0} &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; {1}, &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;: {2} - {3}
  </MsgText>
  <Explanation>
    &#1057;&#1083;&#1091;&#1078;&#1073;&#1072; &#1076;&#1083;&#1103; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1085;&#1086; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074;.
  </Explanation>
  <UserResponse>
    &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1083;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;.
  </UserResponse>
</Message>
<Message ID="CWSAA0004E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0004E" varFormat="Java">
    CWSAA0004E=CWSAA0004E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; EBA OSGi. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0033E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0033E" varFormat="Java">
    CWSAA0033E=CWSAA0033E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; VariableMap &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0039E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0039E" varFormat="Java">
    CWSAA0039E=CWSAA0039E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1076;&#1083;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0023E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0023E" varFormat="Java">
    CWSAA0023E=CWSAA0023E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1080; &#1089;&#1083;&#1091;&#1078;&#1073;: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0029E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0029E" varFormat="Java">
    CWSAA0029E=CWSAA0029E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; BundleContext &#1080;&#1079; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {0} &#1076;&#1083;&#1103; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0019E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0019E" varFormat="Java">
    CWSAA0019E=CWSAA0019E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; {0} &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; {1}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0003E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0003E" varFormat="Java">
    CWSAA0003E=CWSAA0003E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; URL &#1080;&#1079; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0009E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0009E" varFormat="Java">
    CWSAA0009E=CWSAA0009E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; OSGi. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0032E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0032E" varFormat="Java">
    CWSAA0032E=CWSAA0032E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; {0} &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0038E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0038E" varFormat="Java">
    CWSAA0038E=CWSAA0038E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; WebSphere MBeanServer.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0022E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0022E" varFormat="Java">
    CWSAA0022E=CWSAA0022E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0028E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0028E" varFormat="Java">
    CWSAA0028E=CWSAA0028E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; WebSphere Application Server WAS_INSTALL_ROOT &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0018E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0018E" varFormat="Java">
    CWSAA0018E=CWSAA0018E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; {0} &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; {1}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0037W" severity="W" prefix="yes">
  <MsgText pgmKey="CWSAA0037W" varFormat="Java">
    CWSAA0037W=CWSAA0037W: &#1057;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1077; &#1080;&#1084;&#1103; JNDI: {0}.
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1072; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; JNDI, &#1085;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1078;&#1077; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1091;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085; &#1074; JNDI.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1085;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1072;&#1103; &#1083;&#1080; &#1101;&#1090;&#1086; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1090;&#1086;&#1090; &#1078;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; JNDI; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072;&#1084;&#1080; OSGi &#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;, &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; JNDI. &#1055;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; IBM.
  </UserResponse>
</Message>
<Message ID="CWSAA0002E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0002E" varFormat="Java">
    CWSAA0002E=CWSAA0002E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; OSGi. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0008E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0008E" varFormat="Java">
    CWSAA0008E=CWSAA0008E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1096;&#1083;&#1102;&#1079;&#1072;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0031E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0031E" varFormat="Java">
    CWSAA0031E=CWSAA0031E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1083;&#1091;&#1078;&#1073;&#1072; PackageAdmin &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0021E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0021E" varFormat="Java">
    CWSAA0021E=CWSAA0021E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; {0} &#1080; &#1084;&#1077;&#1090;&#1086;&#1076; {1}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0027E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0027E" varFormat="Java">
    CWSAA0027E=CWSAA0027E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; {0}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0011E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0011E" varFormat="Java">
    CWSAA0011E=CWSAA0011E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1060;&#1072;&#1073;&#1088;&#1080;&#1082;&#1072; &#1089;&#1088;&#1077;&#1076;&#1099; OSGi {0} &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; jar &#1089;&#1088;&#1077;&#1076;&#1099; OSGi {1} &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0017E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0017E" varFormat="Java">
    CWSAA0017E=CWSAA0017E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1080;&#1087;&#1099; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; {0} &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; {1}. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;: {2}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0001E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0001E" varFormat="Java">
    CWSAA0001E=CWSAA0001E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1091; OSGi. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0007E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0007E" varFormat="Java">
    CWSAA0007E=CWSAA0007E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; OSGi {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA0030E" severity="E" prefix="yes">
  <MsgText pgmKey="CWSAA0030E" varFormat="Java">
    CWSAA0030E=CWSAA0030E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1050;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; {0} &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
