<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.blueprint.transform/src/com/ibm/ws/eba/blueprint/transform/messages/BPTRANSFORMmessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAA1002E" severity="E" prefix="yes">
  <MsgText pgmKey="BPTRANSFORM_TEMP_DIR_CREATE_FAILED" varFormat="Java">
    BPTRANSFORM_TEMP_DIR_CREATE_FAILED=CWSAA1002E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002.
  </UserResponse>
</Message>
<Message ID="CWSAA1004E" severity="E" prefix="yes">
  <MsgText pgmKey="ACTIVATOR_CANNOT_FIND_BLUEPRINT_BUNDLE" varFormat="Java">
    ACTIVATOR_CANNOT_FIND_BLUEPRINT_BUNDLE=CWSAA1004E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1081;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA1006E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_FILE_SYSTEM_SUPPORT" varFormat="Java">
    NO_FILE_SYSTEM_SUPPORT=CWSAA1006E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1088;&#1077;&#1076;&#1072; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA1003E" severity="E" prefix="yes">
  <MsgText pgmKey="ACTIVATOR_CANNOT_START_BLUEPRINT_BUNDLE" varFormat="Java">
    ACTIVATOR_CANNOT_START_BLUEPRINT_BUNDLE=CWSAA1003E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA1007E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_BLUEPRINT_OVERRIDE_DIRECTORY" varFormat="Java">
    UNABLE_TO_CREATE_BLUEPRINT_OVERRIDE_DIRECTORY=CWSAA1007E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAA1001E" severity="E" prefix="yes">
  <MsgText pgmKey="BPTRANSFORM_NO_DATA_FILE_SUPPORT" varFormat="Java">
    BPTRANSFORM_NO_DATA_FILE_SUPPORT=CWSAA1001E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002.
  </UserResponse>
</Message>
<Message ID="CWSAA1005E" severity="E" prefix="yes">
  <MsgText pgmKey="BLUEPRINT_XML_MULTIPLE_OUTPUT_STREAMS" varFormat="Java">
    BLUEPRINT_XML_MULTIPLE_OUTPUT_STREAMS=CWSAA1005E: &#1042;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; OutputStream &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084; &#1076;&#1083;&#1103; BlueprintXml.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
