<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1089;&#1083;&#1091;&#1078;&#1073;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; OSGi {0} &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; {1} &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080;, &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;&#1084; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1089;&#1083;&#1091;&#1078;&#1073;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: &#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; {0} &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1073;-&#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1077; {1} &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; {2}.
  </MsgText>
  <Explanation>
    &#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; OSGi JPA &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1058;&#1072;&#1082;&#1072;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1085;&#1077;&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;&#1084;.
  </Explanation>
  <UserResponse>
    &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; OSGi &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;&#1093; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;.
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: &#1042; &#1074;&#1077;&#1073;-&#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1077; OSGi {0} &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; {1} &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; JPA {2} &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;. &#1050;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1084; OSGi JPA.
  </MsgText>
  <Explanation>
    &#1042; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; JPA &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1077; OSGi JPA.
  </Explanation>
  <UserResponse>
    &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; &#1085;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;, &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1081; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1083;&#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;.
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1057;&#1088;&#1077;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; OSGi &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: &#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; {0} &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1086; &#1074; &#1074;&#1077;&#1073;-&#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1077; {1} &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; {2}.
  </MsgText>
  <Explanation>
    &#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; OSGi JPA &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1058;&#1072;&#1082;&#1072;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1085;&#1077;&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;&#1084;.
  </Explanation>
  <UserResponse>
    &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; OSGi &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;&#1093; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
