<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1052;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1088;&#1086;&#1074;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; Bundle-SymbolicName. &#1053;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;: {0}.
  </MsgText>
  <Explanation>
    &#1057;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1101;&#1089;&#1082;&#1080;&#1079;&#1072; &apos;&apos;{0}&apos;&apos; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089; &#1048;&#1044; {1}: {2}
  </MsgText>
  <Explanation>
    &#1055;&#1088;&#1080; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1048;&#1044; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; InvalidSyntaxException.
  </Explanation>
  <UserResponse>
    &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1048;&#1044;.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1052;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1088;&#1086;&#1074;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; Bundle-SymbolicName. &#1053;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;: {0}.
  </MsgText>
  <Explanation>
    &#1057;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1084;&#1077;&#1090;&#1072;-&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1052;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1088;&#1086;&#1074;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; Fragment-Host. &#1053;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;: {0}.
  </MsgText>
  <Explanation>
    &#1057;&#1088;&#1077;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1072; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1089; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; {0} &#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090;&#1072; {1}.
  </MsgText>
  <Explanation>
    &#1052;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; Bundle-SymbolicName &#1080; CompositeBundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    &#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; Bundle-SymbolicName &#1080; CompositeBundle-ManifestVersion &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090;&#1072;.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: &#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;. &#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1089; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; {0} &#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090;&#1072; {1}.
  </MsgText>
  <Explanation>
    &#1052;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; Bundle-SymbolicName &#1080; Bundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    &#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1086;&#1074; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; Bundle-SymbolicName &#1080; Bundle-ManifestVersion &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; &#1084;&#1072;&#1085;&#1080;&#1092;&#1077;&#1089;&#1090;&#1072;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
