<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.app.container.aries/src/com/ibm/ws/app/container/aries/messages/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAI0045E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_FIND_ALL_BUNDLES_TO_UPDATE" varFormat="Java">
    COULD_NOT_FIND_ALL_BUNDLES_TO_UPDATE=CWSAI0045E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49884;&#49828;&#53596;&#51060; &#50629;&#45936;&#51060;&#53944;&#54624; &#48516;&#47532;&#46108; &#47784;&#46304; Bundle&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WAITING_FOR_QUIESCE" varFormat="Java">
    EXCEPTION_WHILE_WAITING_FOR_QUIESCE=CWSAI0044E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#51068;&#49884;&#51221;&#51648;&#44032; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#46041;&#50504; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50696;&#50808;&#45716; {0}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0006E" severity="E" prefix="yes">
  <MsgText pgmKey="COMPOSITE_FAILED_START_APPCONMSG0006" varFormat="Java">
    COMPOSITE_FAILED_START_APPCONMSG0006=CWSAI0006E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48276;&#50948;&#44032; {0}&#51064; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48373;&#54633; Bundle&#51032; &#49436;&#48708;&#49828; &#44277;&#44060;&#51088;&#47484; &#54876;&#49457;&#54868;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0005E" severity="E" prefix="yes">
  <MsgText pgmKey="COMPOSITE_FAILED_START_APPCONMSG0005" varFormat="Java">
    COMPOSITE_FAILED_START_APPCONMSG0005=CWSAI0005E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48276;&#50948;&#44032; {0}&#51064; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48373;&#54633; Bundle&#51012; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_PACKAGE_ADMIN" varFormat="Java">
    NO_PACKAGE_ADMIN=CWSAI0035E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. PackageAdmin &#49436;&#48708;&#49828;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_RB" varFormat="Java">
    UNABLE_TO_FIND_RB=CWSAI0031E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {1} Bundle&#50640;&#49436; &#54596;&#50836;&#54620; {0} Bundle&#51012; &#52286;&#51012; &#49688; &#50630;&#50612;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; &#51333;&#49549; &#54637;&#47785;&#51012; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0032E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_RB_2" varFormat="Java">
    UNABLE_TO_FIND_RB_2=CWSAI0032E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {1} Bundle&#50640;&#49436; &#54596;&#50836;&#54620; {0} Bundle&#51012; &#52286;&#51012; &#49688; &#50630;&#50612;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; &#51333;&#49549; &#54637;&#47785;&#51012; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0047E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_INSTALL_UPDATES" varFormat="Java">
    COULD_NOT_INSTALL_UPDATES=CWSAI0047E: &#50629;&#45936;&#51060;&#53944; &#51312;&#51089;&#51004;&#47196; &#46020;&#51077;&#46112; &#54616;&#45208; &#51060;&#49345;&#51032; &#49352; Bundle&#51012; &#49444;&#52824;&#54616;&#45716; &#45936; &#49892;&#54056;&#54664;&#49845;&#45768;&#45796;. &#46384;&#46972;&#49436; &#50629;&#45936;&#51060;&#53944;&#44032; &#47204;&#48177;&#46121;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49352; Bundle&#51012; &#49444;&#52824;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#51060; &#50696;&#50808;&#45716; Bundle &#50724;&#47448; &#46608;&#45716; &#49884;&#49828;&#53596; &#50724;&#47448;&#47196; &#51064;&#54644; &#48156;&#49373;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47196;&#44536;&#50640;&#49436; &#51060;&#51204; &#50724;&#47448; &#48143; &#50696;&#50808;&#47484; &#44160;&#49324;&#54616;&#50668; Bundle &#49444;&#52824;&#44032; &#49892;&#54056;&#54620; &#51060;&#50976;&#47484; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#49352; Bundle&#51032; &#47928;&#51228;&#51216;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_EVENTHANDLERMSG0001" varFormat="Java">
    ARIES_APP_EVENTHANDLERMSG0001=CWSAI0014E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#44277;&#50976; Bundle &#54532;&#47112;&#51076;&#50892;&#53356;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50696;&#50808;: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0017W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0003W" varFormat="Java">
    SERVICE_PUBLISHER0003W=CWSAI0017W: {0} &#49436;&#48708;&#49828;&#47484; &#49688;&#51221;&#54616;&#47140; &#54664;&#51004;&#45208; &#51060; &#49436;&#48708;&#49828;&#44032; &#46321;&#47197;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49436;&#48708;&#49828;&#47484; &#49688;&#51221;&#54616;&#47140;&#45716; &#49884;&#46020;&#44032; &#51080;&#50632;&#51004;&#45208; &#54644;&#45817; ID&#44032; &#49324;&#50857;&#46104;&#45716; &#49436;&#48708;&#49828;&#44032; &#46321;&#47197;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Service Reference&#51032; ID&#44032; &#50732;&#48148;&#47480;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0058E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_FAILED" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_FAILED=CWSAI0058E: Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}&#51012;(&#47484;) &#50629;&#45936;&#51060;&#53944;&#54616;&#45716; &#46041;&#50504; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50629;&#45936;&#51060;&#53944;&#47484; &#47204;&#48177;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50696;&#50808;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50629;&#45936;&#51060;&#53944;&#47484; &#47204;&#48177;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47196;&#44536;&#50640;&#49436; &#51060; &#47928;&#51228;&#51216;&#44284; &#44288;&#47144;&#46108; &#50724;&#47448;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;. &#51060; &#50724;&#47448;&#50752; &#50672;&#44288;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#47928;&#51228;&#51216;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0024E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_REGISTRATION_FAILURE0001" varFormat="Java">
    MBEAN_REGISTRATION_FAILURE0001=CWSAI0024E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0}&#50857; JMX MBean&#51012; &#46321;&#47197;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#49373;&#49457;&#46104;&#50632;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#52824;&#44032; &#44228;&#49549; &#51652;&#54665;&#46121;&#45768;&#45796;. &#50696;&#50808;: {1}
  </MsgText>
  <Explanation>
    JMX MBean&#51012; &#46321;&#47197;&#54616;&#45716; &#51473;&#50640; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. OSGi Application &#53080;&#49556; &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#54644;&#45817; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#48380; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#52824;&#50640;&#45716; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0050E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_START_ERROR" varFormat="Java">
    ARIES_APPLICATION_START_ERROR=CWSAI0050E: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#54532;&#47112;&#51076;&#50892;&#53356;&#47484; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0056E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_STOPPING" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_STOPPING=CWSAI0056E: Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}&#51012;(&#47484;) &#51473;&#51648;&#54616;&#45716; &#46041;&#50504; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50696;&#50808;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51473;&#51648;&#54616;&#45716; &#45936; &#47928;&#51228;&#51216;&#51060; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47196;&#44536;&#50640;&#49436; &#51060; &#47928;&#51228;&#51216;&#44284; &#44288;&#47144;&#46108; &#50724;&#47448;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;. &#51060; &#50724;&#47448;&#50752; &#50672;&#44288;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#47928;&#51228;&#51216;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0016W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0002W" varFormat="Java">
    SERVICE_PUBLISHER0002W=CWSAI0016W: {0} &#49436;&#48708;&#49828;&#47484; &#46321;&#47197; &#54644;&#51228;&#54616;&#47140; &#54664;&#51004;&#45208; &#51060; &#49436;&#48708;&#49828;&#44032; &#46321;&#47197;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49436;&#48708;&#49828;&#47484; &#46321;&#47197; &#54644;&#51228;&#54616;&#47140;&#45716; &#49884;&#46020;&#44032; &#51080;&#50632;&#51004;&#45208; &#54644;&#45817; ID&#44032; &#49324;&#50857;&#46104;&#45716; &#49436;&#48708;&#49828;&#44032; &#46321;&#47197;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Service Reference&#51032; ID&#44032; &#50732;&#48148;&#47480;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0052E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_UPDATE_ERROR" varFormat="Java">
    ARIES_APPLICATION_UPDATE_ERROR=CWSAI0052E: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#54532;&#47112;&#51076;&#50892;&#53356;&#47484; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0040W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_LIST_FILTER_ID" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_LIST_FILTER_ID=CWSAI0040W: Blueprint Bundle {0}&#50640; ID&#44032; {1}&#51064; &#52280;&#51312; &#47785;&#47197;&#51060; &#51080;&#49845;&#45768;&#45796;. &#51060; &#52280;&#51312; &#47785;&#47197;&#51032; &#54596;&#53552; {2}&#51060;(&#44032;) &#50976;&#54952;&#54616;&#51648; &#50506;&#51004;&#48064;&#47196; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#51060; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44277;&#50976; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596; &#51088;&#50896;&#51012; &#51200;&#51109;&#54616;&#44592; &#50948;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#45908; &#51060;&#49345; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44277;&#50976; OSGi Bundle&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;. &#49324;&#50857; &#51473;&#51064; Bundle&#51012; &#54032;&#48324;&#54616;&#44592; &#50948;&#54644; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#49436;&#48708;&#49828; &#51333;&#49549;&#49457;&#51012; &#48516;&#49437;&#54633;&#45768;&#45796;. &#54644;&#45817; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864; &#51068;&#48512; &#44277;&#50976; Bundle&#50640;&#49436; &#49324;&#50857; &#51473;&#51064; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44221;&#50864;&#50640;&#46020; &#54644;&#45817; Bundle&#51060; &#51228;&#44144;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; Bundle&#51060; &#51228;&#44144;&#46104;&#47732; &#51068;&#48512; &#44277;&#50976; Bundle&#51060; &#45908; &#51060;&#49345; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#51648; &#50506;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    bundle&#51060;&#46972;&#45716; &#51060;&#47492;&#51032; &#48660;&#47336;&#54532;&#47536;&#53944; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#54869;&#51064;&#54616;&#44256; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#54596;&#53552;&#50640;&#49436; &#50732;&#48148;&#47480; &#44396;&#47928;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0015W" severity="W" prefix="yes">
  <MsgText pgmKey="SERVICE_PUBLISHER0001W" varFormat="Java">
    SERVICE_PUBLISHER0001W=CWSAI0015W: {0} &#49436;&#48708;&#49828;&#44032; &#51060;&#48120; &#46321;&#47197;&#46104;&#50632;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51060;&#48120; &#46321;&#47197;&#46108; &#49436;&#48708;&#49828;&#47484; &#46321;&#47197;&#54616;&#47140; &#54664;&#49845;&#45768;&#45796;. &#49352;&#47196;&#50868; &#46321;&#47197;&#51012; &#47924;&#49884;&#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49352;&#47196;&#50868; &#46321;&#47197;&#51060; &#44592;&#51316; &#46321;&#47197;&#48372;&#45796; &#50864;&#49440;&#54616;&#45716; &#44221;&#50864; &#44592;&#51316; &#46321;&#47197;&#51012; &#46321;&#47197; &#54644;&#51228;&#54616;&#44144;&#45208; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0033E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_PKG" varFormat="Java">
    UNABLE_TO_FIND_PKG=CWSAI0033E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {1} Bundle&#50640;&#49436; &#44032;&#51256;&#50728; {0} &#54056;&#53412;&#51648;&#47484; &#52286;&#51012; &#49688; &#50630;&#50612;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; &#51333;&#49549; &#54637;&#47785;&#51012; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0057E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_PASSED" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_UPDATING_ROLLBACK_PASSED=CWSAI0057E: Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}&#51012;(&#47484;) &#50629;&#45936;&#51060;&#53944;&#54616;&#45716; &#46041;&#50504; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50629;&#45936;&#51060;&#53944;&#44032; &#47204;&#48177;&#46121;&#45768;&#45796;. &#50696;&#50808;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50629;&#45936;&#51060;&#53944;&#44032; &#47204;&#48177;&#46121;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47196;&#44536;&#50640;&#49436; &#51060; &#47928;&#51228;&#51216;&#44284; &#44288;&#47144;&#46108; &#50724;&#47448;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;. &#51060; &#50724;&#47448;&#50752; &#50672;&#44288;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#47928;&#51228;&#51216;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0051E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_STOP_ERROR" varFormat="Java">
    ARIES_APPLICATION_STOP_ERROR=CWSAI0051E: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#54532;&#47112;&#51076;&#50892;&#53356;&#47484; &#51473;&#51648;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0046E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_REINSTALL_BUNDLES" varFormat="Java">
    COULD_NOT_REINSTALL_BUNDLES=CWSAI0046E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49352; Bundle &#48260;&#51204;&#51032; &#45796;&#50868;&#47196;&#46300;&#44032; &#49892;&#54056;&#54620; &#54980; &#49884;&#49828;&#53596;&#51060; &#51060;&#51204; Bundle &#48260;&#51204;&#51012; &#47784;&#46160; &#48373;&#44480;&#49884;&#53420; &#49688; &#50630;&#49845;&#45768;&#45796;. &#47204;&#48177;&#50640; &#49892;&#54056;&#54664;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0041E" severity="E" prefix="yes">
  <MsgText pgmKey="BAD_BLUEPRINT_CONTAINER_FILTER" varFormat="Java">
    BAD_BLUEPRINT_CONTAINER_FILTER=CWSAI0041E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} Bundle&#51032; &#51333;&#49549; &#54637;&#47785;&#51012; &#48516;&#49437;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50696;&#50808;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0003E" severity="E" prefix="yes">
  <MsgText pgmKey="FAILED_START_APPCONMSG0003" varFormat="Java">
    FAILED_START_APPCONMSG0003=CWSAI0003E: {1}(&#51004;)&#47196; &#51064;&#54644; {0} Bundle&#51012; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Bundle&#51012; &#49884;&#51089;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51204;&#52404; &#49828;&#53469; &#52628;&#51201;&#51008; &#54364;&#51456; &#50724;&#47448; &#52636;&#47141; &#47196;&#44536;&#47484; &#52280;&#51312;&#54616;&#50668; &#54644;&#45817; &#50696;&#50808;&#47484; &#54644;&#44208;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_PKG_2" varFormat="Java">
    UNABLE_TO_FIND_PKG_2=CWSAI0034E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {1} Bundle&#50640;&#49436; &#44032;&#51256;&#50728; {0} &#54056;&#53412;&#51648;&#47484; &#52286;&#51012; &#49688; &#50630;&#50612;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; &#51333;&#49549; &#54637;&#47785;&#51012; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0048E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_QUIESCE_MANAGER" varFormat="Java">
    NO_QUIESCE_MANAGER=CWSAI0048E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. QuiesceManager &#49436;&#48708;&#49828;&#47484; &#44032;&#51256;&#50732; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0049E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_SERVICE_UNAVAILABLE" varFormat="Java">
    ARIES_SERVICE_UNAVAILABLE=CWSAI0049E: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; Aries &#47088;&#53440;&#51076; &#49436;&#48708;&#49828;&#47484; &#44032;&#51256;&#50732; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49436;&#48708;&#49828; &#47112;&#51648;&#49828;&#53944;&#47532;&#50640;&#49436; Aries OSGi &#47088;&#53440;&#51076; &#49436;&#48708;&#49828;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0053I" severity="I" prefix="yes">
  <MsgText pgmKey="NO_IN_PLACE_UPDATE_ISOLATION_CHANGES" varFormat="Java">
    NO_IN_PLACE_UPDATE_ISOLATION_CHANGES=CWSAI0053I: {0}/{1} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51004;&#47196; &#50629;&#45936;&#51060;&#53944;&#54616;&#47732; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#45796;&#49884; &#49884;&#51089;&#46121;&#45768;&#45796;. &#50629;&#45936;&#51060;&#53944;&#54616;&#47140;&#47732; &#44277;&#50976; Bundle &#44277;&#44036;&#50640;&#49436; &#44032;&#51256;&#50728; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#54056;&#53412;&#51648; &#46608;&#45716; &#49436;&#48708;&#49828;&#47484; &#48320;&#44221;&#54644;&#50556; &#54616;&#44592; &#46412;&#47928;&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45824;&#54620; &#53945;&#51221; &#50629;&#45936;&#51060;&#53944;&#45716; &#48148;&#47196; &#51201;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#53945;&#55176; &#49352;&#47196; &#54532;&#47196;&#48708;&#51200;&#45789;&#46108; &#54056;&#53412;&#51648; &#46608;&#45716; &#49436;&#48708;&#49828;&#51032; &#44221;&#50864; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#50756;&#51204;&#55176; &#45796;&#49884; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49352; &#54056;&#53412;&#51648; &#46608;&#45716; &#49436;&#48708;&#49828;&#44032; &#54596;&#50836;&#54620; &#48320;&#44221;&#49324;&#54637;&#51012; &#54032;&#48324;&#54616;&#47140;&#47732; &#50629;&#45936;&#51060;&#53944;&#46108; Bundle&#51032; Bundle Manifest&#50640;&#49436; &#49352;&#47196; &#44032;&#51256;&#50728; &#54056;&#53412;&#51648;&#45208; &#45796;&#47480; &#48260;&#51204; &#48276;&#50948;&#50640;&#49436; &#44032;&#51256;&#50728; &#54056;&#53412;&#51648;&#44032; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#46608;&#54620; &#49352; &#49436;&#48708;&#49828; &#52280;&#51312;&#47484; &#50948;&#54620; Blueprint &#46356;&#49828;&#53356;&#47549;&#53552;&#44032; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0029E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_FIND_APP" varFormat="Java">
    UNABLE_TO_FIND_APP=CWSAI0029E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#52286;&#51012; &#49688; &#50630;&#50612;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; &#51333;&#49549; &#54637;&#47785;&#51012; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0037W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_FILTER" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_FILTER=CWSAI0037W: &#48660;&#47336;&#54532;&#47536;&#53944; Bundle {0}&#50640; {1} &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52280;&#51312;&#44032; &#51080;&#49845;&#45768;&#45796;. &#51060; &#52280;&#51312;&#51032; &#54596;&#53552; {2}&#51060;(&#44032;) &#50976;&#54952;&#54616;&#51648; &#50506;&#51004;&#48064;&#47196; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#51060; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44277;&#50976; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596; &#51088;&#50896;&#51012; &#51200;&#51109;&#54616;&#44592; &#50948;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#45908; &#51060;&#49345; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44277;&#50976; OSGi Bundle&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;. &#49324;&#50857; &#51473;&#51064; Bundle&#51012; &#54032;&#48324;&#54616;&#44592; &#50948;&#54644; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#49436;&#48708;&#49828; &#51333;&#49549;&#49457;&#51012; &#48516;&#49437;&#54633;&#45768;&#45796;. &#54644;&#45817; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864; &#51068;&#48512; &#44277;&#50976; Bundle&#50640;&#49436; &#49324;&#50857; &#51473;&#51064; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44221;&#50864;&#50640;&#46020; &#54644;&#45817; Bundle&#51060; &#51228;&#44144;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; Bundle&#51060; &#51228;&#44144;&#46104;&#47732; &#51068;&#48512; &#44277;&#50976; Bundle&#51060; &#45908; &#51060;&#49345; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#51648; &#50506;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    bundle&#51060;&#46972;&#45716; &#51060;&#47492;&#51032; &#48660;&#47336;&#54532;&#47536;&#53944; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#54869;&#51064;&#54616;&#44256; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#54596;&#53552;&#50640;&#49436; &#50732;&#48148;&#47480; &#44396;&#47928;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0012E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0012" varFormat="Java">
    ARIES_APP_CONMSG0012=CWSAI0012E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#51312;&#51089;&#51060; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0011E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0011" varFormat="Java">
    ARIES_APP_CONMSG0011=CWSAI0011E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#52649;&#46028;&#47196; &#51064;&#54644; {1}&#51012;(&#47484;) &#53685;&#54620; &#44032;&#51256;&#50724;&#44592; &#54056;&#53412;&#51648; {0}&#51012;(&#47484;) &#48337;&#54633;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0010E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0010" varFormat="Java">
    ARIES_APP_CONMSG0010=CWSAI0010E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#52649;&#46028;&#47196; &#51064;&#54644; &#44208;&#44284; &#47605; {1}(&#51004;)&#47196; &#44032;&#51256;&#50724;&#44592; &#54056;&#53412;&#51648; {0}&#51012;(&#47484;) &#48337;&#54633;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0036E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_UNINSTALL_ERROR" varFormat="Java">
    BUNDLE_UNINSTALL_ERROR=CWSAI0036E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle {0}&#51012;(&#47484;) &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50696;&#50808;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0043E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_FRAMEWORK_UNINSTALL_ERROR" varFormat="Java">
    BUNDLE_FRAMEWORK_UNINSTALL_ERROR=CWSAI0043E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48264;&#46308;&#51012; &#51228;&#44144;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48264;&#46308; &#54532;&#47112;&#51076;&#50892;&#53356; &#44288;&#47532;&#51088;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0009E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0009" varFormat="Java">
    ARIES_APP_CONMSG0009=CWSAI0009E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48276;&#50948;&#44032; {0}&#51064; &#48373;&#54633; Bundle&#51032; &#44032;&#51256;&#50724;&#44592; &#54056;&#53412;&#51648;&#47484; &#44228;&#49328;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50696;&#50808;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0007E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_CONMSG0007" varFormat="Java">
    ARIES_APP_CONMSG0007=CWSAI0007E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48276;&#50948;&#44032; {0}&#51064; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48373;&#54633; Bundle&#51012; OSGi &#54532;&#47112;&#51076;&#50892;&#53356;&#50640; &#49444;&#52824;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50696;&#50808;: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0002E" severity="E" prefix="yes">
  <MsgText pgmKey="FAILED_INSTALL_APPCONMSG0002" varFormat="Java">
    FAILED_INSTALL_APPCONMSG0002=CWSAI0002E: {1}(&#51004;)&#47196; &#51064;&#54644; OSGi &#54532;&#47112;&#51076;&#50892;&#53356;&#50640; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Bundle {0}&#51012;(&#47484;) &#49444;&#52824;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    OSGi &#54532;&#47112;&#51076;&#50892;&#53356;&#47196; Bundle&#51012; &#49444;&#52824;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44592;&#51316; &#50696;&#50808;&#51032; &#50896;&#51064;&#51012; &#52286;&#51004;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0028E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_APP_UPDATE" varFormat="Java">
    INVALID_APP_UPDATE=CWSAI0028E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#49892;&#54665; &#51473;&#51060; &#50500;&#45768;&#44592; &#46412;&#47928;&#50640; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54616;&#45208; &#51060;&#49345;&#51032; &#50724;&#47448;&#47196; &#51064;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#51060;&#48120; &#51473;&#51648;&#46104;&#50632;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49436;&#48260; &#47196;&#44536;&#50640;&#49436; &#49464;&#48512;&#49324;&#54637;&#51012; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </MsgText>
  <Explanation>
    &#51473;&#51648;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45824;&#54620; &#50629;&#45936;&#51060;&#53944; &#50836;&#52397;&#51060; &#51080;&#50632;&#49845;&#45768;&#45796;. &#51060;&#51204;&#50640; &#49892;&#54056;&#54620; &#51473;&#51648; &#50836;&#52397;&#51060; &#50896;&#51064;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49436;&#48260; &#47196;&#44536;&#50640; &#51060;&#51204; &#49892;&#54056;&#50640; &#45824;&#54620; &#49464;&#48512;&#49324;&#54637;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#47484; &#45796;&#49884; &#49884;&#51089;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0023E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0003" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0003=CWSAI0023E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49324;&#50857; &#44428;&#54620; &#51221;&#48372;&#47484; &#46041;&#49884;&#50640; &#49688;&#51221;&#54664;&#51004;&#48064;&#47196; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0022E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0002" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0002=CWSAI0022E: &#49324;&#50857; &#44428;&#54620; &#54028;&#51068; {0}&#50640; &#50529;&#49464;&#49828;&#54616;&#50668; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50696;&#50808;: {1}
  </MsgText>
  <Explanation>
    &#49324;&#50857; &#44428;&#54620; &#54028;&#51068;&#51032; &#52968;&#53584;&#52768;&#50640; &#50529;&#49464;&#49828;&#54616;&#50668; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50696;&#50808;&#51032; &#51221;&#48372;&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#49324;&#50857; &#44428;&#54620; &#54028;&#51068;&#51060; &#51080;&#44256; &#51060; &#54028;&#51068;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0021E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_JAVA2SECURITY0001" varFormat="Java">
    ARIES_APP_JAVA2SECURITY0001=CWSAI0021E: &#49324;&#50857; &#44428;&#54620; &#54028;&#51068; {0}&#51032; &#54805;&#49885;&#51004;&#47196; &#51064;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857; &#44428;&#54620; &#54028;&#51068;&#51032; &#54805;&#49885;&#51060; &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49324;&#50857; &#44428;&#54620; &#54028;&#51068;&#51032; &#52968;&#53584;&#52768;&#44032; &#50732;&#48148;&#47476;&#44256; &#51201;&#51208;&#55176; &#54805;&#49885;&#54868;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0025E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_UNREGISTRATION_FAILURE0001" varFormat="Java">
    MBEAN_UNREGISTRATION_FAILURE0001=CWSAI0025E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0}&#50857; JMX MBean&#51032; &#46321;&#47197;&#51012; &#54644;&#51228;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#49373;&#49457;&#46104;&#50632;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#52824; &#51228;&#44144;&#44032; &#44228;&#49549; &#51652;&#54665;&#46121;&#45768;&#45796;. &#50696;&#50808;: {1}
  </MsgText>
  <Explanation>
    JMX MBean&#51032; &#46321;&#47197;&#51012; &#54644;&#51228;&#54616;&#45716; &#51473;&#50640; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#52824; &#51228;&#44144;&#50640;&#45716; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0054I" severity="I" prefix="yes">
  <MsgText pgmKey="IN_PLACE_UPDATE_WITH_REFRESH" varFormat="Java">
    IN_PLACE_UPDATE_WITH_REFRESH=CWSAI0054I: &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}/{1}&#50640; &#45824;&#54620; &#50629;&#45936;&#51060;&#53944; &#51312;&#51089; &#51473;&#50640; {2} Bundle&#51060; &#45824;&#44592;&#50676;&#50640; &#45459;&#50668; &#45796;&#49884; &#49884;&#51089;&#46121;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50629;&#45936;&#51060;&#53944; &#44284;&#51221;&#51032; &#51068;&#48512;&#47196;, &#49884;&#49828;&#53596;&#51008; &#50629;&#45936;&#51060;&#53944;&#46108; Bundle&#50640; &#45824;&#54644; &#51649;&#51217; &#46608;&#45716; &#44036;&#51217; &#54056;&#53412;&#51648; &#51333;&#49549;&#49457;&#51060; &#51080;&#44144;&#45208; Require-Bundle &#51333;&#49549;&#49457;&#51060; &#51080;&#45716; Bundle&#51012; &#45796;&#49884; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Bundle&#51012; &#45796;&#49884; &#49884;&#51089;&#54644;&#50556; &#54616;&#45716; &#51060;&#50976;&#47484; &#54032;&#48324;&#54616;&#47140;&#47732; &#54644;&#45817; Bundle Manifest&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;. &#50629;&#45936;&#51060;&#53944;&#46108; Bundle &#51473; &#54616;&#45208;&#47484; &#49324;&#50857;&#54616;&#44144;&#45208; &#45796;&#49884; &#49884;&#51089;&#54624; Bundle &#49464;&#53944;&#51032; &#51068;&#48512;&#51064; &#45796;&#47480; Bundle&#51012; &#49324;&#50857;&#54616;&#45716; Require-Bundle &#54756;&#45908; &#46608;&#45716; &#44032;&#51256;&#50728; &#54056;&#53412;&#51648;&#47484; &#52286;&#51004;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0039W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_LIST_FILTER" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_LIST_FILTER=CWSAI0039W: &#48660;&#47336;&#54532;&#47536;&#53944; Bundle {0}&#50640; {1} &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52280;&#51312; &#47785;&#47197;&#51060; &#51080;&#49845;&#45768;&#45796;. &#51060; &#52280;&#51312; &#47785;&#47197;&#51032; &#54596;&#53552; {2}&#51060;(&#44032;) &#50976;&#54952;&#54616;&#51648; &#50506;&#51004;&#48064;&#47196; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#51060; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44277;&#50976; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596; &#51088;&#50896;&#51012; &#51200;&#51109;&#54616;&#44592; &#50948;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#45908; &#51060;&#49345; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44277;&#50976; OSGi Bundle&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;. &#49324;&#50857; &#51473;&#51064; Bundle&#51012; &#54032;&#48324;&#54616;&#44592; &#50948;&#54644; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#49436;&#48708;&#49828; &#51333;&#49549;&#49457;&#51012; &#48516;&#49437;&#54633;&#45768;&#45796;. &#54644;&#45817; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864; &#51068;&#48512; &#44277;&#50976; Bundle&#50640;&#49436; &#49324;&#50857; &#51473;&#51064; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44221;&#50864;&#50640;&#46020; &#54644;&#45817; Bundle&#51060; &#51228;&#44144;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; Bundle&#51060; &#51228;&#44144;&#46104;&#47732; &#51068;&#48512; &#44277;&#50976; Bundle&#51060; &#45908; &#51060;&#49345; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#51648; &#50506;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    bundle&#51060;&#46972;&#45716; &#51060;&#47492;&#51032; &#48660;&#47336;&#54532;&#47536;&#53944; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#54869;&#51064;&#54616;&#44256; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#54596;&#53552;&#50640;&#49436; &#50732;&#48148;&#47480; &#44396;&#47928;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MBEAN_SERVICE_UNAVAILABLE0001" varFormat="Java">
    MBEAN_SERVICE_UNAVAILABLE0001=CWSAI0026E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. MBeanServer&#47484; &#52286;&#51012; &#49688; &#50630;&#44592; &#46412;&#47928;&#50640; {0}&#50857; JMX MBean&#51012; &#46321;&#47197;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#52824;&#44032; &#44228;&#49549; &#51652;&#54665;&#46121;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    OSGi Service Registry&#50640;&#49436; MBeanServer&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;. OSGi Application &#53080;&#49556; &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#54644;&#45817; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#48380; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#52824;&#50640;&#45716; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0020E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0003" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0003=CWSAI0020E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#44277;&#50976; Bundle &#54532;&#47112;&#51076;&#50892;&#53356; {0}&#51012;(&#47484;) &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0019E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0002" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0002=CWSAI0019E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49436;&#48708;&#49828; &#44277;&#44060;&#51088; {0}&#51012;(&#47484;) &#54876;&#49457;&#54868;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0018E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APP_SHAREDFMWORK0001" varFormat="Java">
    ARIES_APP_SHAREDFMWORK0001=CWSAI0018E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#44277;&#50976; &#54532;&#47112;&#51076;&#50892;&#53356; &#48373;&#54633; Bundle {0}&#51012;(&#47484;) &#51089;&#49457;&#54616;&#44144;&#45208; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0042E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_BLUEPRINTS" varFormat="Java">
    TOO_MANY_BLUEPRINTS=CWSAI0042E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49884;&#49828;&#53596;&#51060; {0} Bundle&#50640; &#45824;&#54620; &#44256;&#50976; &#48660;&#47336;&#54532;&#47536;&#53944; &#52968;&#53580;&#51060;&#45320;&#47484; &#49885;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_APP_STOP" varFormat="Java">
    INVALID_APP_STOP=CWSAI0027E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51473;&#51648;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54616;&#45208; &#51060;&#49345;&#51032; &#50724;&#47448;&#47196; &#51064;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#51060;&#48120; &#51473;&#51648;&#46104;&#50632;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49436;&#48260; &#47196;&#44536;&#50640;&#49436; &#49464;&#48512;&#49324;&#54637;&#51012; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </MsgText>
  <Explanation>
    &#51060;&#48120; &#51473;&#51648;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45824;&#54644; &#51473;&#51648; &#50836;&#52397;&#51060; &#51080;&#50632;&#49845;&#45768;&#45796;. &#51060;&#51204;&#50640; &#49892;&#54056;&#54620; &#51473;&#51648; &#50836;&#52397;&#51060; &#50896;&#51064;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49436;&#48260; &#47196;&#44536;&#50640; &#51060;&#51204; &#49892;&#54056;&#50640; &#45824;&#54620; &#49464;&#48512;&#49324;&#54637;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#47484; &#45796;&#49884; &#49884;&#51089;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0030E" severity="E" prefix="yes">
  <MsgText pgmKey="ERROR_FINDING_SERVICES" varFormat="Java">
    ERROR_FINDING_SERVICES=CWSAI0030E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45824;&#54620; &#49436;&#48708;&#49828; &#44032;&#51256;&#50724;&#44592;&#47484; &#52286;&#51012; &#49688; &#50630;&#50612;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; &#51333;&#49549; &#54637;&#47785;&#51012; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54588;&#53552;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#46104;&#51648; &#50506;&#45716; &#44277;&#50976; Bundle&#51012; &#51228;&#44144;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#46412; &#47928;&#51228;&#51216;&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAI0001E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_URL_APPCONMSG0001" varFormat="Java">
    NO_URL_APPCONMSG0001=CWSAI0001E: {0} Bundle&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#49444;&#52824; &#51473; Bundle&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    BundleCacheManager MBean &#46608;&#45716; &#44288;&#47532; &#53080;&#49556;&#51012; &#49324;&#50857;&#54616;&#50668; Bundle&#51012; &#45796;&#50868;&#47196;&#46300;&#54616;&#46020;&#47197; &#50836;&#52397;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0038W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_BLUEPRINT_REFERENCE_FILTER_ID" varFormat="Java">
    INVALID_BLUEPRINT_REFERENCE_FILTER_ID=CWSAI0038W: Blueprint Bundle {0}&#50640; ID&#44032; {1}&#51064; &#52280;&#51312;&#44032; &#51080;&#49845;&#45768;&#45796;. &#51060; &#52280;&#51312;&#51032; &#54596;&#53552; {2}&#51060;(&#44032;) &#50976;&#54952;&#54616;&#51648; &#50506;&#51004;&#48064;&#47196; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#51060; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44277;&#50976; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596; &#51088;&#50896;&#51012; &#51200;&#51109;&#54616;&#44592; &#50948;&#54644; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#45908; &#51060;&#49345; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44277;&#50976; OSGi Bundle&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;. &#49324;&#50857; &#51473;&#51064; Bundle&#51012; &#54032;&#48324;&#54616;&#44592; &#50948;&#54644; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#49436;&#48708;&#49828; &#51333;&#49549;&#49457;&#51012; &#48516;&#49437;&#54633;&#45768;&#45796;. &#54644;&#45817; Bundle&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864; &#51068;&#48512; &#44277;&#50976; Bundle&#50640;&#49436; &#49324;&#50857; &#51473;&#51064; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#44221;&#50864;&#50640;&#46020; &#54644;&#45817; Bundle&#51060; &#51228;&#44144;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; Bundle&#51060; &#51228;&#44144;&#46104;&#47732; &#51068;&#48512; &#44277;&#50976; Bundle&#51060; &#45908; &#51060;&#49345; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#51648; &#50506;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    bundle&#51060;&#46972;&#45716; &#51060;&#47492;&#51032; &#48660;&#47336;&#54532;&#47536;&#53944; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#54869;&#51064;&#54616;&#44256; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#54596;&#53552;&#50640;&#49436; &#50732;&#48148;&#47480; &#44396;&#47928;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAI0055E" severity="E" prefix="yes">
  <MsgText pgmKey="ARIES_APPLICATION_USER_ERROR_STARTING" varFormat="Java">
    ARIES_APPLICATION_USER_ERROR_STARTING=CWSAI0055E: Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}&#51012;(&#47484;) &#49884;&#51089;&#54616;&#45716; &#46041;&#50504; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#50696;&#50808;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Aries &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54616;&#45208; &#51060;&#49345;&#51032; Bundle&#51012; &#54644;&#49437;&#54616;&#44144;&#45208; &#49884;&#51089;&#54616;&#45716; &#45936; &#49892;&#54056;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47196;&#44536;&#50640;&#49436; &#51060; &#47928;&#51228;&#51216;&#44284; &#44288;&#47144;&#46108; &#50724;&#47448;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;. &#51060; &#50724;&#47448;&#50752; &#50672;&#44288;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#47928;&#51228;&#51216;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
