<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: {0} &#51088;&#49328;&#51032; &#54644;&#49437;&#51008; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#52968;&#53584;&#52768;&#51032; &#44277;&#50976; &#52968;&#53584;&#52768;&#50640; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#51333;&#49549; &#54637;&#47785;&#51060; &#51080;&#51020;&#51012; &#54364;&#49884;&#54633;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48264;&#46308;&#51060; &#44277;&#50976; &#48264;&#46308;&#50640; &#54056;&#53412;&#51648; &#46608;&#45716; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#46608;&#54620; &#48264;&#46308;&#51012; &#44277;&#50976; &#48143; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48264;&#46308;&#47196; &#48176;&#52824;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48264;&#46308;&#50640; &#51333;&#49549;&#46108; &#44277;&#50976; &#48264;&#46308;&#51060; &#54596;&#50836;&#54620; &#48176;&#52824;&#45716; &#50976;&#54952;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#47784;&#46304; &#44277;&#50976; &#48264;&#46308;&#51012; &#54596;&#50836;&#47196; &#54616;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#44536;&#47084;&#54620; &#44221;&#50864; &#54644;&#45817; &#44277;&#50976; &#48264;&#46308;&#51060; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#52968;&#53584;&#52768;&#50640; &#51333;&#49549;&#46104;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: EBA &#54028;&#51068; {1}&#50640;&#49436; Jar &#54028;&#51068; {0}&#51032; &#48264;&#46308; Manifest&#47484; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#54028;&#51068;&#50640;&#49436; Jar &#54028;&#51068;&#51032; Manifest&#47484; &#52286;&#45716; &#51473;&#50640; IOException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#54028;&#51068;&#51060; &#49552;&#49345;&#46104;&#50632;&#44144;&#45208; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54028;&#51068;&#51032; &#49324;&#50857; &#44428;&#54620;&#51060; &#51201;&#51208;&#54616;&#44256; &#54805;&#49885;&#51060; &#50732;&#48148;&#47480;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#54532;&#47196;&#48708;&#51200;&#45320; &#49436;&#48708;&#49828; {0}&#51012;(&#47484;) &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: &#48708;&#51592;&#45768;&#49828; &#47112;&#48296; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#50640;&#49436; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; {0}&#50640; &#48176;&#52824;&#46108; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#49884;&#51089;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#51089; &#51312;&#51089; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53945;&#51221; &#47928;&#51228;&#51216;&#51012; &#51088;&#49464;&#55176; &#51652;&#45800;&#54616;&#47140;&#47732; &#51060; &#50696;&#50808; &#51060;&#51204;&#51032; &#49436;&#48260; &#47196;&#44536;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: EBA(Enterprise Bundle Archive) &#54028;&#51068; {1}&#50640; &#51648;&#50896;&#46104;&#51648; &#50506;&#45716; {0} &#46356;&#47113;&#53664;&#47532;&#44032; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; EBA &#54028;&#51068;&#50640; byValue &#46608;&#45716; byReference&#46972;&#45716; &#46356;&#47113;&#53664;&#47532;&#44032; &#51080;&#49845;&#45768;&#45796;. &#51060;&#47084;&#54620; &#46356;&#47113;&#53664;&#47532; &#51060;&#47492;&#51008; EBA &#54028;&#51068;&#51032; &#47336;&#53944; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54644;&#45817; &#46356;&#47113;&#53664;&#47532;&#47484; &#51228;&#44144;&#54616;&#44144;&#45208; &#51060;&#47492;&#51012; &#48148;&#44984;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: &#51648;&#51221;&#46108; &#50669;&#54624; {0}&#51060;(&#44032;) &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49324;&#50857;&#51088; &#46608;&#45716; &#44536;&#47353;&#51012; &#51316;&#51116;&#54616;&#51648; &#50506;&#45716; &#48372;&#50504; &#50669;&#54624;&#50640; &#47605;&#54609;&#54616;&#47140;&#44256; &#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; &#48372;&#50504; &#50669;&#54624;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#44144;&#45208; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#54644;&#45817; &#50669;&#54624;&#51012; &#51089;&#49457;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: &#44032;&#51256;&#50732; &#48176;&#52824; Manifest&#44032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#51032; &#50836;&#44396;&#49324;&#54637;&#51012; &#52649;&#51313;&#54616;&#51648; &#50506;&#44592; &#46412;&#47928;&#50640; {0} &#51088;&#49328;&#50640; &#50976;&#54952;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48176;&#52824; Manifest DEPLOYMENT.MF&#44032; asset&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest APPLICATION.MF&#50752; &#54840;&#54872; &#44032;&#45733;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49352; &#48176;&#52824; Manifest&#47484; &#44160;&#49324;&#54616;&#50668; &#45796;&#51020; &#45236;&#50857;&#51012; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. 
   1. DEPLOYMENT.MF &#54028;&#51068;&#51032; Application-SymbolicName &#48143; Application-Version&#51060; APPLICATION.MF &#54028;&#51068;&#51032; &#54644;&#45817; &#54637;&#47785;&#44284; &#51068;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;.
   2. DEPLOYMENT.MF &#54028;&#51068;&#51032; Deployed-Content &#54756;&#45908;&#50640; &#45208;&#50676;&#46108; &#48264;&#46308;&#51060; APPLICATION.MF &#54028;&#51068;&#51032; Application-Content &#54756;&#45908;&#50640; &#45208;&#50676;&#46108; &#48264;&#46308;&#44284; &#51068;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;.
   3. DEPLOYMENT.MF &#54028;&#51068;&#51032; Deployed-Content &#54756;&#45908;&#50640; &#51080;&#45716; &#48264;&#46308; &#48260;&#51204;&#51060; APPLICATION.MF &#54028;&#51068;&#50640; &#51080;&#45716; &#54644;&#45817; &#48264;&#46308;&#51032; &#48260;&#51204; &#48276;&#50948;&#50640; &#49549;&#54644;&#50556; &#54633;&#45768;&#45796;.
   4. DEPLOYMENT.MF &#54028;&#51068;&#51032; Deployed-Use-Bundle &#54756;&#45908;&#50640; &#45208;&#50676;&#46108; &#48264;&#46308;&#51060; APPLICATION.MF &#54028;&#51068;&#51032; Use-Bundle &#54756;&#45908;&#50640;&#46020; &#45208;&#50676;&#46104;&#50612;&#50556; &#54633;&#45768;&#45796;.
   5. DEPLOYMENT.MF &#54028;&#51068;&#51032; Deployed-Use-Bundle &#54756;&#45908;&#50640; &#51080;&#45716; &#48264;&#46308; &#48260;&#51204;&#51008; APPLICATION.MF &#54028;&#51068;&#51032; Use-Bundle &#54756;&#45908;&#50640; &#51080;&#45716; &#54644;&#45817; &#48264;&#46308;&#51032; &#48260;&#51204; &#48276;&#50948;&#50640; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. 
 &#48176;&#52824; Manifest&#47484; &#49688;&#46041;&#51004;&#47196; &#54200;&#51665;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#54596;&#50836;&#54620; &#44221;&#50864; EBA&#50640;&#49436; &#48176;&#52824; Manifest&#47484; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. &#51060;&#47111;&#44172; &#54616;&#47732; EBA&#47484; &#44032;&#51256;&#50732; &#46412; &#49352; &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: &#49440;&#53469;&#46108; &#48264;&#46308; &#48260;&#51204;&#51012; &#54644;&#49437;&#54616;&#44144;&#45208; &#54840;&#54872;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596;&#51060; &#49440;&#53469;&#46108; &#48264;&#46308; &#48260;&#51204;&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#48264;&#46308;&#51032; &#51333;&#49549;&#49457;&#51060; &#45572;&#46973;&#46104;&#50632;&#44144;&#45208; &#54644;&#45817; &#48264;&#46308;&#51060; &#54840;&#54872;&#46112; &#49688; &#50630;&#44144;&#45208; &#51316;&#51116;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49440;&#53469;&#46108; &#51077;&#47141; &#48264;&#46308; &#49464;&#53944;&#47484; &#49688;&#51221;&#54616;&#50668; &#45796;&#49884; &#49884;&#46020;&#54616;&#49901;&#49884;&#50724;. &#44288;&#47532; &#53080;&#49556;&#51012; &#49324;&#50857;&#54616;&#50668; asset&#51032; &#49345;&#53468;&#47484; &#48372;&#44144;&#45208; &#48120;&#47532; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: {0} &#49324;&#50857;&#51088;&#45716; {1} &#50669;&#54624;&#50640; &#45824;&#54620; &#47605;&#54609;&#46108; &#49324;&#50857;&#51088; &#46608;&#45716; &#47605;&#54609;&#46108; &#44536;&#47353;&#51032; &#44396;&#49457;&#50896;&#51060; &#50500;&#45785;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#45716; &#48372;&#50504; &#50669;&#54624;&#50640; &#47605;&#54609;&#46108; &#49324;&#50857;&#51088;&#51060;&#44144;&#45208; &#48372;&#50504; &#50669;&#54624;&#50640; &#47605;&#54609;&#46108; &#44536;&#47353;&#51032; &#44396;&#49457;&#50896;&#51060;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#45716; &#51060; &#50836;&#44396;&#49324;&#54637;&#51012; &#47564;&#51313;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#44032; &#51648;&#51221;&#46108; &#50669;&#54624;&#51012; &#49688;&#54665;&#54624; &#49688; &#51080;&#46020;&#47197; &#49324;&#50857;&#51088;/&#44536;&#47353;&#50640; &#48372;&#50504; &#50669;&#54624; &#47605;&#54609;&#51012; &#44396;&#49457;&#54616;&#44144;&#45208; &#51060;&#48120; &#54596;&#49688; &#44428;&#54620;&#51060; &#51080;&#45716; &#45796;&#47480; &#49324;&#50857;&#51088;&#47484; &#51648;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; Application-Content&#50640; &#54616;&#45208; &#51060;&#49345;&#51032; CBA(Composite Bundle Archive) {1}&#51012;(&#47484;) &#54252;&#54632;&#54633;&#45768;&#45796;. WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack&#50640;&#49436; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CBA&#45716; WebSphere Application Server &#48260;&#51204; 8 &#51060;&#49345;&#51032; &#44221;&#50864; Application-Content&#50640;&#49436; &#51648;&#50896;&#46121;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51312;&#52824;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack&#50640;&#49436; &#49892;&#54665;&#46104;&#50612;&#50556; &#54616;&#45716; &#44221;&#50864; Application-Content&#50640; CBA&#44032; &#50630;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#45796;&#49884; &#51089;&#49457;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: EBA(Enterprise Bundle Archive) {0}&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#54028;&#51068;&#51012; &#51069;&#45716; &#51473;&#50640; IOException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#54028;&#51068;&#51060; &#50732;&#48148;&#47476;&#51648; &#50506;&#44144;&#45208; &#49552;&#49345;&#46104;&#50632;&#49845;&#45768;&#45796;. &#46608;&#45716; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#54028;&#51068;&#51012; &#51069;&#45716; &#51473;&#50640; IOException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#54028;&#51068;&#51060; &#50732;&#48148;&#47476;&#51648; &#50506;&#44144;&#45208; &#49552;&#49345;&#46104;&#50632;&#49845;&#45768;&#45796;. &#46608;&#45716; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#54028;&#51068;&#51064; APPLICATION.MF&#44032; Manifest &#54028;&#51068; &#49828;&#54169;&#51012; &#46384;&#47476;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#54805;&#49885;&#51008; &#50696;&#49345;&#46108; Plugin &#44396;&#49457; &#54028;&#51068; URI &#54805;&#49885;&#51060; &#50500;&#45785;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#51032; &#54532;&#47196;&#48708;&#51200;&#45789; &#51473;&#50640; &#47532;&#53556;&#46108; &#44208;&#44284;&#44032; &#51096;&#47803;&#46104;&#50632;&#49845;&#45768;&#45796;. &#52572;&#45824; &#48260;&#51204; {1}&#51060;(&#44032;) &#52572;&#49548; &#48260;&#51204; {2}&#44284;(&#50752;) &#46041;&#51068;&#54616;&#45796;&#44256; &#50696;&#49345;&#54664;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: &#49472;&#51032; &#47784;&#46304; &#45432;&#46300;&#50640; &#45824;&#54644; {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#54532;&#47196;&#48708;&#51200;&#45789;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; OSGi Application Feature Pack&#51012; &#49892;&#54665; &#51473;&#51064; &#48260;&#51204; 7 &#45432;&#46300;&#50640;&#47564; &#48176;&#52824;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#54644;&#49437; &#50724;&#47448;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#44032;&#51256;&#50724;&#45716; &#51473;&#51064; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack&#50640; &#45824;&#54644; &#49457;&#44277;&#51201;&#51004;&#47196; &#54532;&#47196;&#48708;&#51200;&#45789;&#46104;&#50632;&#51648;&#47564; WebSphere Application Server &#48260;&#51204; 8&#50640; &#45824;&#54644;&#49436;&#45716; &#54532;&#47196;&#48708;&#51200;&#45789;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51312;&#52824;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44536;&#47084;&#45208; &#51060; &#44221;&#44256;&#45716; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45320;&#47924; &#50628;&#44201;&#54620; &#48260;&#51204; &#50836;&#44396;&#49324;&#54637;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#48260;&#51204; 8 &#45432;&#46300;&#50640; &#45824;&#54644; &#48176;&#52824;&#54624; &#49688; &#51080;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49688;&#51221;&#54616;&#45716; &#45936; &#54644;&#49437; &#50724;&#47448;&#51032; &#51221;&#48372;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#51060;(&#44032;) Run As &#50669;&#54624;&#51012; &#51221;&#51032;&#54616;&#48064;&#47196; {0} &#45432;&#46300;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47784;&#46304; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; &#44057;&#51008; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#54624; &#49688; &#51080;&#50612;&#50556; &#54616;&#51648;&#47564; &#49352; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; Run As &#50669;&#54624;&#51060; &#51221;&#51032;&#46108; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51648;&#50896;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#54840;&#49828;&#53944;&#54616;&#46020;&#47197; &#48260;&#51204; 8 &#45432;&#46300;&#47484; &#49440;&#53469;&#54616;&#44144;&#45208;, &#45908; &#51060;&#49345; Run As &#50669;&#54624;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#44396;&#49457;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: {1} &#48260;&#51204;&#51064; {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#48176;&#52824; Manifest&#45716; &#46041;&#51068;&#54620; &#44592;&#54840; &#51060;&#47492; &#48143; &#48260;&#51204;&#51012; &#49324;&#50857;&#54616;&#45716; &#52968;&#53584;&#52768;&#47484; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51004;&#47196; &#45208;&#50676;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;, &#48264;&#46308; &#48143; &#52980;&#54252;&#51648;&#53944; &#48264;&#46308;&#51008; &#47784;&#46160; &#44057;&#51008; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#47484; &#44277;&#50976;&#54616;&#48064;&#47196; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#44033;&#44033; &#44256;&#50976; ID&#44032; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48176;&#52824;&#51032; &#50976;&#54952;&#49457;&#51012; &#44160;&#51613;&#54624; &#46412; &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#44284; &#44592;&#54840; &#51060;&#47492; &#48143; &#48260;&#51204;&#51060; &#44057;&#51008; &#48264;&#46308;&#50640; &#45824;&#54620; &#52280;&#51312;&#47484; &#48156;&#44204;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#44032; &#52649;&#46028;&#54616;&#51648; &#50506;&#46020;&#47197; &#48264;&#46308;, &#48373;&#54633; &#48264;&#46308; &#46608;&#45716; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#44592;&#54840; &#51060;&#47492;&#51012; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: {0} asset&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#48176;&#52824; &#49884; {2} &#54056;&#53412;&#51648;&#51032; &#44032;&#51256;&#50724;&#44592;&#50640; &#45824;&#54620; {1} &#49549;&#49457;&#51012; &#52649;&#51313;&#49884;&#53420; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    APPLICATION.MF&#51032; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308;&#51032; &#44221;&#50864; &#47784;&#46304; &#54056;&#53412;&#51648; &#44032;&#51256;&#50724;&#44592;&#50640; &#48176;&#52824; &#49884; &#52649;&#51313;&#49884;&#53420; &#49688; &#51080;&#45716; &#49549;&#49457;&#51060; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#47784;&#46304; &#48264;&#46308;&#50640; &#48176;&#52824; &#49884; &#52649;&#51313;&#49884;&#53420; &#49688; &#51080;&#45716; &#54056;&#53412;&#51648; &#44032;&#51256;&#50724;&#44592;&#44032; &#51080;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#54056;&#53412;&#51669; &#46608;&#45716; &#44396;&#49457;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0}&#51012;(&#47484;) &#54869;&#51109;&#54616;&#44592; &#50948;&#54644; &#54596;&#50836;&#54620; &#44396;&#49457; &#45936;&#51060;&#53552;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: {0} &#48264;&#46308;&#51012; &#47784;&#45944;&#54868;&#54616;&#45716; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#48264;&#46308;&#51012; &#47784;&#45944;&#54868;&#54616;&#45716; &#51473;&#50640; &#51648;&#51221;&#46108; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47928;&#51228;&#51216;&#51032; &#49464;&#48512;&#49324;&#54637;&#51012; &#52280;&#51312;&#54616;&#50668; &#51648;&#51221;&#46108; &#50696;&#50808;&#47484; &#50672;&#44396;&#54616;&#44256; &#47928;&#51228;&#51216;&#51012; &#50672;&#44396;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. WAR {0}&#51032; web.xml zip &#54637;&#47785;&#50640; &#47582;&#45716; InputStream&#51012; &#44032;&#51256;&#50732; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: &#48260;&#51204; {4}&#51032; &#48264;&#46308; {3}&#50640; &#51080;&#45716; Bean {2}&#50640; &#49324;&#50857;&#46104;&#45716; &#51088;&#50896;&#51032; &#45824;&#49345; {1}&#50640;&#49436; &#51060;&#47492; {0}&#44284;(&#50752;) &#51068;&#52824;&#54616;&#45716; MDB &#47532;&#49828;&#45320; Auth &#48324;&#47749;&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; Auth &#48324;&#47749;&#51060; &#50630;&#44144;&#45208; &#51060; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54596;&#49688; Auth &#48324;&#47749;&#51012; &#44396;&#49457;&#54616;&#44144;&#45208; &#54644;&#45817; &#48324;&#47749;&#51060; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#50732;&#48148;&#47480; &#48276;&#50948;&#50640;&#49436; &#44396;&#49457;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: {0} asset&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#51064; APPLICATION.MF&#51032; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46104;&#51648; &#50506;&#51008; {1} &#48264;&#46308;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;. &#54644;&#45817; &#48264;&#46308;&#51060; {3} &#48264;&#46308;&#50640;&#49436; {2} &#49436;&#48708;&#49828;&#47484; &#51060;&#50857;&#54616;&#45716;&#45936;, &#51060;&#45716; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#50732;&#48148;&#47476;&#44172; &#44396;&#49457;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;. &#44277;&#50976; &#48264;&#46308;&#51008; &#48516;&#47532;&#46108; &#48264;&#46308;&#50640;&#49436; &#49436;&#48708;&#49828;&#47484; &#51060;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308;&#51008; &#48516;&#47532;&#46104;&#50612; &#51080;&#51004;&#47728; Application-ExportService &#47700;&#52964;&#45768;&#51608;&#51012; &#53685;&#54644;&#49436;&#47564; &#44592;&#53440; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#49436;&#48708;&#49828;&#47484; &#45236;&#48372;&#45244; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Use-Bundle &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308; &#46608;&#45716; &#48516;&#49437;&#44592;&#47484; &#53685;&#54644; &#52628;&#44032;&#46108; &#48264;&#46308;&#50640; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308;&#50640;&#49436; &#51228;&#44277;&#54616;&#45716; &#49436;&#48708;&#49828;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#54056;&#53412;&#51669; &#46608;&#45716; &#44396;&#49457;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: {0} &#51088;&#49328;&#51060; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#47196; &#48176;&#52824;&#46104;&#47140;&#47732; &#50808;&#48512; &#45796;&#50868;&#47196;&#46300;&#44032; &#54596;&#50836;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49352; &#51088;&#49328; &#46608;&#45716; &#50629;&#45936;&#51060;&#53944;&#46108; &#51088;&#49328;&#51012; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#52628;&#44032;&#54616;&#44144;&#45208; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944;&#54616;&#47140;&#47732; &#51200;&#51109;&#49548;&#50640;&#49436; &#54616;&#45208; &#51060;&#49345;&#51032; &#48264;&#46308;&#51012; &#45796;&#50868;&#47196;&#46300;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#48264;&#46308; &#45796;&#50868;&#47196;&#46300; &#54532;&#47196;&#49464;&#49828;&#47484; &#49884;&#51089;&#54616;&#47140;&#47732; &#48320;&#44221;&#49324;&#54637;&#51012; &#47560;&#49828;&#53552; &#44396;&#49457;&#50640; &#51200;&#51109;&#54616;&#49901;&#49884;&#50724;. &#44288;&#47532; &#53080;&#49556;&#51012; &#53685;&#54644; asset &#49464;&#48512;&#49324;&#54637; &#54056;&#45328;&#50640;&#49436; asset&#51032; &#48264;&#46308;&#51060; &#45796;&#50868;&#47196;&#46300;&#46104;&#45716; &#49345;&#53468;&#47484; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;. &#48264;&#46308; &#45796;&#50868;&#47196;&#46300;&#47484; &#50756;&#47308;&#54620; &#54980; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640;&#49436; &#45796;&#49884; &#51088;&#49328;&#51012; &#52628;&#44032;&#54616;&#44144;&#45208; &#50629;&#45936;&#51060;&#53944;&#54644; &#48372;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: EBA &#54028;&#51068; {1}&#51032; WAR &#54028;&#51068; {0}&#51012;(&#47484;) WAB &#54028;&#51068;&#47196; &#48320;&#54872;&#54616;&#51648; &#47803;&#54664;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive)&#51032; WAR(Web Application Archive) &#54028;&#51068;&#51012; WAB(Web Application Bundle)&#47196; &#48320;&#54872;&#54644;&#50556; &#48176;&#52824;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#48320;&#54872; &#54532;&#47196;&#49464;&#49828;&#47484; &#50756;&#47308;&#54616;&#51648; &#47803;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    WAR &#54028;&#51068;&#51060; &#50976;&#54952;&#54620;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. RepositoryAdminSupport &#49436;&#48708;&#49828;&#47484; OSGi Service Registry&#50640;&#49436; &#49324;&#50857;&#54624;&#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: &#51064;&#51613; &#48324;&#47749; {0}&#51060;(&#44032;) {1} &#45824;&#49345;&#51032; &#48372;&#50504; &#46020;&#47700;&#51064; {2}&#50640; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Blueprint &#51088;&#50896; &#52280;&#51312; &#48148;&#51064;&#46300; &#49884; &#44544;&#47196;&#48268; &#46608;&#45716; &#45824;&#49345; &#48372;&#50504; &#46020;&#47700;&#51064;&#50640; &#51064;&#51613; &#48324;&#47749;&#51060; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44544;&#47196;&#48268; &#46608;&#45716; &#45824;&#49345; &#48372;&#50504; &#46020;&#47700;&#51064;&#50640; &#51080;&#45716; &#51064;&#51613; &#48324;&#47749;&#51012; &#49440;&#53469;&#54616;&#44144;&#45208; &#51201;&#54633;&#54620; &#51064;&#51613; &#48324;&#47749;&#51012; &#51089;&#49457;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#51060;(&#44032;) Application-Context&#50640; CBA(Composite Bundle Archive)&#47484; &#54252;&#54632;&#54616;&#48064;&#47196; {0} &#45432;&#46300;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47784;&#46304; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; &#44057;&#51008; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#54624; &#49688; &#51080;&#50612;&#50556; &#54616;&#51648;&#47564; &#49352; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; Application-Content&#50640; CBA&#44032; &#51080;&#45716; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51648;&#50896;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#54840;&#49828;&#53944;&#54616;&#46020;&#47197; &#48260;&#51204; 8 &#45432;&#46300;&#47484; &#49440;&#53469;&#54616;&#44144;&#45208;, Application-Context&#50640; &#45908; &#51060;&#49345; CBA&#47484; &#54252;&#54632;&#54616;&#51648; &#50506;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; {0}&#51060;(&#44032;) OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#48512;&#54633;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#54840;&#52636;&#46108; &#51312;&#51089;&#51008; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640;&#49436; &#51089;&#46041;&#54633;&#45768;&#45796;. &#49440;&#53469;&#46108; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49440;&#53469;&#54620; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#44032; &quot;EBA,version=1.0&quot; &#50976;&#54805;&#51032; asset&#50640; &#51032;&#54644; &#51060;&#51204;&#51004;&#47196; &#48373;&#44480;&#46104;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. asset &#48148;&#51060;&#45320;&#47532; {0}&#50640;&#49436; &#48176;&#52824; Manifest&#47484; &#52628;&#52636;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. ModelledResourceManager &#49436;&#48708;&#49828;&#47484; OSGi Service Registry&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48260;&#51204; {1}&#51032; CBA &#48264;&#46308; {0}&#51012;(&#47484;) &#47784;&#45944;&#54868;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: Java EE &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51012; EBA &#54028;&#51068; {0}&#50640;&#49436; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54644;&#45817; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51060; &#50630;&#51004;&#47732; WAR &#54028;&#51068;&#51032; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#44032; &#44592;&#48376;&#44050;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596;&#51060; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#47484; &#51221;&#51032;&#54616;&#45716; &#50672;&#44288;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51064; application.xml&#51060; &#50630;&#45716; WAR(Web Application Archive)&#51012; &#52376;&#47532;&#54664;&#49845;&#45768;&#45796;. &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;&#46108; WAR &#54028;&#51068;&#51032; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#47484; &#44592;&#48376;&#44050;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54596;&#50836;&#54620; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51060; &#51228;&#44277;&#46104;&#44256; EBA(Enterprise Bundle Archive) &#54028;&#51068;&#47196; &#51201;&#51208;&#55176; &#54056;&#53412;&#51648;&#54868;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: {0} &#50948;&#52824;&#50640;&#49436; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#51228;&#44277;&#54616;&#45716; &#48176;&#52824; Manifest &#54028;&#51068;&#51012; &#52376;&#47532;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#51080;&#45716; EBA&#47484; &#44032;&#51256;&#50724;&#47140;&#44256; &#49884;&#46020;&#54664;&#49845;&#45768;&#45796;. &#54028;&#51068;&#51012; &#52376;&#47532;&#54616;&#51648; &#47803;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#50640; &#54028;&#51068; &#50529;&#49464;&#49828; &#44428;&#54620;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#44256; &#54028;&#51068;&#51060; &#49552;&#49345;&#46104;&#51648; &#50506;&#50520;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#48176;&#52824; Manifest&#47484; &#49688;&#46041;&#51004;&#47196; &#54200;&#51665;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#54596;&#50836;&#54620; &#44221;&#50864; EBA&#50640;&#49436; &#48176;&#52824; Manifest&#47484; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. &#44536;&#47084;&#47732; EBA&#47484; &#44032;&#51256;&#50732; &#46412; &#49352; &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. OSGi &#49436;&#48708;&#49828; &#47112;&#51648;&#49828;&#53944;&#47532;&#50640;&#49436; {0} &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: {0} &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49828;&#53664;&#47532;&#51648;&#44032; &#51080;&#44256; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#49324;&#50857; &#44428;&#54620;&#51060; &#51228;&#54408;&#50640; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#47784;&#46280; &#50976;&#54805;&#51008; &#50696;&#44592;&#52824; &#47803;&#54620; &#50976;&#54805;&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: EBA &#54028;&#51068; {0}&#51060;(&#44032;) &#49444;&#52824;&#46104;&#50632;&#51648;&#47564; &#50724;&#47448;&#44032; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#54028;&#51068;&#51032; &#50976;&#54952;&#49457; &#44160;&#51613; &#48143; &#49444;&#52824;&#44032; &#50756;&#47308;&#46104;&#50632;&#51648;&#47564; &#50724;&#47448;&#44032; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51088;&#49464;&#54620; &#51221;&#48372;&#45716; SystemOut.log &#54028;&#51068;&#51032; &#44288;&#47144; &#50724;&#47448; &#47700;&#49884;&#51648;&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#51068;&#52824;&#54616;&#45716; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51060; &#50630;&#51004;&#48064;&#47196; {3} &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#49324;&#50857;&#54616;&#45716; &#48260;&#51204; {2}&#51032; &#48264;&#46308; {1}&#50640;&#49436; EJB &#52280;&#51312; {0}&#50640; &#45824;&#54620; &#44592;&#48376; &#48148;&#51064;&#46377;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48148;&#51064;&#46377;&#46104;&#51648; &#50506;&#51008; EJB &#52280;&#51312;&#50640; &#45824;&#54620; &#44592;&#48376; &#48148;&#51064;&#46377;&#51012; &#51089;&#49457;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#52280;&#51312;&#47484; &#48148;&#51064;&#46300;&#54624; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54644;&#45817; &#52280;&#51312;&#47484; &#50508;&#47140;&#51652; JNDI &#50948;&#52824;&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} asset&#51032; &#44396;&#49457; asset &#50724;&#48652;&#51229;&#53944;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: JNDI &#51060;&#47492;&#51060; {0}&#51060;&#44256; &#50976;&#54805;&#51060; {1}&#51064; &#51088;&#50896; &#52280;&#51312;&#47484; &#48260;&#51204;&#51060; {5}&#51064; {4} &#48264;&#46308;&#50640; &#51221;&#51032;&#46108; EJB &#51088;&#50896; &#52280;&#51312; {3}&#51032; {2} &#45824;&#49345;&#50640;&#49436; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EJB &#47784;&#46280;&#50640; &#51088;&#50896; &#52280;&#51312;&#47484; &#54252;&#54632;&#54616;&#45716; EBA(Enterprise Bundle Archive)&#45716; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#50630;&#45716; &#51088;&#50896; &#52280;&#51312;&#51032; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51088;&#50896; &#52280;&#51312;&#44032; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#51080;&#50612;&#50556; &#54616;&#45716; &#44221;&#50864; &#50724;&#48652;&#51229;&#53944;&#47484; &#54644;&#45817; &#51060;&#47492;&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#51088;&#50896; &#52280;&#51312;&#47484; &#51221;&#51221;&#54616;&#44256; EBA&#47484; &#50629;&#45936;&#51060;&#53944;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: &#48708;&#51592;&#45768;&#49828; &#47112;&#48296; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#50640;&#49436; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; {0}&#50640; &#48176;&#52824;&#46108; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#51473;&#51648;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51473;&#51648; &#51312;&#51089; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53945;&#51221; &#47928;&#51228;&#51216;&#51012; &#51088;&#49464;&#55176; &#51652;&#45800;&#54616;&#47140;&#47732; &#51060; &#50696;&#50808; &#51060;&#51204;&#51032; &#49436;&#48260; &#47196;&#44536;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: {0} &#50669;&#54624;&#51008; &#50732;&#48148;&#47480; &#50669;&#54624;&#51060; &#50500;&#45785;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#50669;&#54624;&#51060; &#44396;&#49457;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; &#50669;&#54624;&#51012; &#44396;&#49457;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: &#53364;&#47084;&#49828;&#53552; &#47716;&#48260; {0}&#51008;(&#45716;) OSGi Application {1}&#50640;&#49436; &#54596;&#50836;&#54620; {2} &#44592;&#45733;&#51004;&#47196; &#44592;&#45733; &#48372;&#44053; &#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#53364;&#47084;&#49828;&#53552;&#50640; OSGi Application&#51012; &#49444;&#52824;&#54616;&#47140;&#47732; &#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; &#47716;&#48260;&#44032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#47784;&#46304; &#54596;&#49688; &#44592;&#45733;&#51012; &#44032;&#51648;&#44256; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#49352; &#53364;&#47084;&#49828;&#53552; &#47716;&#48260;&#47484; &#52628;&#44032;&#54624; &#46412; &#51060; &#47716;&#48260;&#46020; &#53364;&#47084;&#49828;&#53552;&#50640; &#49444;&#52824;&#54624; &#47784;&#46304; OSGi Application&#50640;&#49436; &#54596;&#50836;&#47196; &#54616;&#45716; &#47784;&#46304; &#44592;&#45733;&#51012; &#44032;&#51648;&#44256; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53364;&#47084;&#49828;&#53552;&#51032; &#51228;&#50504;&#46108; &#47716;&#48260;&#44032; &#50724;&#47448; &#47700;&#49884;&#51648;&#50640; &#54364;&#49884;&#46108; OSGi Application&#50640; &#45824;&#54644; &#54596;&#50836;&#54620; &#47784;&#46304; &#44592;&#45733;&#51012; &#44032;&#51648;&#44256; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: {0} &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49828;&#53664;&#47532;&#51648;&#44032; &#51080;&#44256; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#49324;&#50857; &#44428;&#54620;&#51060; &#51228;&#54408;&#50640; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: &#48176;&#52824; Manifest &#52968;&#53584;&#52768;&#44032; &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;. &#45796;&#51020; &#48264;&#46308;&#51008; &#50668;&#48516;&#51032; &#48264;&#46308;&#51077;&#45768;&#45796;. {0}.
  </MsgText>
  <Explanation>
    &#44032;&#51256;&#50732; &#48176;&#52824; Manifest&#50640; EBA(Enterprise Bundle Archive) &#51088;&#49328;&#51012; &#54644;&#49437;&#54616;&#45716; &#45936; &#54596;&#50836;&#54616;&#51648; &#50506;&#51008; &#48264;&#46308;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50696;&#50808; &#47700;&#49884;&#51648;&#50640; &#45208;&#50676;&#46108; &#48264;&#46308;&#51060; &#49352; &#48176;&#52824; Manifest, DEPLOYMENT.MF&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#48176;&#52824; Manifest&#47484; &#49688;&#46041;&#51004;&#47196; &#54200;&#51665;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#54596;&#50836;&#54620; &#44221;&#50864; EBA&#50640;&#49436; &#48176;&#52824; Manifest&#47484; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. &#51060;&#47111;&#44172; &#54616;&#47732; EBA&#47484; &#44032;&#51256;&#50732; &#46412; &#49352; &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: &#51648;&#51221;&#46108; &#44536;&#47353; {0}&#51060;(&#44032;) &#50976;&#54952;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48372;&#50504; &#50669;&#54624;&#51012; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#44536;&#47353;&#50640; &#47605;&#54609;&#54616;&#47140;&#44256; &#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; &#44536;&#47353;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#44288;&#47532; &#49436;&#48708;&#49828;&#44032; &#46321;&#47197;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; {0}&#50640; &#45824;&#54620; &#54869;&#51109;&#44592;&#45733;&#50640;&#45716; &#50808;&#48512; &#45796;&#50868;&#47196;&#46300;&#44032; &#54596;&#50836;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#51032; &#54869;&#51109;&#44592;&#45733;&#51004;&#47196; &#49324;&#50857;&#54616;&#46020;&#47197; CBA(Composite Bundle Archive)&#47484; &#51089;&#49457; &#46608;&#45716; &#50629;&#45936;&#51060;&#53944;&#54664;&#49845;&#45768;&#45796;. &#51060; &#54869;&#51109;&#44592;&#45733;&#51008; &#51200;&#51109;&#49548;&#50640;&#49436; &#54616;&#45208; &#51060;&#49345;&#51032; &#48264;&#46308;&#51012; &#45796;&#50868;&#47196;&#46300;&#54644;&#50556; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#54869;&#51109;&#44592;&#45733;&#51012; &#52628;&#44032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#45796;&#50868;&#47196;&#46300; &#54532;&#47196;&#49464;&#49828;&#47484; &#49884;&#51089;&#54616;&#47140;&#47732; &#47560;&#49828;&#53552; &#44396;&#49457;&#51032; &#48320;&#44221;&#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#49901;&#49884;&#50724;. &#44288;&#47532; &#53080;&#49556;&#51032; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; &#49464;&#48512;&#49324;&#54637; &#54056;&#45328;&#50640;&#49436; &#48264;&#46308; &#45796;&#50868;&#47196;&#46300; &#49345;&#53468;&#47484; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;. &#48264;&#46308; &#45796;&#50868;&#47196;&#46300;&#44032; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#45824;&#44592;&#54620; &#45796;&#51020; &#54869;&#51109;&#44592;&#45733;&#51012; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#52628;&#44032;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: {1} asset&#50640; &#54596;&#49688;&#51064; {0} &#44592;&#45733;&#51060; &#48176;&#52824;&#46108; &#49436;&#48260; &#46608;&#45716; &#53364;&#47084;&#49828;&#53552;&#44032; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50612;&#45712; &#49436;&#48260;&#50640;&#49436;&#46020; &#54644;&#45817; &#54596;&#49688; &#44592;&#45733;&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#52572;&#49548;&#54620; &#54616;&#45208;&#51032; &#49436;&#48260;&#50640; &#54644;&#45817; &#54596;&#49688; &#44592;&#45733;&#51012; &#49444;&#52824;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#50640; &#45796;&#51020; &#48264;&#46308;&#51060; &#45572;&#46973;&#46104;&#50632;&#49845;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: {0} asset&#51060; &#51060;&#48120; &#48708;&#51592;&#45768;&#49828; &#47112;&#48296; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#52628;&#44032;&#46104;&#50632;&#44592; &#46412;&#47928;&#50640; &#54644;&#45817; asset&#51012; &#51060; &#48708;&#51592;&#45768;&#49828; &#47112;&#48296; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#52628;&#44032;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    &#45800;&#51068; BLA(Business Level Application)&#50640;&#47564; EBA(Enterprise Bundle Archive) asset&#51060; &#51080;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#52968;&#53584;&#52768;&#45716; &#46041;&#51068;&#54616;&#51648;&#47564; Application Symbolic Name&#51060; &#45796;&#47480; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49352;&#47196; &#51089;&#49457;&#54616;&#49901;&#49884;&#50724;. &#49352;&#47196; &#51089;&#49457;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; EBA asset&#51004;&#47196; &#44032;&#51256;&#50728; &#54980; &#54644;&#45817; BLA&#50640; &#52628;&#44032;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#54532;&#47196;&#48708;&#51200;&#45789;&#51012; &#49688;&#54665;&#54616;&#47732; WebSphere Application Server &#48260;&#51204; 8&#44284; WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack&#50640; &#45824;&#54644; &#49436;&#47196; &#45796;&#47480; &#44208;&#44284;&#44032; &#49373;&#49457;&#46121;&#45768;&#45796;. &#48260;&#51204; 8&#51032; &#44208;&#44284;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#44032;&#51256;&#50724;&#45716; &#51473;&#51064; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; WebSphere Application Server &#48260;&#51204; 8&#44284; WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack&#50640; &#45824;&#54644; &#49457;&#44277;&#51201;&#51004;&#47196; &#54532;&#47196;&#48708;&#51200;&#45789;&#46121;&#45768;&#45796;. &#44536;&#47084;&#45208; &#46160; &#54532;&#47196;&#48708;&#51200;&#45789; &#51312;&#51089;&#51032; &#44208;&#44284;&#44032; &#49436;&#47196; &#45796;&#47493;&#45768;&#45796;. &#48176;&#52824;&#44032; &#49436;&#47196; &#45796;&#47480; &#46041;&#51068;&#54620; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51312;&#52824;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1}&#51060;(&#44032;) {0} &#46356;&#47113;&#53664;&#47532;&#50640; &#51648;&#51221;&#46104;&#50632;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#51088;&#49328;&#51060; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;. EBA&#50640; &#54252;&#54632;&#46108; &#50937; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49444;&#51221;&#54616;&#46020;&#47197; &#50937; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#46356;&#47113;&#53664;&#47532;&#44032; &#51648;&#51221;&#46104;&#50632;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50630;&#51020;
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#46608;&#45716; &#48176;&#52824; Manifest&#47484; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#45800;&#44228;&#47484; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: {0} asset&#50640; JAR &#54028;&#51068; {1}&#51060;(&#44032;) &#51080;&#45716;&#45936;, &#51060; &#54028;&#51068;&#51008; &#48264;&#46308;&#51060; &#50500;&#45768;&#47728; &#48320;&#54872;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51068;&#48512; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#51060; &#54028;&#51068;&#50640; &#46384;&#46972; &#51340;&#50864;&#46104;&#47732; &#47088;&#53440;&#51076; &#49884; &#51109;&#50528;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50976;&#54008;&#47532;&#54000; JAR(Java Archive) &#54028;&#51068; &#48143; EJB(Enterprise JavaBeans) JAR &#54028;&#51068;&#51032; &#48320;&#54872;&#51008; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    JAR &#54028;&#51068;&#51032; &#53364;&#47000;&#49828;&#50640; &#46384;&#46972; &#45804;&#46972;&#51648;&#45716; &#48264;&#46308; &#46608;&#45716; WAB(Web Application Bundle)&#44032; &#50630;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#44221;&#44256; &#47700;&#49884;&#51648;&#47484; &#54644;&#44208;&#54616;&#47140;&#47732; EBA(Enterprise Bundle Archive)&#50640;&#49436; JAR &#54028;&#51068;&#51012; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#46608;&#45716; &#48176;&#52824; Manifest&#47484; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: &#48260;&#51204; {3}&#51032; &#48264;&#46308; {2}&#50640;&#49436; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean {1}&#50640; &#45824;&#54620; EJB &#51064;&#53552;&#54168;&#51060;&#49828; {0}&#51012;(&#47484;) {4} &#50948;&#52824;&#50640; &#48148;&#51064;&#46300;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#47196;&#52972;&#47196; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; EJB &#51064;&#53552;&#54168;&#51060;&#49828;&#45716; ejblocal: &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#48148;&#51064;&#46300;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51032; &#47196;&#52972;, &quot;&#51064;&#53552;&#54168;&#51060;&#49828; &#50630;&#51020;&quot; &#48143; &quot;&#47196;&#52972; &#54856;&quot; &#48372;&#44592;&#45716; &#47196;&#52972; &#54805;&#49885;&#51004;&#47196; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; JNDI&#50640;&#47564; &#48148;&#51064;&#46300;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#46384;&#46972;&#49436; &#54644;&#45817; &#48148;&#51064;&#46377; &#51060;&#47492;&#51008; &quot;ejblocal:&quot;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    ejblocal: &#45348;&#51076;&#49828;&#54168;&#51060;&#49828; &#51217;&#46160;&#48512;&#47484; &#49324;&#50857;&#54616;&#46020;&#47197; &#47196;&#52972;&#47196; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; EJB &#48372;&#44592;&#51032; &#48148;&#51064;&#46377; &#51060;&#47492;&#51012; &#51312;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: CompUnitStatusStep&#51008; &#52980;&#54252;&#51648;&#53944; &#45800;&#50948; {0}&#51012;(&#47484;) {1} &#51088;&#49328;&#50640;&#49436; &#49324;&#50857; &#44032;&#45733;&#54620; &#52572;&#49888; &#48176;&#52824; &#48260;&#51204;&#51004;&#47196; &#50629;&#44536;&#47112;&#51060;&#46300;&#54644;&#50556; &#54632;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44536;&#47084;&#45208; &#52980;&#54252;&#51648;&#53944; &#45800;&#50948; {0}&#51060;(&#44032;) &#52572;&#49888;&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50629;&#45936;&#51060;&#53944;&#46108; &#51088;&#49328; &#48260;&#51204;&#51060; &#49324;&#50857; &#44032;&#45733;&#54616;&#44256; &#50629;&#45936;&#51060;&#53944;&#46108; &#51088;&#49328;&#50640; &#54596;&#50836;&#54620; &#47784;&#46304; &#48264;&#46308;&#51032; &#45796;&#50868;&#47196;&#46300;&#47484; &#50756;&#47308;&#54644;&#50556; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#48176;&#52824;&#46108; &#51088;&#49328;&#51012; &#50629;&#44536;&#47112;&#51060;&#46300;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#52572;&#49888; &#48260;&#51204;&#51032; &#51088;&#49328;&#51060; &#49324;&#50857; &#44032;&#45733;&#54616;&#47728; &#51088;&#49328;&#51032; &#47784;&#46304; &#48264;&#46308; &#45796;&#50868;&#47196;&#46300;&#44032; &#50756;&#47308;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#51088;&#49328;&#51032; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#47484; &#50619;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#51060;(&#44032;) &#54869;&#51109;&#46104;&#50632;&#51004;&#48064;&#47196; {0} &#45432;&#46300;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47784;&#46304; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; &#44057;&#51008; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#54624; &#49688; &#51080;&#50612;&#50556; &#54616;&#51648;&#47564; &#49352; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#54869;&#51109;&#44592;&#45733;&#51012; &#51648;&#50896;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#54840;&#49828;&#53944;&#54616;&#46020;&#47197; &#48260;&#51204; 8 &#45432;&#46300;&#47484; &#49440;&#53469;&#54616;&#44144;&#45208;, &#49440;&#53469;&#46108; &#45432;&#46300;&#47484; &#49324;&#50857;&#54616;&#50668; &#49892;&#54665;&#46112; &#49688; &#51080;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#54869;&#51109;&#44592;&#45733;&#51012; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: &#46041;&#51068;&#54620; &#44592;&#54840; &#51060;&#47492;&#51032; &#52649;&#46028;&#54616;&#45716; &#54869;&#51109;&#51060; &#51080;&#51004;&#48064;&#47196; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; {1}&#51032; &#48264;&#46308; {0}&#51012;(&#47484;) &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#54644;&#45817; &#48260;&#51204;&#50640; &#51060;&#48120; &#46041;&#51068;&#54620; &#44592;&#54840; &#51060;&#47492;&#51012; &#44032;&#51652; &#54869;&#51109;&#51060; &#51080;&#51004;&#48064;&#47196; &#50836;&#52397;&#54620; &#48260;&#51204;&#51004;&#47196; cba &#48264;&#46308;&#51012; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54869;&#51109;&#51012; &#51228;&#44144;&#54616;&#44144;&#45208; &#50629;&#45936;&#51060;&#53944;&#54616;&#47140;&#45716; &#48264;&#46308; &#48260;&#51204;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: &#48260;&#51204; {4}&#51032; &#48264;&#46308; {3}&#50640; &#51080;&#45716; Bean {2}&#50640; &#49324;&#50857;&#46104;&#45716; &#51088;&#50896;&#51032; &#45824;&#49345; {1}&#50640;&#49436; JNDI &#51060;&#47492; {0}&#44284;(&#50752;) &#51068;&#52824;&#54616;&#45716; MDB &#54876;&#49457;&#54868; &#49828;&#54169;&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; MDB &#47532;&#49828;&#45320; &#48148;&#51064;&#46377; &#54876;&#49457;&#54868; &#49828;&#54169; &#52280;&#51312; JNDI &#51060;&#47492;&#51060; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#52280;&#51312;&#44032; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#51080;&#50612;&#50556; &#54616;&#45716; &#44221;&#50864; &#50724;&#48652;&#51229;&#53944;&#47484; &#54644;&#45817; &#51060;&#47492;&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#52280;&#51312;&#47484; &#51221;&#51221;&#54616;&#44256; EBA&#47484; &#50629;&#45936;&#51060;&#53944;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#51088;&#49328;&#50640;&#49436; &#52968;&#53584;&#52768;&#47484; &#51312;&#54924;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#52968;&#53584;&#52768;&#50640;&#49436; &#48373;&#54633; &#48264;&#46308; {1}&#51012;(&#47484;) &#54252;&#54632;&#54633;&#45768;&#45796;. &#51060;&#45716; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48373;&#54633; &#48264;&#46308;&#51012; EBA&#50640; &#51649;&#51217; &#54252;&#54632;&#49884;&#53412;&#44592; &#50948;&#54644; Application-Content &#54756;&#45908;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#52968;&#53584;&#52768;&#50640;&#49436; &#48373;&#54633; &#48264;&#46308;&#51012; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. Application-Content&#50640; &#44060;&#48324; &#48264;&#46308;&#51012; &#54252;&#54632;&#49884;&#53412;&#44144;&#45208; &#44277;&#50976;&#54616;&#46020;&#47197; &#48264;&#46308; &#51200;&#51109;&#49548;&#50640; &#52980;&#54252;&#51648;&#53944; &#48264;&#46308;&#51012; &#49444;&#52824;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#51060;&#47492;&#51060; &#50732;&#48148;&#47480; &#54028;&#51068;&#51060; &#48264;&#46308; &#52880;&#49884;&#50640; &#51080;&#51648;&#47564; &#50696;&#49345;&#46104;&#45716; &#48264;&#46308; {0}/{1}&#51060;(&#44032;) &#54252;&#54632;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: JNDI &#51060;&#47492;&#51060; {0}&#51060;&#44256; &#50976;&#54805;&#51060; {1}&#51064; &#47700;&#49884;&#51648; &#45824;&#49345; &#52280;&#51312; &#46608;&#45716; &#51088;&#50896; &#54872;&#44221; &#52280;&#51312;&#47484; &#48260;&#51204;&#51060; {5}&#51064; {4} &#48264;&#46308;&#50640; &#51221;&#51032;&#46108; EJB &#47700;&#49884;&#51648; &#45824;&#49345; &#52280;&#51312; &#46608;&#45716; &#51088;&#50896; &#54872;&#44221; &#52280;&#51312; {3}&#51032; {2} &#45824;&#49345;&#50640;&#49436; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EJB &#47784;&#46280;&#50640; &#47700;&#49884;&#51648; &#45824;&#49345; &#52280;&#51312; &#46608;&#45716; &#51088;&#50896; &#54872;&#44221; &#52280;&#51312;&#47484; &#54252;&#54632;&#54616;&#45716; EBA(Enterprise Bundle Archive)&#45716; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#50630;&#45716; &#47700;&#49884;&#51648; &#45824;&#49345; &#52280;&#51312; &#46608;&#45716; &#51088;&#50896; &#54872;&#44221; &#52280;&#51312;&#51032; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47700;&#49884;&#51648; &#45824;&#49345; &#52280;&#51312; &#46608;&#45716; &#51088;&#50896; &#54872;&#44221; &#52280;&#51312;&#44032; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#51080;&#50612;&#50556; &#54616;&#45716; &#44221;&#50864; &#50724;&#48652;&#51229;&#53944;&#47484; &#54644;&#45817; &#51060;&#47492;&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#47700;&#49884;&#51648; &#45824;&#49345; &#52280;&#51312; &#46608;&#45716; &#51088;&#50896; &#54872;&#44221; &#52280;&#51312;&#47484; &#51221;&#51221;&#54616;&#44256; EBA&#47484; &#50629;&#45936;&#51060;&#53944;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: &#54644;&#45817; &#44592;&#54840; &#51060;&#47492;&#50640; &#46160; &#44060;&#51032; &#50672;&#49549; &#47560;&#52840;&#54364; &#47928;&#51088;&#44032; &#51080;&#51004;&#48064;&#47196; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}&#51008;(&#45716;) &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#44592;&#54840; &#51060;&#47492;&#50640; &quot;..&quot; &#47928;&#51088;&#50676;, &#51593;, &#46160; &#44060;&#51032; &#50672;&#49549; &#47560;&#52840;&#54364; &#47928;&#51088;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#44592;&#54840; &#51060;&#47492;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: EBA &#54028;&#51068; {0}&#51012;(&#47484;) &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#54028;&#51068;&#51012; &#51069;&#45716; &#51473;&#50640; IOException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#54028;&#51068;&#51060; &#49552;&#49345;&#46104;&#50632;&#44144;&#45208; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54028;&#51068;&#51032; &#49324;&#50857; &#44428;&#54620;&#51060; &#51201;&#51208;&#54616;&#44256; &#54805;&#49885;&#51060; &#50732;&#48148;&#47480;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. SecurityAdmin MBean&#51060; &#46321;&#47197;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: CBA(Composite Bundle Archive) {0}&#51032; &#52968;&#53584;&#52768;&#50640; &#51080;&#45716; &#49436;&#48708;&#49828; &#52280;&#51312;&#47484; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. CBA&#50640; &#54252;&#54632;&#46104;&#51648; &#50506;&#51008; &#48264;&#46308;&#51060; &#51060; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54620; &#44221;&#50864; CBA&#44032; &#54644;&#45817; &#49436;&#48708;&#49828;&#47484; &#44032;&#51256;&#50752;&#50556; &#54633;&#45768;&#45796;. &#45796;&#51020; &#49436;&#48708;&#49828; &#51333;&#49549;&#49457;&#51060; &#54644;&#44208;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    CBA(Composite Bundle Archive)&#51032; &#48264;&#46308;&#51060; &#48264;&#46308;&#50640; &#54252;&#54632;&#46104;&#51648; &#50506;&#51008; &#49436;&#48708;&#49828; &#46608;&#45716; CBA&#51032; &#45796;&#47480; &#48264;&#46308;&#51060; &#45236;&#48372;&#45240; &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; CBA&#44032; &#49436;&#48708;&#49828;&#47484; &#44032;&#51256;&#50752;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CBA&#44032; CBA&#51032; &#48264;&#46308;&#51060; &#49324;&#50857;&#54616;&#45716; &#49436;&#48708;&#49828;&#47484; &#44032;&#51256;&#50724;&#46020;&#47197;(&#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#51060; &#49436;&#48708;&#49828;&#45716; CBA&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#50630;&#51020;) &#52980;&#54252;&#51648;&#53944; Manifest, COMPOSITEBUNDLE.MF&#47484; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;&#46108; EBA &#54028;&#51068; {0}&#51012;(&#47484;) &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;&#46108; EBA(Enterprise Bundle Archive) &#54028;&#51068;&#51012; &#51089;&#49457;&#54616;&#45716; &#51473;&#50640; IOException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44288;&#47144; &#46356;&#47113;&#53664;&#47532;&#50640; &#50416;&#44592; &#51089;&#50629;&#51012; &#49688;&#54665;&#54616;&#45716;&#45936; &#54596;&#50836;&#54620; &#49324;&#50857; &#44428;&#54620;&#51060; &#54644;&#45817; &#51228;&#54408;&#50640; &#51080;&#44256; &#45824;&#49345; &#54028;&#51068;&#51060; &#51104;&#44592;&#51648; &#50506;&#50520;&#51004;&#47728; &#52649;&#48516;&#54620; &#49828;&#53664;&#47532;&#51648;&#44032; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: &#49472;&#51032; &#47784;&#46304; &#45432;&#46300;&#50640; &#45824;&#54644; {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#54532;&#47196;&#48708;&#51200;&#45789;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#48260;&#51204; 8 &#45432;&#46300;&#50640;&#47564; &#48176;&#52824;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#54644;&#49437; &#50724;&#47448;&#45716; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#44032;&#51256;&#50724;&#45716; &#51473;&#51064; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; WebSphere Application Server &#48260;&#51204; 8&#50640; &#45824;&#54644; &#49457;&#44277;&#51201;&#51004;&#47196; &#54532;&#47196;&#48708;&#51200;&#45789;&#46104;&#50632;&#51648;&#47564; WebSphere Application Server &#48260;&#51204; 7&#51032; OSGi Application Feature Pack&#50640; &#45824;&#54644;&#49436;&#45716; &#54532;&#47196;&#48708;&#51200;&#45789;&#46112; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51312;&#52824;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. WebSphere Application Server &#48260;&#51204; 7 OSGi Application Feature Pack&#50640; &#45824;&#54644; &#48176;&#52824;&#54624; &#49688; &#51080;&#46020;&#47197; &#54644;&#49437; &#50724;&#47448;&#51032; &#51221;&#48372;&#47484; &#49324;&#50857;&#54616;&#50668; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: {0}.{1} &#49436;&#48260;&#50640; &#45824;&#54620; &#51204;&#49569;&#51012; &#50948;&#54644; &#47196;&#52972; &#54840;&#49828;&#53944;&#47484; &#54840;&#49828;&#53944; &#51060;&#47492;&#51004;&#47196; &#49324;&#50857;&#54633;&#45768;&#45796;. &#50937; &#49436;&#48260; &#48143; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#46041;&#51068;&#54620; &#45432;&#46300;&#50640; &#51080;&#45716; &#54620; &#50836;&#52397; &#46972;&#50864;&#54021;&#51060; &#51089;&#46041;&#46121;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51204;&#49569;&#50640;&#49436; &#51648;&#51221;&#46108; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;&#51060; &#47196;&#52972; &#54840;&#49828;&#53944;&#47196; &#54644;&#49437;&#46104;&#50632;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50937; &#49436;&#48260; &#48143; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#45796;&#47480; &#45432;&#46300;&#50640; &#51080;&#45716; &#44221;&#50864; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;&#51060; &#47196;&#52972; &#54840;&#49828;&#53944;&#47196; &#54644;&#49437;&#46108; &#51060;&#50976;&#47484; &#52286;&#50500;&#48372;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: EBA &#54028;&#51068; {0}&#51012;(&#47484;) &#49444;&#52824;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. EBA&#51032; Application-SymbolicName {1}&#51008;(&#45716;) {2} &#51088;&#49328;&#50640;&#49436; &#51060;&#48120; &#49324;&#50857; &#51473;&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA &#54028;&#51068;&#51012; &#49444;&#52824;&#54616;&#47140;&#44256; &#49884;&#46020;&#54664;&#51648;&#47564; &#44592;&#54840; &#51060;&#47492;&#51060; &#44057;&#51008; &#45796;&#47480; &#51088;&#49328;&#51060; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49444;&#52824;&#54616;&#47140;&#45716; EBA&#51032; &#44592;&#54840; &#51060;&#47492;&#51012; &#48320;&#44221;&#54616;&#44144;&#45208; &#44592;&#51316; &#51088;&#49328;&#51012; &#49444;&#52824; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: {0} &#45432;&#46300;&#50640; &#45824;&#54644; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#51012;(&#47484;) &#54532;&#47196;&#48708;&#51200;&#45789;&#54624; &#49688; &#50630;&#51004;&#48064;&#47196; &#54644;&#45817; &#45432;&#46300;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54644;&#49437; &#50724;&#47448;&#45716; {2}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47784;&#46304; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; &#44057;&#51008; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#54624; &#49688; &#51080;&#50612;&#50556; &#54616;&#51648;&#47564; &#49352; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51060; &#51648;&#51221;&#46108; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#50896;&#51012; &#54840;&#49828;&#53944;&#54624; &#45796;&#47480; &#54840;&#54872; &#44032;&#45733;&#54620; &#45432;&#46300;&#47484; &#49440;&#53469;&#54616;&#44144;&#45208;, &#49440;&#53469;&#54620; &#45432;&#46300;&#47484; &#49324;&#50857;&#54616;&#50668; &#49892;&#54665;&#46112; &#49688; &#51080;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: EBA(Enterprise Bundle Archive) &#54028;&#51068; {1}&#51032; {0} &#54028;&#51068;&#51012; &#44396;&#47928; &#48516;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#54028;&#51068;&#51032; &#44396;&#47928;&#51012; &#48516;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54028;&#51068;&#51060; &#50732;&#48148;&#47476;&#44172; &#54805;&#49885;&#54868;&#46104;&#44256; &#49552;&#49345;&#46104;&#51648; &#50506;&#50520;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#46608;&#45716; &#48176;&#52824; Manifest&#47484; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: &#45796;&#51020; &#54028;&#51068;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. {0}
  </MsgText>
  <Explanation>
    &#51088;&#49328;&#51012; &#45236;&#48372;&#45236;&#45716; &#45936; &#54596;&#50836;&#54620; &#44221;&#47196; &#51060;&#47492;&#51012; &#51089;&#49457;&#54616;&#45716; &#51473;&#50640; &#47928;&#51228;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#50640; &#51060; &#44221;&#47196; &#51060;&#47492;&#51012; &#51089;&#49457;&#54624; &#44428;&#54620;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: WAS V7&#51032; UpdateAppContentVersionStep &#47749;&#47161;&#51060; WAS V8&#51032; UpdateAppContentVersions &#47749;&#47161;&#51004;&#47196; &#45824;&#52404;&#46104;&#50632;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    WAS V7 UpdateAppContentVersionStep &#47749;&#47161;&#51060; WAS V8&#51032; UpdateAppContentVersions &#47749;&#47161;&#51004;&#47196; &#45824;&#52404;&#46104;&#50632;&#49845;&#45768;&#45796;. &#51088;&#49464;&#54620; &#51221;&#48372;&#45716; Information Center&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.
  </Explanation>
  <UserResponse>
    UpdateAppContentVersions &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#49828;&#53356;&#47549;&#53944;&#47484; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#54644;&#49437; &#49884; EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#50640;&#45716; &#48176;&#52824;&#54624; &#49688; &#51080;&#45716; &#52968;&#53584;&#52768;&#44032; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: EBA &#54028;&#51068;&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50696;&#50808;: {0}
  </MsgText>
  <Explanation>
    &#49884;&#49828;&#53596;&#51060; &#51201;&#51208;&#54620; &#48260;&#51204;&#50640;&#49436; EBA(Enterprise Bundle Archive) &#54028;&#51068;&#51032; &#44396;&#49457; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#48264;&#46308; &#50948;&#52824;&#47484; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51088;&#49464;&#54620; &#51221;&#48372;&#45716; &#50696;&#50808;&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {1} &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#51004;&#48064;&#47196; EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#51012;(&#47484;) &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: &#51648;&#51221;&#46108; &#49324;&#50857;&#51088; {0}&#51060;(&#44032;) &#50976;&#54952;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48372;&#50504; &#50669;&#54624;&#51012; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#49324;&#50857;&#51088;&#50640; &#47605;&#54609;&#54616;&#47140;&#44256; &#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#44032; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {0} &#54532;&#47196;&#54028;&#51068;&#51032; BundleCacheManager&#50640; &#45824;&#54620; MBean&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: {4} &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#49324;&#50857;&#54616;&#45716; &#48260;&#51204;{3}&#51032; &#48264;&#46308; {2}&#50640;&#49436; EJB &#52280;&#51312; {1}&#50640; &#45824;&#54620; &#48148;&#51064;&#46377; {0}(&#51004;)&#47196; &#51064;&#54644; &#50629;&#45936;&#51060;&#53944; &#54980; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060;&#50732;&#48148;&#47476;&#51648; &#50506;&#44172; &#51089;&#46041;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    java:global/application_name/module_name/ejb_name &#46608;&#45716; java:app/module_name/ejb_name &#44160;&#49353; &#52280;&#51312;&#51032;&#44396;&#49457; &#54028;&#53944;&#45716; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#50629;&#45936;&#51060;&#53944;&#46108; &#54980;&#50640; &#48320;&#44221;&#46112; &#49688; &#51080;&#51004;&#48064;&#47196; &#52280;&#51312;&#47484; &#51201;&#51208;&#55176; &#49688;&#51221;&#54616;&#50668; &#51060;&#51217;&#44540;&#48277;&#51012; &#49892;&#54665; &#48520;&#44032;&#45733;&#54616;&#44172; &#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    OSGi &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54616;&#50668; EJB &#51333;&#49549; &#54637;&#47785;&#51012;&#44396;&#49457;&#54616;&#44144;&#45208; EJB &#52280;&#51312;&#47484; &#49440;&#50616;&#54616;&#50668; &#54644;&#45817; &#52280;&#51312;&#47484; EJB JNDI &#51060;&#47492;&#51004;&#47196; &#47605;&#54609;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#51012;(&#47484;) &#54869;&#51109;&#54624; &#49688; &#50630;&#51004;&#47728; {1} &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; EBA&#47484; &#54869;&#51109;&#54616;&#47140;&#44256; &#49884;&#46020;&#54616;&#45716; &#46041;&#50504; &#54596;&#49688; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#50640; &#53945;&#51221; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#44428;&#54620;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: {0} asset&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. {1} &#54056;&#53412;&#51648;&#50640; &#54840;&#54872; &#48520;&#44032;&#45733;&#54620; &#48260;&#51204; &#50836;&#44396;&#49324;&#54637;&#51060; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    APPLICATION.MF&#51032; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308;&#51032; &#44221;&#50864; &#51452;&#50612;&#51652; &#54056;&#53412;&#51648;&#51032; &#47784;&#46304; &#44032;&#51256;&#50724;&#44592; &#54637;&#47785;&#50640; &#54840;&#54872; &#44032;&#45733;&#54620; &#48260;&#51204; &#50836;&#44396;&#49324;&#54637;&#51060; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#47784;&#46304; &#48264;&#46308;&#50640; &#54840;&#54872; &#44032;&#45733;&#54620; &#54056;&#53412;&#51648; &#48260;&#51204; &#50836;&#44396;&#49324;&#54637;&#51060; &#51080;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#54056;&#53412;&#51669; &#46608;&#45716; &#44396;&#49457;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Run As &#50669;&#54624;&#51008; WebSphere Application Server &#48260;&#51204; 8 &#51060;&#51204;&#51032; &#45432;&#46300;&#50640; &#45824;&#54644; &#44396;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#47784;&#46304; &#44396;&#49457;&#51012; &#47924;&#49884;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    Run As &#50669;&#54624;&#51008; WebSphere Application Server &#48260;&#51204; 8 &#51060;&#49345;&#50640; &#45824;&#54644;&#49436;&#47564; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack &#45824;&#49345;&#50640; &#48176;&#52824;&#46108; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#45824;&#54644; &#44396;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51312;&#52824;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. Run As &#50669;&#54624;&#51012; &#44396;&#49457;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864; WebSphere Application Server &#48260;&#51204; 7 OSGi Applications Feature Pack &#45432;&#46300;&#51032; &#45824;&#49345; &#47605;&#54609;&#51012; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: &#49324;&#50857;&#51088; ID &#46608;&#45716; &#48708;&#48128;&#48264;&#54840;&#44032; &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50732;&#48148;&#47476;&#51648; &#50506;&#51008; &#49324;&#50857;&#51088; ID &#46608;&#45716; &#48708;&#48128;&#48264;&#54840;&#44032; &#51228;&#44277;&#46104;&#50632;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50732;&#48148;&#47480; &#49324;&#50857;&#51088; ID &#48143; &#48708;&#48128;&#48264;&#54840;&#47484; &#49324;&#50857;&#54616;&#50668; &#51312;&#52824;&#47484; &#51116;&#49884;&#46020;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: &#48708;&#51592;&#45768;&#49828; &#47112;&#48296; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {1}&#50640;&#49436; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; {0}&#50640; &#48176;&#52824;&#46108; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#50629;&#45936;&#51060;&#53944; &#51312;&#51089;&#50640; &#49892;&#54056;&#54664;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50629;&#45936;&#51060;&#53944; &#51312;&#51089; &#51473;&#50640; &#50696;&#50808;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#53945;&#51221; &#47928;&#51228;&#51216;&#51012; &#51088;&#49464;&#55176; &#51652;&#45800;&#54616;&#47140;&#47732; &#51060; &#50696;&#50808; &#51060;&#51204;&#51032; &#49436;&#48260; &#47196;&#44536;&#47484; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive) &#54028;&#51068; {0}&#50640; &#51080;&#45716; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#51032; Application-Content &#51077;&#47141;&#51060; &#48708;&#50612; &#51080;&#51004;&#48064;&#47196; &#48264;&#46308;&#51012; &#49444;&#52824;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: EBA &#54028;&#51068; {0}&#51032; Java EE &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51012; &#51069;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#54028;&#51068;&#51032; Java EE &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51012; &#51069;&#45716; &#51473;&#50640; IOException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46356;&#49828;&#53356;&#47549;&#53552; &#54028;&#51068;&#51060; &#49552;&#49345;&#46104;&#51648; &#50506;&#50520;&#44256; &#51069;&#51012; &#49688; &#51080;&#51004;&#47728; &#51201;&#51208;&#54620; &#49324;&#50857; &#44428;&#54620;&#51060; &#49444;&#51221;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: JNDI &#51060;&#47492;&#51060; {0}&#51060;&#44256; &#50976;&#54805;&#51060; {1}&#51064; &#51088;&#50896; &#52280;&#51312;&#47484; &#48260;&#51204;&#51060; {5}&#51064; {4} &#48264;&#46308;&#50640; &#51221;&#51032;&#46108; &#50937; &#47784;&#46280; &#51088;&#50896; &#52280;&#51312; {3}&#51032; {2} &#45824;&#49345;&#50640;&#49436; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    WAR(Web Application Archive)&#50640; &#51088;&#50896; &#52280;&#51312;&#47484; &#54252;&#54632;&#54616;&#45716; EBA(Enterprise Bundle Archive)&#45716; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#50630;&#45716; &#51088;&#50896; &#52280;&#51312;&#51032; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51088;&#50896; &#52280;&#51312;&#44032; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#51080;&#50612;&#50556; &#54616;&#45716; &#44221;&#50864; &#50724;&#48652;&#51229;&#53944;&#47484; &#54644;&#45817; &#51060;&#47492;&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#51088;&#50896; &#52280;&#51312;&#47484; &#51221;&#51221;&#54616;&#44256; EBA&#47484; &#50629;&#45936;&#51060;&#53944;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: &#44032;&#45733;&#54620; &#48148;&#51064;&#46377;&#51060; &#46168; &#51060;&#49345;&#51060;&#48064;&#47196; {3} &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#49324;&#50857;&#54616;&#45716; &#48260;&#51204; {2}&#51032; &#48264;&#46308; {1}&#50640;&#49436; EJB &#52280;&#51312; {0}&#50640; &#45824;&#54620; &#44592;&#48376; &#48148;&#51064;&#46377;&#51012; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#52280;&#51312;&#45716; &#45796;&#51020; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640; &#48148;&#51064;&#46300;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. {4}.
  </MsgText>
  <Explanation>
    &#48148;&#51064;&#46377;&#46104;&#51648; &#50506;&#51008; EJB &#52280;&#51312;&#50640; &#45824;&#54620; &#44592;&#48376; &#48148;&#51064;&#46377;&#51012; &#51089;&#49457;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#52280;&#51312;&#47484; &#48148;&#51064;&#46300;&#54624; &#49688; &#51080;&#45716; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51060; &#46160; &#44060; &#51060;&#49345; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#54644;&#45817; &#52280;&#51312;&#47484; &#53945;&#51221; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: &#51064;&#51613; &#48324;&#47749; {0}&#51032; &#44396;&#49457;&#51060; &#51096;&#47803;&#46104;&#50632;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#51064;&#51613; &#50976;&#54805;&#51012; &#49324;&#50857;&#54616;&#50668; &#52280;&#51312;&#50640; &#48324;&#47749;&#51012; &#48148;&#51064;&#46300;&#54616;&#45716; &#45936; &#51201;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#51064;&#51613; &#50976;&#54805;&#51012; &#49324;&#50857;&#54616;&#50668; Blueprint &#51088;&#50896; &#52280;&#51312;&#50640; &#51064;&#51613; &#48324;&#47749;&#51012; &#48148;&#51064;&#46300;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44288;&#47144;&#46108; &#51088;&#50896; &#52280;&#51312;&#50640;&#49436; &#51064;&#51613; &#48324;&#47749;&#51012; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: {1} &#48264;&#46308;&#50640; &#51648;&#51221;&#46108; &#44032;&#49345; &#54840;&#49828;&#53944; {0}&#51060;(&#44032;) &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#44032;&#49345; &#54840;&#49828;&#53944;&#50640; WAB(Web Application Bundle)&#47484; &#47605;&#54609;&#54616;&#47140;&#44256; &#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; &#44032;&#49345; &#54840;&#49828;&#53944;&#44032; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: EBA &#54028;&#51068; {0} &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#44032; Use-Bundle &#54756;&#45908;&#50640;&#46020; &#54364;&#49884;&#46108; &#48264;&#46308;&#51012; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#54633;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48264;&#46308; &#48260;&#51204;&#50640; &#44288;&#44228; &#50630;&#51060; APPLICATION.MF&#51032; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308; &#51060;&#47492;&#51012; Use-Bundle &#54756;&#45908;&#50640;&#46020; &#54364;&#49884;&#54624; &#49688;&#45716; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Application-Content&#50752; Use-Bundle &#54756;&#45908;&#50640;&#49436; &#48264;&#46308; &#51060;&#47492;&#51060; &#51473;&#48373;&#46104;&#51648; &#50506;&#46020;&#47197; EBA(Enterprise Bundle Archive)&#51032; &#54056;&#53412;&#51669;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: CBA(Composite Bundle Archive) {0}&#51060;(&#44032;) &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;. CBA&#51032; &#48264;&#46308;&#47196; &#44032;&#51256;&#50728; &#54056;&#53412;&#51648;&#44032; CBA Manifest &#54028;&#51068;&#51032; &#54056;&#53412;&#51648; &#44032;&#51256;&#50724;&#44592; &#54756;&#45908;&#50640;&#49436; &#45572;&#46973;&#46104;&#50632;&#49845;&#45768;&#45796;. &#45796;&#51020; &#47928;&#51228;&#51216;&#51060; &#48372;&#44256;&#46104;&#50632;&#49845;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    CBA(Composite Bundle Archive)&#51032; &#48264;&#46308;&#51060; &#48264;&#46308;&#50640; &#54252;&#54632;&#46104;&#51648; &#50506;&#51008; &#54056;&#53412;&#51648; &#46608;&#45716; CBA&#51032; &#45796;&#47480; &#48264;&#46308;&#51060; &#45236;&#48372;&#45240; &#54056;&#53412;&#51648;&#47484; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; CBA&#44032; &#54056;&#53412;&#51648;&#47484; &#44032;&#51256;&#50752;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CBA&#44032; CBA&#51032; &#48264;&#46308;&#51060; &#49324;&#50857;&#54616;&#45716; &#54056;&#53412;&#51648;&#47484; &#44032;&#51256;&#50724;&#46020;&#47197;(&#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#51060; &#54056;&#53412;&#51648;&#45716; CBA&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#50630;&#51020;) &#52980;&#54252;&#51648;&#53944; Manifest, COMPOSITEBUNDLE.MF&#47484; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: &#48260;&#51204; {2}&#51032; &#48264;&#46308; {1}&#50640;&#49436; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean {0}&#51060;(&#44032;) &#54644;&#45817; &#48148;&#51064;&#46377; &#54028;&#51068;&#50640;&#49436; {3} &#51064;&#53552;&#54168;&#51060;&#49828;&#50640; &#45824;&#54644; &#50668;&#47084; &#47605;&#54609;&#51012; &#44054;&#49845;&#45768;&#45796;. &#47605;&#54609;&#51008; {4} &#48143; {5}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48264;&#46308;&#50640; &#54252;&#54632;&#46108; EJB &#48148;&#51064;&#46377; &#54028;&#51068;&#50640; EJB &#51064;&#53552;&#54168;&#51060;&#49828;&#50640; &#45824;&#54620; &#47784;&#54840;&#54620; &#47605;&#54609; &#44396;&#49457; &#51221;&#48372;&#44032; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44033; EJB &#51064;&#53552;&#54168;&#51060;&#49828;&#50640; &#45824;&#54644; &#44396;&#49457;&#46108; &#47605;&#54609;&#51060; &#54616;&#45208;&#47564; &#51316;&#51116;&#54616;&#46020;&#47197; &#48148;&#51064;&#46377; &#54028;&#51068;&#51012; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: &#51060;&#47492;&#51060; {0}&#51064; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#47484; &#54788;&#51116; &#49472;&#50640;&#49436; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#51060;&#47492;&#51060; &#44592;&#51316;&#51032; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; &#51060;&#47492;&#44284; &#51068;&#52824;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#52980;&#54252;&#51648;&#49496; &#45800;&#50948; &#51060;&#47492;&#51012; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: EBA &#54028;&#51068; {0}&#50640; Extension-List &#54756;&#45908;&#44032; &#51080;&#45716; MANIFEST.MF&#44032; &#54252;&#54632;&#46121;&#45768;&#45796;. &#54644;&#45817; &#54756;&#45908;&#51032; &#48320;&#54872;&#51008; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EAR&#50640; Extension-List &#54756;&#45908;&#44032; &#51080;&#45716; MANIFEST.MF&#44032; &#54252;&#54632;&#46104;&#45716;&#45936; EAR(Enterprise Archive) &#54028;&#51068;&#51012; EBA(Enterprise Bundle Archive) &#54028;&#51068;&#47196; &#48320;&#54872;&#54616;&#47140; &#54664;&#49845;&#45768;&#45796;. &#51060; &#54756;&#45908;&#51032; &#48320;&#54872;&#51008; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. EAR &#54028;&#51068;&#51008; Extension-List &#54756;&#45908;&#47484; &#49324;&#50857;&#54616;&#50668; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#47088;&#53440;&#51076; &#49884; &#54596;&#50836;&#47196; &#54616;&#45716; &#50808;&#48512; JAR&#51012; &#49885;&#48324;&#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Extension-List &#54756;&#45908;&#50640; &#45208;&#50676;&#46108; &#50808;&#48512; JAR&#51012; &#48264;&#46308; &#51200;&#51109;&#49548;&#50640;&#49436; Bundle&#47196; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: {0} asset&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#51064; APPLICATION.MF&#51032; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46104;&#51648; &#50506;&#51008; {1} &#48264;&#46308;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;. &#54644;&#45817; &#48264;&#46308;&#51060; {3} &#48264;&#46308;&#50640;&#49436; {2} &#54056;&#53412;&#51648;&#47484; &#44032;&#51256;&#50724;&#45716;&#45936;, &#51060;&#45716; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#50732;&#48148;&#47476;&#44172; &#44396;&#49457;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;. &#44277;&#50976; &#48264;&#46308;&#51008; &#48516;&#47532;&#46108; &#48264;&#46308;&#50640;&#49436; &#54056;&#53412;&#51648;&#47484; &#44032;&#51256;&#50732; &#49688; &#50630;&#49845;&#45768;&#45796;. Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308;&#51008; &#48516;&#47532;&#46104;&#50612; &#51080;&#51004;&#47728; &#54644;&#45817; &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#44592;&#53440; &#48264;&#46308;&#50640;&#47564; &#54056;&#53412;&#51648;&#47484; &#51228;&#44277;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    Use-Bundle &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308; &#46608;&#45716; &#48516;&#49437;&#44592;&#47484; &#53685;&#54644; &#52628;&#44032;&#46108; &#48264;&#46308;&#50640; Application-Content &#54756;&#45908;&#50640; &#54364;&#49884;&#46108; &#48264;&#46308;&#51032; &#54056;&#53412;&#51648;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#54056;&#53412;&#51669; &#46608;&#45716; &#44396;&#49457;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep &#49892;&#54665;&#51012; &#50756;&#47308;&#54644;&#50556; &#54664;&#51004;&#45208; &#49892;&#54665;&#54616;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: &#48372;&#50504; &#46020;&#47700;&#51064; {2}&#51032; {1} &#45824;&#49345; &#48143; &#48372;&#50504; &#46020;&#47700;&#51064; {4}&#51032; {3} &#45824;&#49345; &#46168; &#45796;&#50640; {0} asset&#51012; &#48176;&#52824;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    asset&#51012; &#46168; &#51060;&#49345;&#51032; &#45824;&#49345;&#50640; &#48176;&#52824;&#54616;&#47140;&#47732; &#47784;&#46304; &#45824;&#49345;&#51060; &#46041;&#51068;&#54620; &#48372;&#50504; &#46020;&#47700;&#51064;&#50640; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#48176;&#52824; &#45824;&#49345;&#51060; &#45800;&#51068; &#48372;&#50504; &#46020;&#47700;&#51064;&#50640; &#51080;&#45716; &#49464;&#53944;&#47484; &#49440;&#53469;&#54616;&#46020;&#47197; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: CBA(Composite Bundle Archive) {0}&#51032; &#52980;&#54252;&#51648;&#53944; Manifest&#50640; CompositeBundle-ExportService &#54756;&#45908;&#44032; &#51080;&#51648;&#47564; CBA&#50640; &#51221;&#51032;&#46108; &#49436;&#48708;&#49828;&#44032; &#51060; &#54596;&#53552;&#50752; &#51068;&#52824;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#52980;&#54252;&#51648;&#53944; &#48264;&#46308; Manifest&#45716; CompositeBundle-ExportService &#54756;&#45908;&#47484; &#51221;&#51032;&#54616;&#51648;&#47564; &#48660;&#47336;&#54532;&#47536;&#53944; &#49436;&#48708;&#49828; &#49440;&#50616;&#51060; &#51060; &#54596;&#53552;&#50752; &#51068;&#52824;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#45572;&#46973;&#46108; &#48660;&#47336;&#54532;&#47536;&#53944; &#49436;&#48708;&#49828; &#49440;&#50616;&#51012; CBA &#52968;&#53584;&#52768;&#50640; &#52628;&#44032;&#54616;&#44144;&#45208; &#52980;&#54252;&#51648;&#53944; Manifest, COMPOSITEBUNDLE.MF&#50640;&#49436; CompositeBundle-ExportService &#54756;&#45908;&#47484; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: &#48260;&#51204; {2}&#51032; &#48264;&#46308; {1}&#50640;&#49436; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean {0}&#50640; &#45800;&#49692; &#47605;&#54609; &#51060;&#47492;&#51060; &#51221;&#51032;&#46104;&#50612; &#51080;&#51648;&#47564; &#54644;&#45817; &#48148;&#51064;&#46377; &#54028;&#51068;&#50640;&#46020; &#53945;&#51221; &#47605;&#54609;&#51060; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48264;&#46308;&#50640; &#54252;&#54632;&#46108; EJB &#48148;&#51064;&#46377; &#54028;&#51068;&#50640; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640; &#45824;&#54620; &#51096;&#47803;&#46108; &#47605;&#54609; &#44396;&#49457;&#51060; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#45800;&#49692; &#47605;&#54609; &#51060;&#47492;&#51060;&#45208; &#53945;&#51221; &#47605;&#54609; &#44396;&#49457; &#51221;&#48372; &#51473; &#54616;&#45208;&#47564; &#51316;&#51116;&#54616;&#46020;&#47197; &#48148;&#51064;&#46377; &#54028;&#51068;&#51012; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#46356;&#47113;&#53664;&#47532; &#51060;&#47492;&#51012; &#48148;&#44992; &#49688; &#51080;&#46020;&#47197; {0}&#51032; &#47532;&#54532; &#46356;&#47113;&#53664;&#47532;&#47484; &#49325;&#51228;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. EBA(Enterprise Bundle Archive)&#47484; &#54869;&#51109;&#54624; &#49688; &#50630;&#51004;&#47728; {0}&#50640; &#45824;&#54620; &#44396;&#49457;&#50640; &#51648;&#51221;&#46108; &#54869;&#51109; &#46356;&#47113;&#53664;&#47532;&#44032; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: OSGi Application asset&#51012;  &#50629;&#45936;&#51060;&#53944;&#54616;&#47140; &#54664;&#49845;&#45768;&#45796;. &#51060;&#45716; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. OSGi Application asset&#51008; OSGi Application asset &#44396;&#49457; &#54168;&#51060;&#51648;&#51032; &quot;&#51060; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#48264;&#46308; &#48260;&#51204; &#50629;&#45936;&#51060;&#53944;&quot; &#54056;&#45328;&#51012; &#49324;&#50857;&#54616;&#50668; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#51088;&#49328;&#51012; &#49352; 2&#51652;&#51004;&#47196; &#50629;&#45936;&#51060;&#53944;&#54616;&#45716; &#51089;&#50629;&#51008; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44592;&#51316; &#51088;&#49328;&#50640; &#51080;&#45716; &#48264;&#46308;&#51032; &#48260;&#51204; &#50629;&#45936;&#51060;&#53944; &#50808;&#50640;&#46020; &#49688;&#54665;&#54644;&#50556; &#54616;&#45716; &#51089;&#50629;&#51060; &#51080;&#45716; &#44221;&#50864; &#45824;&#52404;&#49324;&#54637;&#51012; &#44032;&#51256;&#50724;&#44592; &#51204;&#50640; &#51088;&#49328;&#51012; &#49444;&#52824; &#51228;&#44144;&#54644;&#50556; &#54633;&#45768;&#45796;. &#46608;&#45716; &#49352; &#48264;&#46308;&#51012; CBA(Composite Bundle Archive)&#47196; &#54056;&#53412;&#51669;&#54616;&#44256; CBA&#47484; &#54869;&#51109;&#44592;&#45733;&#51004;&#47196; &#52980;&#54252;&#51648;&#49496; &#45800;&#50948;&#50640; &#52628;&#44032;&#54616;&#50668; &#49352; &#48264;&#46308;&#51012; &#44592;&#51316; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#52628;&#44032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: {3} &#45824;&#49345;&#50640;&#49436; &#48260;&#51204; {2}&#51032; &#48264;&#46308; {1}&#50640;&#51080;&#45716; Bean {0}&#50640; &#45824;&#54620; MDB &#54876;&#49457;&#54868; &#49828;&#54169; JNDI &#51060;&#47492;&#51060; &#44396;&#49457;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    MDB &#47532;&#49828;&#45320; &#48148;&#51064;&#46377; ActivationSpec JNDI &#51060;&#47492;&#51060; &#44396;&#49457;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    MDB&#50640; &#45824;&#54620; &#54876;&#49457;&#54868; &#49828;&#54169; JNDI &#52280;&#51312;&#47484; &#44396;&#49457;&#54644;&#50556;&#54633;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: EBA(Enterprise Bundle Archive) &#54028;&#51068; {2}&#47484; &#54869;&#51109;&#54616;&#45716; &#54532;&#47196;&#49464;&#49828;&#51032; &#51068;&#48512;&#47196;&#49436; {0} &#54028;&#51068; &#51060;&#47492;&#51012; {1})(&#51004;)&#47196; &#48148;&#44992; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; EBA &#54028;&#51068;&#51032; &#54869;&#51109;&#51012; &#50756;&#47308;&#54616;&#47140;&#47732; &#54028;&#51068;&#51032; &#51060;&#47492;&#51012; &#48148;&#44984;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51060;&#47492; &#48148;&#44984;&#44592;&#47484; &#49892;&#54056;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#50640; &#54028;&#51068; &#51060;&#47492;&#51012; &#48148;&#44992; &#44428;&#54620;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: CBA(Composite Bundle Archive) {0}&#51060;(&#44032;) &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;. &#52980;&#54252;&#51648;&#53944; Manifest&#50640; &#45208;&#50676;&#46108; &#45796;&#51020;&#44284; &#44057;&#51008; &#45236;&#48372;&#45240; &#54056;&#53412;&#51648;&#45716; CBA&#51032; &#48264;&#46308;&#51060; &#45236;&#48372;&#45236;&#51648; &#50506;&#49845;&#45768;&#45796;. {1}
  </MsgText>
  <Explanation>
    CBA&#45716; CBA&#51032; &#48264;&#46308;&#51060; &#45236;&#48372;&#45240; &#54056;&#53412;&#51648;&#47564; &#45236;&#48372;&#45244; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#45572;&#46973;&#46108; &#45236;&#48372;&#45236;&#44592; &#54056;&#53412;&#51648;&#47484; CBA&#51032; &#48264;&#46308;&#50640; &#52628;&#44032;&#54616;&#44144;&#45208; &#52980;&#54252;&#51648;&#53944; Manifest, COMPOSITEBUNDLE.MF&#50640;&#49436; &#52376;&#47532;&#46104;&#51648; &#50506;&#51008; &#45236;&#48372;&#45236;&#44592;&#51032; &#49464;&#48512;&#49324;&#54637;&#51012; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: &#54596;&#50836;&#54620; &#48264;&#46308;&#51012; &#45796;&#50868;&#47196;&#46300;&#54616;&#51648; &#50506;&#50500;&#49436; {0} asset&#51012; &#52628;&#44032;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#48264;&#46308; &#45796;&#50868;&#47196;&#46300;&#47484; &#49884;&#51089;&#54616;&#47140;&#47732; asset&#51012; &#44032;&#51256;&#50728; &#54980; &#47560;&#49828;&#53552; &#44396;&#49457;&#51032; &#48320;&#44221;&#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#49901;&#49884;&#50724;.
  </MsgText>
  <Explanation>
    &#54616;&#45208; &#51060;&#49345;&#51032; &#48264;&#46308;&#51012; &#51200;&#51109;&#49548;&#50640;&#49436; &#45796;&#50868;&#47196;&#46300;&#54644;&#50556; &#54616;&#45716; asset&#51012; &#52628;&#44032;&#54616;&#47140;&#44256; &#54664;&#49845;&#45768;&#45796;. &#45796;&#50868;&#47196;&#46300;&#44032; &#49884;&#51089;&#46104;&#51648; &#50506;&#50520;&#44144;&#45208; &#50500;&#51649; &#50756;&#47308;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    asset&#51012; &#44032;&#51256;&#50728; &#54980; &#48320;&#44221;&#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#51648; &#50506;&#50520;&#51004;&#47732; &#51648;&#44552; &#51200;&#51109;&#54616;&#49901;&#49884;&#50724;. &#48264;&#46308; &#45796;&#50868;&#47196;&#46300;&#44032; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#45824;&#44592;&#54620; &#54980; BLA(Business Level Application)&#50640; asset&#51012; &#45796;&#49884; &#52628;&#44032;&#54616;&#49901;&#49884;&#50724;. &#44288;&#47532; &#53080;&#49556;&#51012; &#53685;&#54644; asset &#49464;&#48512;&#49324;&#54637; &#54056;&#45328;&#50640;&#49436; asset&#51032; &#48264;&#46308;&#51060; &#45796;&#50868;&#47196;&#46300;&#46104;&#45716; &#49345;&#53468;&#47484; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: &#48176;&#52824; Manifest &#52968;&#53584;&#52768;&#44032; &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;. &#45796;&#51020; &#52628;&#44032; &#48264;&#46308;&#51008; &#54596;&#49688; {0}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#44032;&#51256;&#50732; &#48176;&#52824; Manifest&#50640; EBA(Enterprise Bundle Archive) &#51088;&#49328;&#51012; &#54644;&#49437;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#47784;&#46304; &#48264;&#46308;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50696;&#50808; &#47700;&#49884;&#51648;&#50640; &#45208;&#50676;&#46108; &#47784;&#46304; &#48264;&#46308;&#51060; &#49352; &#48176;&#52824; Manifest, DEPLOYMENT.MF&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#48176;&#52824; Manifest&#47484; &#49688;&#46041;&#51004;&#47196; &#54200;&#51665;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#54596;&#50836;&#54620; &#44221;&#50864; EBA&#50640;&#49436; &#48176;&#52824; Manifest&#47484; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. &#44536;&#47084;&#47732; EBA&#47484; &#44032;&#51256;&#50732; &#46412; &#49352; &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: {0} &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#49828;&#53664;&#47532;&#51648;&#44032; &#51080;&#44256; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#49324;&#50857; &#44428;&#54620;&#51060; &#51228;&#54408;&#50640; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: &#54596;&#50836;&#54620; {1} &#48264;&#46308;&#51060; &#51204;&#48512; &#45796;&#50868;&#47196;&#46300;&#46104;&#51648; &#50506;&#50500;&#49436; {0} &#51088;&#49328;&#51012; &#45236;&#48372;&#45244; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#54616;&#45208; &#51060;&#49345;&#51032; &#48264;&#46308;&#51012; &#51200;&#51109;&#49548;&#50640;&#49436; &#45796;&#50868;&#47196;&#46300;&#54644;&#50556; &#54616;&#45716; &#51088;&#49328;&#51012; &#52628;&#44032;&#54616;&#47140;&#44256; &#54664;&#49845;&#45768;&#45796;. &#45796;&#50868;&#47196;&#46300;&#44032; &#49884;&#51089;&#46104;&#51648; &#50506;&#50520;&#44144;&#45208; &#50500;&#51649; &#50756;&#47308;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51088;&#49328;&#51012; &#44032;&#51256;&#50728; &#54980; &#48320;&#44221;&#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#51648; &#50506;&#50520;&#51004;&#47732; &#51648;&#44552; &#51200;&#51109;&#54616;&#49901;&#49884;&#50724;. &#48264;&#46308;&#51060; &#45796;&#50868;&#47196;&#46300;&#46112; &#46412;&#44620;&#51648; &#45824;&#44592;&#54620; &#54980; &#51088;&#49328; &#45236;&#48372;&#45236;&#44592;&#47484; &#45796;&#49884; &#49884;&#46020;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. DeploymentManifestManager &#49436;&#48708;&#49828;&#47484; OSGi Service Registry&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: EBA &#54028;&#51068;&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54252;&#54632;&#46108; &#48176;&#52824; Manifest&#44032; &#51060; &#49884;&#49828;&#53596;&#50640;&#49436; &#50976;&#54952;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#50696;&#50808;: {0}
  </MsgText>
  <Explanation>
    &#48176;&#52824; Manifest&#45716; &#53945;&#51221; &#48260;&#51204;&#51032; &#54596;&#49688; &#48264;&#46308;&#51012; &#45208;&#50676;&#54633;&#45768;&#45796;. &#49884;&#49828;&#53596;&#51060; &#51060;&#47084;&#54620; &#48264;&#46308; &#48260;&#51204;&#51012; &#54644;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. EBA &#54028;&#51068;&#50640; &#48176;&#52824; Manifest&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#45716; &#44221;&#50864; &#48516;&#49437;&#44592;&#45716; Manifest&#50640; &#51648;&#51221;&#46108; &#48264;&#46308; &#48260;&#51204;&#47564; &#49324;&#50857;&#54633;&#45768;&#45796;. &#49884;&#49828;&#53596;&#50640; &#49324;&#50857; &#44032;&#45733;&#54620; &#44592;&#53440; &#50976;&#54952;&#54620; &#48264;&#46308; &#48260;&#51204;&#51060; &#51080;&#51004;&#45208; &#48176;&#52824; Manifest&#50640; &#51648;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51004;&#48064;&#47196; &#54644;&#45817; &#48260;&#51204;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#48176;&#52824; Manifest&#47484; &#49324;&#50857;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864;(&#50696;, &#50668;&#47084; &#54872;&#44221;&#50640;&#49436; &#46041;&#51068;&#54620; &#48264;&#46308; &#44396;&#49457;&#51012; &#49324;&#50857;&#54616;&#47140;&#45716; &#44221;&#50864;), &#50696;&#50808;&#50640; &#51080;&#45716; &#51221;&#48372;&#47484; &#49324;&#50857;&#54616;&#50668; &#54596;&#50836;&#54620; &#48264;&#46308; &#48260;&#51204;&#51012; &#49885;&#48324;&#54620; &#45796;&#51020; &#49884;&#49828;&#53596;&#50640;&#49436; &#51060;&#47484; &#49324;&#50857;&#54616;&#46020;&#47197; &#49444;&#51221;&#54616;&#49901;&#49884;&#50724;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#51060;&#47084;&#54620; &#52628;&#44032; &#51228;&#50612; &#47112;&#48296;&#51060; &#54596;&#50836;&#54616;&#51648; &#50506;&#51008; &#44221;&#50864;, &#48176;&#52824; Manifest&#47484; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. &#48176;&#52824; Manifest&#47484; &#49688;&#46041;&#51004;&#47196; &#54200;&#51665;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#48260;&#51204; {0}&#50640; &#45824;&#54644; &#51648;&#51221;&#46108; &#44050;&#51008; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51648;&#50896;&#46104;&#45716; &#48260;&#51204;&#51008; {1}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    APPLICATION.MF&#51032; Application-ManifestVersion &#54756;&#45908;&#50640; &#45824;&#54644; &#51648;&#51221;&#46108; &#44050;&#51060; &#50732;&#48148;&#47476;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    APPLICATION.MF&#51032; Application-ManifestVersion &#44050;&#51012; &#51221;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: EBA&#51032; &#48176;&#52824; Manifest&#50640;&#49436; &#51648;&#51221;&#54620; &#50836;&#44396;&#49324;&#54637;&#51012; &#52649;&#51313;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#49373;&#49457;&#46108; &#50696;&#50808;&#45716; {0}&#51077;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#51080;&#45716; EBA&#47484; &#44032;&#51256;&#50724;&#47140;&#44256; &#49884;&#46020;&#54664;&#49845;&#45768;&#45796;. &#51060; &#54028;&#51068;&#50640;&#49436; &#51648;&#51221;&#54620; &#50836;&#44396;&#49324;&#54637;&#51012; &#52649;&#51313;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#48176;&#52824; Manifest &#54028;&#51068;&#51032; &#52968;&#53584;&#52768;&#47484; &#54869;&#51064;&#54616;&#44256; EBA&#47484; &#48176;&#52824;&#54624; &#49884;&#49828;&#53596;&#50640;&#49436; &#54840;&#54872; &#44032;&#45733;&#54620;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#54596;&#49688; &#45236;&#48512; &#46608;&#45716; &#50808;&#48512; &#48264;&#46308; &#51200;&#51109;&#49548;&#44032; &#44396;&#49457;&#46104;&#50612; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#48176;&#52824; Manifest&#47484; &#49688;&#46041;&#51004;&#47196; &#54200;&#51665;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#54596;&#50836;&#54620; &#44221;&#50864; EBA&#50640;&#49436; &#48176;&#52824; Manifest&#47484; &#51228;&#44144;&#54616;&#49901;&#49884;&#50724;. &#44536;&#47084;&#47732; EBA&#47484; &#44032;&#51256;&#50732; &#46412; &#49352; &#48176;&#52824; Manifest &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: EBA &#54028;&#51068; {0}&#51060;(&#44032;) &#54644;&#45817; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#51032; Application-Content&#47484; &#51648;&#51221;&#54616;&#51648;&#47564; &#54644;&#45817; &#51077;&#47141;&#51060; &#48708;&#50612; &#51080;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#54028;&#51068;&#50640; &#54644;&#45817; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest&#51064; application.mf&#51032; &#48708;&#50612; &#51080;&#45716; Application-Content &#54756;&#45908;&#44032; &#51080;&#49845;&#45768;&#45796;. &#51228;&#44277;&#46108; &#44221;&#50864; &#54644;&#45817; &#51077;&#47141;&#50640;&#49436; &#54616;&#45208; &#51060;&#49345;&#51032; &#50976;&#54952;&#54620; &#48264;&#46308;&#51012; &#45208;&#50676;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    application.mf &#54028;&#51068;&#51032; Application-Content &#54756;&#45908;&#47484; &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: &#48260;&#51204; {4}&#51032; &#48264;&#46308; {3}&#50640; &#51080;&#45716; Bean {2}&#50640; &#49324;&#50857;&#46104;&#45716; &#51088;&#50896;&#51032; &#45824;&#49345; {1}&#50640;&#49436; JNDI &#51060;&#47492; {0}&#44284;(&#50752;) &#51068;&#52824;&#54616;&#45716; MDB &#45824;&#49345;&#51012; &#52286;&#51012; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; MDB &#47532;&#49828;&#45320; &#48148;&#51064;&#46377; &#45824;&#49345; &#52280;&#51312; JNDI &#51060;&#47492;&#51060; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#52280;&#51312;&#44032; JNDI &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#50640; &#51080;&#50612;&#50556;&#54616;&#45716; &#44221;&#50864; &#50724;&#48652;&#51229;&#53944;&#47484; &#54644;&#45817; &#51060;&#47492;&#50640; &#48148;&#51064;&#46300;&#54616;&#44144;&#45208; &#52280;&#51312;&#47484; &#51221;&#51221;&#54616;&#44256; EBA&#47484; &#50629;&#45936;&#51060;&#53944;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: EBA &#54028;&#51068; {0}&#51060;(&#44032;) Application-Content&#47484; &#51648;&#51221;&#54616;&#51648; &#50506;&#50500;&#49436; &#50976;&#54952;&#54620; &#48264;&#46308;&#51060; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    EBA(Enterprise Bundle Archive) &#54028;&#51068;&#51008; &#54616;&#45208; &#51060;&#49345;&#51032; &#50976;&#54952;&#54620; OSGi Bundle &#46608;&#45716; WAR(Web Application Archive) &#54028;&#51068;&#51012; &#54252;&#54632;&#54616;&#44144;&#45208; &#54644;&#45817; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#54028;&#51068;&#51032; Application-Content &#54756;&#45908;&#50640; &#54616;&#45208; &#51060;&#49345;&#51032; OSGi &#48264;&#46308;&#51012; &#45208;&#50676;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    EBA &#54028;&#51068;&#51060; &#54616;&#45208; &#51060;&#49345;&#51032; &#50976;&#54952;&#54620; &#48264;&#46308; &#46608;&#45716; WAR&#51012; &#54252;&#54632;&#54616;&#44144;&#45208;(&#44050;&#51012; &#53685;&#54644; &#54252;&#54632;) &#54644;&#45817; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; Manifest &#54028;&#51068;&#51064; application.mf&#51032; Application-Content &#54756;&#45908;&#50640; &#54616;&#45208; &#51060;&#49345;&#51032; &#48264;&#46308;&#51012; &#45208;&#50676;&#54616;&#46020;&#47197;(&#52280;&#51312;&#47484; &#53685;&#54644; &#54252;&#54632;) &#49688;&#51221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: &#45796;&#51020; &#46356;&#47113;&#53664;&#47532;&#47484; &#51089;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. {0}
  </MsgText>
  <Explanation>
    &#51088;&#49328;&#51012; &#45236;&#48372;&#45236;&#45716; &#45936; &#54596;&#50836;&#54620; &#44221;&#47196; &#51060;&#47492;&#51012; &#51089;&#49457;&#54616;&#45716; &#51473;&#50640; &#47928;&#51228;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#50640; &#51060; &#44221;&#47196; &#51060;&#47492;&#51012; &#51089;&#49457;&#54624; &#44428;&#54620;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
