<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49436;&#48708;&#49828; &#54596;&#53552;&#47484; &#44396;&#47928; &#48516;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48260;&#51204; {1}&#51032; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; {0}&#51060;(&#44032;) &#51088;&#50896;&#51012; &#50836;&#52397;&#54624; &#49688; &#51080;&#45716; &#50976;&#54952;&#54620; &#49345;&#53468;&#44032; &#50500;&#45785;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#49436;&#48708;&#49828; &#54596;&#53552;&#47484; &#44396;&#47928; &#48516;&#49437;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: &#48260;&#51204;&#51060; {2}&#51064; Web Bundle {1}&#51060;(&#44032;) &#51060;&#47492;&#51060; {0}&#51064; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#47484; &#50668;&#47084; &#44060; &#52286;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    OSGi JPA &#52968;&#53580;&#51060;&#45320;&#44032; &#51060;&#47492;&#51060; &#44057;&#51008; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#47484; &#50668;&#47084; &#44060; &#52286;&#50520;&#49845;&#45768;&#45796;. &#50976;&#54952;&#54620; &#44396;&#49457;&#51060; &#50500;&#45768;&#47728; &#51068;&#44288;&#46104;&#51648; &#50506;&#51008; &#44208;&#44284;&#47484; &#52488;&#47000;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44057;&#51008; &#51060;&#47492;&#51032; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#47484; &#50668;&#47084; &#44060; &#51221;&#51032;&#54616;&#45716; Bundle&#51060; &#54252;&#54632;&#46104;&#51648; &#50506;&#46020;&#47197; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: &#48260;&#51204;&#51060; {1}&#51064; OSGi Web Bundle {0}&#51060;(&#44032;) &#54869;&#51109;&#46108; &#48276;&#50948;&#51032; &#44288;&#47532; JPA &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944; {2}&#50640; &#45824;&#54620; &#51333;&#49549;&#49457;&#51012; &#51221;&#51032;&#54633;&#45768;&#45796;. &#54869;&#51109;&#46108; &#48276;&#50948; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#45716; OSGi JPA &#52968;&#53580;&#51060;&#45320;&#50640;&#49436; &#51648;&#50896;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#54869;&#51109;&#46108; &#48276;&#50948; JPA &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#50640; &#45824;&#54644; &#51333;&#49549;&#49457;&#51012; &#49440;&#50616;&#54644;&#50472;&#47564; &#54869;&#51109;&#46108; &#48276;&#50948; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#44032; OSGi JPA &#52968;&#53580;&#51060;&#45320;&#50640;&#49436; &#51648;&#50896;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#44288;&#47532; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#46608;&#45716; &#53944;&#47004;&#51117;&#49496; &#48276;&#50948; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944;&#47484; &#49324;&#50857;&#54616;&#46020;&#47197; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#47088;&#53440;&#51076; &#54872;&#44221;&#51060; &#51648;&#49549;&#49457; &#52968;&#53581;&#49828;&#53944; &#51648;&#50896;&#51012; &#52488;&#44592;&#54868;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: &#48260;&#51204; {2}&#51032; Web Bundle {1}&#51060;(&#44032;) &#51060;&#47492;&#51060; {0}&#51064; &#51648;&#49549;&#49457; &#45800;&#50948;&#47484; &#50668;&#47084; &#44060; &#48156;&#44204;&#54664;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    OSGi JPA &#52968;&#53580;&#51060;&#45320;&#44032; &#46041;&#51068;&#54620; &#51060;&#47492;&#51012; &#44054;&#45716; &#50668;&#47084; &#44060;&#51032; &#51648;&#49549;&#49457; &#45800;&#50948;&#47484; &#52286;&#50520;&#49845;&#45768;&#45796;. &#50976;&#54952;&#54620; &#44396;&#49457;&#51060; &#50500;&#45768;&#47728; &#51068;&#44288;&#46104;&#51648; &#50506;&#51008; &#44208;&#44284;&#47484; &#52488;&#47000;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#46041;&#51068;&#54620; &#51060;&#47492;&#51032; &#51648;&#49549;&#49457; &#45800;&#50948;&#47484; &#50668;&#47084; &#44060; &#51221;&#51032;&#54616;&#45716; Bundle&#51060; &#54252;&#54632;&#46104;&#51648; &#50506;&#46020;&#47197; OSGi &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#48320;&#44221;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
