<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48373;&#54633; &#48264;&#46308; Manifest&#45716; &#54616;&#45208;&#51032; Bundle-SymbolicName &#54637;&#47785;&#47564;&#51012; &#54252;&#54632;&#54644;&#50556; &#54633;&#45768;&#45796;. {0} &#54637;&#47785;&#51012; &#52286;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; &#52980;&#54252;&#51648;&#53944; &#48264;&#46308;&#51032; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#52376;&#47532;&#54616;&#46020;&#47197; &#49884;&#46020;&#54664;&#51648;&#47564; &#48264;&#46308;&#51032; &#44592;&#54840; &#51060;&#47492;&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: ID&#44032; {1}&#51064; &#50836;&#49548;&#50640; &#45824;&#54620; Blueprint &#54596;&#53552; &#47928;&#51088;&#50676; &apos;&apos;{0}&apos;&apos;&#51012;(&#47484;) &#44396;&#47928; &#48516;&#49437;&#54616;&#47140;&#44256; &#49884;&#46020;&#54616;&#45716; &#51473;&#50640; &#44396;&#47928; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. {2}
  </MsgText>
  <Explanation>
    &#51648;&#51221;&#46108; ID&#47484; &#44032;&#51652; &#50836;&#49548;&#50640; &#45824;&#54620; &#54596;&#53552; &#47928;&#51088;&#50676;&#51012; &#44396;&#47928; &#48516;&#49437;&#54616;&#47140;&#44256; &#49884;&#46020;&#54616;&#45716; &#51473;&#50640; InvalidSyntaxException&#51060; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#51648;&#51221;&#46108; ID&#50640; &#45824;&#54620; &#54596;&#53552; &#47928;&#51088;&#50676;&#51032; &#44396;&#47928;&#51060; &#50732;&#48148;&#47480;&#51648; &#44160;&#49324;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#48264;&#46308; Manifest&#45716; &#54616;&#45208;&#51032; Bundle-SymbolicName &#54637;&#47785;&#47564;&#51012; &#54252;&#54632;&#54644;&#50556; &#54633;&#45768;&#45796;. {0} &#54637;&#47785;&#51012; &#52286;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47088;&#53440;&#51076; &#49884; &#48264;&#46308;&#51032; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#52376;&#47532;&#54616;&#46020;&#47197; &#49884;&#46020;&#54664;&#51004;&#47728; &#48264;&#46308;&#51032; &#44592;&#54840; &#51060;&#47492;&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#50632;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. Bundle &#45800;&#54200; Manifest&#45716; &#54616;&#45208;&#51032; Fragment-Host &#54637;&#47785;&#47564;&#51012; &#51221;&#51032;&#54644;&#50556; &#54633;&#45768;&#45796;. {0} &#54637;&#47785;&#51012; &#52286;&#50520;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#47088;&#53440;&#51076; &#54872;&#44221;&#50640;&#49436; Bundle &#45800;&#54200;&#51032; &#47700;&#53440;&#45936;&#51060;&#53552;&#47484; &#52376;&#47532;&#54616;&#46020;&#47197; &#49884;&#46020;&#54664;&#51648;&#47564; &#45800;&#54200;&#51032; &#54840;&#49828;&#53944; &#48264;&#46308;&#51012; &#54032;&#48324;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#44592;&#54840; &#51060;&#47492;&#51060; {0}&#51060;&#44256; Manifest &#48260;&#51204;&#51060; {1}&#51064; &#52980;&#54252;&#51648;&#53944; &#48264;&#46308;&#51012; &#52376;&#47532;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#52980;&#54252;&#51648;&#53944; &#48264;&#46308; Manifest&#45716; &#50976;&#54952;&#54620; Bundle-SymbolicName&#44284; CompositeBundle-ManifestVersion &#54637;&#47785; &#47784;&#46160;&#47484; &#54252;&#54632;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47784;&#46304; &#48373;&#54633; &#48264;&#46308;&#51060; &#54644;&#45817; Manifest &#54028;&#51068;&#50640; &#50976;&#54952;&#54620; Bundle-SymbolicName &#48143; CompositeBundle-ManifestVersion &#54637;&#47785;&#51012; &#54252;&#54632;&#54616;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: &#45236;&#48512; &#50724;&#47448;&#44032; &#48156;&#49373;&#54664;&#49845;&#45768;&#45796;. &#44592;&#54840; &#51060;&#47492;&#51060; {0}&#51060;&#44256; Manifest &#48260;&#51204;&#51060; {1}&#51064; &#48264;&#46308;&#51012; &#52376;&#47532;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
  </MsgText>
  <Explanation>
    &#48264;&#46308; Manifest&#45716; &#50976;&#54952;&#54620; Bundle-SymbolicName&#44284; Bundle-ManifestVersion &#54637;&#47785; &#47784;&#46160;&#47484; &#54252;&#54632;&#54644;&#50556; &#54633;&#45768;&#45796;.
  </Explanation>
  <UserResponse>
    &#47784;&#46304; &#48264;&#46308;&#51060; &#54644;&#45817; Manifest &#54028;&#51068;&#50640; &#50976;&#54952;&#54620; Bundle-SymbolicName &#48143; Bundle-ManifestVersion &#54637;&#47785;&#51012; &#54252;&#54632;&#54616;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
