<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: Do&#353;lo k intern&#237; chyb&#283;. Slo&#382;en&#253; soubor typu manifest pro objekt bundle mus&#237; obsahovat pr&#225;v&#283; jednu polo&#382;ku Bundle-SymbolicName. Byla nalezena n&#225;sleduj&#237;c&#237; polo&#382;ka: {0}
  </MsgText>
  <Explanation>
    B&#283;hov&#233; prost&#345;ed&#237; se pokusilo zpracovat metadata pro slo&#382;en&#253; objekt bundle, nepoda&#345;ilo se mu v&#353;ak ur&#269;it symbolick&#253; n&#225;zev objektu bundle.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: Do&#353;lo k chyb&#283; syntaxe p&#345;i pokusu o anal&#253;zu &#345;et&#283;zce filtru blueprint &apos;&apos;{0}&apos;&apos; pro prvek s ID {1}: {2}
  </MsgText>
  <Explanation>
    Byla vr&#225;cena v&#253;jimka InvalidSyntaxException p&#345;i pokusu o anal&#253;zu &#345;et&#283;zce filtru pro prvek se zadan&#253;m ID.
  </Explanation>
  <UserResponse>
    Zkontrolujte, zda je &#345;et&#283;zec filtru pro zadan&#233; ID syntakticky spr&#225;vn&#253;.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: Do&#353;lo k intern&#237; chyb&#283;. Soubor typu manifest pro objekt bundle mus&#237; obsahovat pr&#225;v&#283; jednu polo&#382;ku Bundle-SymbolicName. Byla nalezena n&#225;sleduj&#237;c&#237; polo&#382;ka: {0}
  </MsgText>
  <Explanation>
    B&#283;hov&#233; prost&#345;ed&#237; se pokusilo zpracovat metadata pro objekt bundle, ale nemohla ur&#269;it symbolick&#253; n&#225;zev objektu bundle.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: Do&#353;lo k intern&#237; chyb&#283;. Soubor typu manifest pro fragment objektu bundle mus&#237; definovat pr&#225;v&#283; jednu polo&#382;ku Fragment-Host. Byla nalezena n&#225;sleduj&#237;c&#237; polo&#382;ka: {0}
  </MsgText>
  <Explanation>
    B&#283;hov&#233; prost&#345;ed&#237; se pokusilo zpracovat metadata pro fragment objektu bundle, nepoda&#345;ilo se mu v&#353;ak ur&#269;it objekt bundle hostitele fragmentu.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: Do&#353;lo k intern&#237; chyb&#283;. Slo&#382;en&#253; objekt bundle se symbolick&#253;m n&#225;zvem {0} a verz&#237; souboru typu manifest {1} nebylo mo&#382;n&#233; zpracovat.
  </MsgText>
  <Explanation>
    Soubor typu manifest pro slo&#382;en&#253; objekt bundle mus&#237; obsahovat platn&#233; polo&#382;ky Bundle-SymbolicName a CompositeBundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e v&#353;echny slo&#382;en&#233; objekty bundle obsahuj&#237; v souborech typu manifest platn&#233; polo&#382;ky Bundle-SymbolicName a CompositeBundle-ManifestVersion.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: Do&#353;lo k intern&#237; chyb&#283;. Objekt bundle se symbolick&#253;m n&#225;zvem {0} a verz&#237; souboru typu manifest {1} nebylo mo&#382;n&#233; zpracovat.
  </MsgText>
  <Explanation>
    Soubor typu manifest pro objekt bundle mus&#237; obsahovat platn&#233; polo&#382;ky Bundle-SymbolicName a Bundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e v&#353;echny objekty bundle obsahuj&#237; v souborech typu manifest platn&#233; polo&#382;ky Bundle-SymbolicName a Bundle-ManifestVersion.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
