<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: Rozpozn&#225;n&#237; aktiva {0} indikuje neplatn&#233; z&#225;vislosti sd&#237;len&#233;ho obsahu na obsahu aplikac&#237;: {1}
  </MsgText>
  <Explanation>
    Objekty bundle aplikac&#237; nemohou poskytovat bal&#237;ky nebo slu&#382;by pro sd&#237;len&#233; objekty bundle. D&#225;le nelze objekty bundle implementovat jako sd&#237;len&#233; objekty bundle i jako objekty bundle aplikac&#237;. Implementace, kter&#225; vy&#382;aduje sd&#237;len&#233; objekty bundle z&#225;visej&#237;c&#237; na objektech bundle aplikac&#237;, je neplatn&#225;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e aplikace vy&#382;aduje v&#353;echny neplatn&#233; sd&#237;len&#233; objekty bundle. Pokud tomu tak je, ujist&#283;te se, &#382;e nez&#225;vis&#237; na obsahu aplikace.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: Nelze na&#269;&#237;st soubor typu manifest pro objekt bundle pro soubor JAR {0} v souboru EBA {1}.
  </MsgText>
  <Explanation>
    P&#345;i vyhled&#225;n&#237; souboru typu manifest souboru JAR v souboru EBA (Enterprise Bundle Archive) se vyskytla v&#253;jimka I/O. Soubor m&#367;&#382;e b&#253;t po&#353;kozen&#253; nebo nen&#237; &#269;iteln&#253;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda m&#225; dan&#253; soubor odpov&#237;daj&#237;c&#237; opr&#225;vn&#283;n&#237; a zda je uveden ve spr&#225;vn&#233;m form&#225;tu.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Do&#353;lo k intern&#237; chyb&#283;. Slu&#382;ba zaji&#353;&#357;ov&#225;n&#237; {0} nen&#237; dostupn&#225;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: Aplikace OSGi implementovan&#225; v kompozi&#269;n&#237; jednotce {0} v aplikaci BLA {1} nebyla spu&#353;t&#283;na.
  </MsgText>
  <Explanation>
    B&#283;hem operace spou&#353;t&#283;n&#237; do&#353;lo k v&#253;jimce.
  </Explanation>
  <UserResponse>
    V protokolech serveru, kter&#233; p&#345;edch&#225;zely t&#233;to v&#253;jimce, vyhledejte p&#345;esn&#283;j&#353;&#237; diagnostiku probl&#233;mu.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: Soubor EBA (Enterprise Bundle Archive) {1} obsahuje adres&#225;&#345; {0}, kter&#253; nen&#237; podporov&#225;n.
  </MsgText>
  <Explanation>
    Ur&#269;en&#253; soubor EBA obsahuje adres&#225;&#345; s n&#225;zvem byValue nebo byReference. &#381;&#225;dn&#253; z t&#283;chto n&#225;zv&#367; adres&#225;&#345;&#367; nen&#237; v ko&#345;enov&#233;m adres&#225;&#345;i souboru EBA podporov&#225;n.
  </Explanation>
  <UserResponse>
    P&#345;&#237;slu&#353;n&#253; adres&#225;&#345; bu&#271; odeberte, nebo p&#345;ejmenujte.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: Uveden&#225; role {0} neexistuje.
  </MsgText>
  <Explanation>
    Byl proveden pokus o mapov&#225;n&#237; u&#382;ivatel&#367; nebo skupin na neexistuj&#237;c&#237; roli zabezpe&#269;en&#237;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda uveden&#225; role zabezpe&#269;en&#237; existuje, a p&#345;&#237;padn&#283; tuto roli v aplikaci vytvo&#345;te.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: Soubor typu manifest implementace, kter&#253; m&#225; b&#253;t importov&#225;n, nen&#237; platn&#253; pro aktivum {0}, proto&#382;e nespl&#328;uje po&#382;adavky uveden&#233; v souboru typu manifest aplikace.
  </MsgText>
  <Explanation>
    Soubor typu manifest implementace DEPLOYMENT.MF nen&#237; kompatibiln&#237; s manifestem aplikace APPLICATION.MF dan&#233;ho aktiva.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda nov&#253; soubor typu manifest implementace spl&#328;uje n&#225;sleduj&#237;c&#237; po&#382;adavky: 
   1. Hodnoty Application-SymbolicName a Application-Version v souboru DEPLOYMENT.MF se mus&#237; shodovat s odpov&#237;daj&#237;c&#237;mi polo&#382;kami v souboru APPLICATION.MF.
 2. Objekty bundle uveden&#233; v z&#225;hlav&#237; Deployed-Content v souboru DEPLOYMENT.MF se mus&#237; shodovat s objekty bundle uveden&#253;mi v z&#225;hlav&#237; Application-Content souboru APPLICATION.MF. 
 3. Verze objektu bundle v z&#225;hlav&#237; Deployed-Content v souboru DEPLOYMENT.MF mus&#237; spadat do rozsahu verz&#237; pro odpov&#237;daj&#237;c&#237; objekt bundle v souboru APPLICATION.MF.
 4. Objekty bundle uveden&#233; v z&#225;hlav&#237; Deployed-Use-Bundle souboru DEPLOYMENT.MF mus&#237; b&#253;t uvedeny tak&#233; v z&#225;hlav&#237; Use-Bundle souboru APPLICATION.MF.
   5. Verze objektu bundle v z&#225;hlav&#237; Deployed-Use-Bundle souboru DEPLOYMENT.MF mus&#237; spadat do rozsahu verz&#237; pro odpov&#237;daj&#237;c&#237; objekt bundle v z&#225;hlav&#237; Use-Bundle souboru APPLICATION.MF.
 Neimplementujte soubor typu manifest ru&#269;n&#283;. V p&#345;&#237;pad&#283; pot&#345;eby odeberte soubor typu manifest implementace ze souboru EBA. P&#345;i importov&#225;n&#237; souboru EBA tak dojde k vygenerov&#225;n&#237; nov&#233;ho souboru typu manifest implementace.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: Vybran&#233; verze objekt&#367; bundle nelze rozpoznat nebo nejsou vz&#225;jemn&#283; kompatibiln&#237;.
  </MsgText>
  <Explanation>
    Syst&#233;m nedok&#225;&#382;e rozpoznat vybran&#233; verze objekt&#367; bundle. Je mo&#382;n&#233;, &#382;e u t&#283;chto objekt&#367; bundle chyb&#283;j&#237; n&#283;kter&#233; z&#225;vislosti, &#382;e nejsou kompatibiln&#237; anebo neexistuj&#237;.
  </Explanation>
  <UserResponse>
    Upravte vybranou sadu vstupn&#237;ch objekt&#367; bundle a zkuste operaci prov&#233;st znovu. Stav aktiva nebo jeho n&#225;hled lze sledovat prost&#345;ednictv&#237;m administrativn&#237; konzoly.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: U&#382;ivatel {0} nen&#237; mapovan&#253;m u&#382;ivatelem ani &#269;lenem skupiny mapovan&#233; pro roli {1}.
  </MsgText>
  <Explanation>
    Kter&#253;koli ur&#269;en&#253; u&#382;ivatel mus&#237; b&#253;t mapovan&#253;m u&#382;ivatelem v r&#225;mci role zabezpe&#269;en&#237; nebo b&#253;t &#269;lenem mapovan&#233; skupiny v r&#225;mci role zabezpe&#269;en&#237;. Ur&#269;en&#253; u&#382;ivatel nesplnil &#382;&#225;dnou z t&#283;chto podm&#237;nek.
  </Explanation>
  <UserResponse>
    Konfigurujte mapov&#225;n&#237; role zabezpe&#269;en&#237; na u&#382;ivatele &#269;i skupinu, aby ur&#269;en&#253; u&#382;ivatel mohl vystupovat v ur&#269;en&#233; roli, nebo ur&#269;ete jin&#233;ho u&#382;ivatele, kter&#253; ji&#382; disponuje vy&#382;adovan&#253;mi opr&#225;vn&#283;n&#237;mi.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: Aplikace {0} obsahuje v z&#225;hlav&#237; Application-Content jeden nebo v&#237;ce archiv&#367; slo&#382;en&#253;ch objekt&#367; bundle (CBA) {1}. Tato situace nen&#237; pro bal&#237;k funkc&#237; OSGi Applications Feature Pack pro produkt WebSphere Application Server verze 7 podporov&#225;na.
  </MsgText>
  <Explanation>
    Archivy CBA jsou podporov&#225;ny v z&#225;hlav&#237; Application-Content pro produkt WebSphere Application Server verze 8 nebo vy&#353;&#353;&#237;.
  </Explanation>
  <UserResponse>
    Nen&#237; po&#382;adov&#225;na &#382;&#225;dn&#225; akce. Je-li aplikaci t&#345;eba spou&#353;t&#283;t s bal&#237;kem funkc&#237; OSGi Applications Feature Pack pro produkt WebSphere Application Server verze 7, upravte ji tak, aby v z&#225;hlav&#237; Application-Content nebyly uvedeny &#382;&#225;dn&#233; archivy CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: Do&#353;lo k v&#253;jimce IOException p&#345;i &#269;ten&#237; souboru typu manifest aplikace souboru EBA (Enterprise Bundle Archive) {0}. Soubor m&#367;&#382;e b&#253;t neplatn&#253;, po&#353;kozen&#253; nebo ne&#269;iteln&#253;.
  </MsgText>
  <Explanation>
    P&#345;i &#269;ten&#237; souboru typu manifest aplikace EBA (Enterprise Bundle Archive) se vyskytla v&#253;jimka I/O. Soubor m&#367;&#382;e b&#253;t neplatn&#253;, po&#353;kozen&#253; nebo ne&#269;iteln&#253;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e soubor typu manifest aplikace (APPLICATION.MF) odpov&#237;d&#225; specifikaci pro soubory typu manifest.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Do&#353;lo k intern&#237; chyb&#283;. Identifik&#225;tor URI konfigura&#269;n&#237;ho souboru modulu plug-in nem&#225; o&#269;ek&#225;van&#253; form&#225;t {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Do&#353;lo k intern&#237; chyb&#283;. P&#345;i zaji&#353;&#357;ov&#225;n&#237; souboru archivu EBA {0} byl vr&#225;cen nespr&#225;vn&#253; v&#253;sledek. Podle o&#269;ek&#225;v&#225;n&#237; se maxim&#225;ln&#237; verze {1} m&#283;la shodovat s minim&#225;ln&#237; verz&#237; {2}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: Aplikaci {0} nebylo mo&#382;n&#233; zajistit pro v&#353;echny uzly v bu&#328;ce. Aplikaci lze implementovat pouze v uzlech verze 7, v nich&#382; je spu&#353;t&#283;n bal&#237;k funkc&#237; OSGi Applications Feature Pack. Chyba interpretace: {1}.
  </MsgText>
  <Explanation>
    Importovan&#225; aplikace byla &#250;sp&#283;&#353;n&#283; zaji&#353;t&#283;na pro bal&#237;k funkc&#237; OSGi Application Feature Pack pro produkt WebSphere Application Server verze 7, nebylo v&#353;ak mo&#382;n&#233; zajistit ji pro produkt WebSphere Application Server verze 8.
  </Explanation>
  <UserResponse>
    Nen&#237; po&#382;adov&#225;na &#382;&#225;dn&#225; akce. Toto varov&#225;n&#237; v&#353;ak indikuje, &#382;e aplikace m&#367;&#382;e obsahovat p&#345;&#237;li&#353; striktn&#237; po&#382;adavek na verzi. Informace uveden&#233; v r&#225;mci chyby interpretace m&#367;&#382;ete pou&#382;&#237;t k &#250;prav&#283; aplikace tak, aby mohla b&#253;t implementov&#225;na v uzlech verze 8.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: V uzlu {0} nelze vytvo&#345;it &#269;lena klastru, proto&#382;e aplikace OSGi {1} definuj&#237; role Spustit jako.
  </MsgText>
  <Explanation>
    V&#353;ichni &#269;lenov&#233; klastru mus&#237; b&#253;t schopni spou&#353;t&#283;t stejn&#233; aplikace, nov&#253; &#269;len klastru v&#353;ak nepodporuje aplikace OSGi s rolemi Spustit jako.
  </Explanation>
  <UserResponse>
    Vyberte uzel verze 8, kter&#253; bude hostitelem klastru, nebo upravte aplikace tak, aby ji&#382; nedefinovaly role Spustit jako.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: V souboru typu manifest implementace pro aplikaci {0} ve verzi {1} je uveden obsah se stejn&#253;m symbolick&#253;m n&#225;zvem a verz&#237; jako u aplikace.
  </MsgText>
  <Explanation>
    Aplikace, objekty bundle a slo&#382;en&#233; objekty bundle sd&#237;lej&#237; jeden spole&#269;n&#253; obor n&#225;zv&#367;, proto mus&#237; m&#237;t v r&#225;mci oboru n&#225;zv&#367; jedine&#269;n&#233; identifik&#225;tory. P&#345;i ov&#283;&#345;ov&#225;n&#237; implementace aplikace nalezlo b&#283;hov&#233; prost&#345;ed&#237; odkaz na objekt bundle se stejn&#253;m symbolick&#253;m n&#225;zvem a verz&#237; jako u aplikace.
  </Explanation>
  <UserResponse>
    Opravte symbolick&#253; n&#225;zev objektu bundle, slo&#382;en&#233;ho objektu bundle nebo aplikace tak, abyste eliminovali konflikt v oboru n&#225;zv&#367;.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: Nelze rozpoznat aktivum {0}. Atribut {1} u importu pro bal&#237;k {2} nelze p&#345;i implementaci splnit.
  </MsgText>
  <Explanation>
    U objekt&#367; bundle uveden&#253;ch v z&#225;hlav&#237; Application-Content v souboru APPLICATION.MF mus&#237; m&#237;t v&#353;echny importy bal&#237;k&#367; atributy, kter&#233; lze p&#345;i implementaci splnit.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te rozd&#283;len&#237; aplikace do bal&#237;k&#367; nebo jej&#237; konfiguraci tak, aby objekty bundle, kter&#233; jsou uvedeny v z&#225;hlav&#237; Application-Content, obsahovaly importy bal&#237;k&#367;, kter&#233; lze p&#345;i implementaci splnit.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Do&#353;lo k intern&#237; chyb&#283;. Nelze naj&#237;t konfigura&#269;n&#237; data vy&#382;adovan&#225; k rozbalen&#237; objektu {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Do&#353;lo k v&#253;jimce p&#345;i modelov&#225;n&#237; bal&#237;ku {0}: {1}
  </MsgText>
  <Explanation>
    Ke specifikovan&#233; v&#253;jimce do&#353;lo b&#283;hem modelov&#225;n&#237; zadan&#233;ho bal&#237;ku.
  </Explanation>
  <UserResponse>
    Prostudujte u specifikovan&#233; v&#253;jimky podrobnosti probl&#233;mu a probl&#233;m opravte.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Do&#353;lo k intern&#237; chyb&#283;. Nelze na&#269;&#237;st polo&#382;ku InputStream pro polo&#382;ku typu zip souboru web.xml v souboru WAR {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: V c&#237;li {1} pro prost&#345;edek pou&#382;&#237;van&#253; objektem typu bean {2} v bal&#237;ku {3} verze {4} nelze naj&#237;t alias ov&#283;&#345;ov&#225;n&#237; modulu listener objektu, kter&#253; odpov&#237;d&#225; n&#225;zvu rozhran&#237; JNDI {0}.
  </MsgText>
  <Explanation>
    Zadan&#253; alias ov&#283;&#345;ov&#225;n&#237; neexistuje nebo nen&#237; pro tuto aplikaci viditeln&#253;.
  </Explanation>
  <UserResponse>
    Nakonfigurujte po&#382;adovan&#253; alias ov&#283;&#345;ov&#225;n&#237; nebo zkontrolujte, zda je pro danou aplikaci nakonfigurov&#225;n ve spr&#225;vn&#233;m rozsahu.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: Nelze rozpoznat aktivum {0}. Toto aktivum vy&#382;aduje objekt bundle {1}, kter&#253; nen&#237; uveden v z&#225;hlav&#237; Application-Content v souboru typu manifest aplikace APPLICATION.MF. Tento objekt bundle vyu&#382;&#237;v&#225; slu&#382;bu {2} z objektu bundle {3} uveden&#233;ho v z&#225;hlav&#237; Application-Content.
  </MsgText>
  <Explanation>
    Aplikace nen&#237; spr&#225;vn&#283; nakonfigurov&#225;na. Sd&#237;len&#253; objekt bundle nem&#367;&#382;e vyu&#382;&#237;vat &#382;&#225;dnou slu&#382;bu z izolovan&#233;ho objektu bundle. Objekty bundle uveden&#233; v z&#225;hlav&#237; Application-Content jsou izolovan&#233; a mohou exportovat slu&#382;by pouze do jin&#253;ch aplikac&#237; prost&#345;ednictv&#237;m mechanizmu aplikace-slu&#382;ba exportu.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te rozd&#283;len&#237; aplikace do bal&#237;k&#367; nebo jej&#237; konfiguraci tak, aby objekty bundle, kter&#233; jsou uvedeny v z&#225;hlav&#237; Use-Bundle nebo byly p&#345;id&#225;ny vyhodnocovac&#237;m modulem, nevy&#382;adovaly slu&#382;by poskytovan&#233; objekty bundle uveden&#253;mi v z&#225;hlav&#237; Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: Aktivum {0} vy&#382;aduje extern&#237; sta&#382;en&#237;, ne&#382; je bude mo&#382;n&#233; implementovat do kompozi&#269;n&#237; jednotky.
  </MsgText>
  <Explanation>
    Nov&#233; nebo aktualizovan&#233; aktivum vy&#382;aduje sta&#382;en&#237; jednoho &#269;i v&#237;ce objekt&#367; bundle z &#250;lo&#382;i&#353;t&#283;, ne&#382; je bude mo&#382;n&#233; p&#345;idat do kompozi&#269;n&#237; jednotky nebo aktualizovat v kompozi&#269;n&#237; jednotce.
  </Explanation>
  <UserResponse>
    Chcete-li zah&#225;jit proces stahov&#225;n&#237; objekt&#367; bundle, ulo&#382;te proveden&#233; zm&#283;ny hlavn&#237; konfigurace. Pr&#367;b&#283;&#382;n&#253; stav stahov&#225;n&#237; objektu bundle pro aktivum lze sledovat na panelu s &#250;daji o aktivu v administrativn&#237; konzole. Po dokon&#269;en&#237; stahov&#225;n&#237; objekt&#367; bundle zkuste znovu p&#345;idat aktivum do kompozi&#269;n&#237; jednotky nebo je v n&#237; aktualizovat.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: P&#345;evod souboru WAR {0} v souboru EBA {1} na soubor WAB se nepoda&#345;ilo &#250;sp&#283;&#353;n&#283; dokon&#269;it.
  </MsgText>
  <Explanation>
    Soubory archivu webov&#253;ch aplikac&#237; (WAR) v souboru EBA (Enterprise Bundle Archive) je nutn&#233; p&#345;ev&#233;st na objekty bundle webov&#253;ch aplikac&#237; (WAB). Teprve pot&#233; je mo&#382;n&#233; je implementovat. Proces p&#345;evodu se nepoda&#345;ilo &#250;sp&#283;&#353;n&#283; dokon&#269;it.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te platnost souboru WAR.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Do&#353;lo k intern&#237; chyb&#283;. V registru slu&#382;eb OSGi nen&#237; k dispozici slu&#382;ba RepositoryAdminSupport.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: Neexistuje alias ov&#283;&#345;ov&#225;n&#237; {0} v dom&#233;n&#283; zabezpe&#269;en&#237; {2} c&#237;le {1}.
  </MsgText>
  <Explanation>
    P&#345;i pou&#382;it&#237; vazby odkaz&#367; na prost&#345;edky Blueprint mus&#237; v glob&#225;ln&#237; nebo v c&#237;lov&#233; dom&#233;n&#283; zabezpe&#269;en&#237; existovat alias ov&#283;&#345;ov&#225;n&#237;.
  </Explanation>
  <UserResponse>
    Vyberte n&#283;kter&#253; z existuj&#237;c&#237;ch alias&#367; ov&#283;&#345;ov&#225;n&#237; v glob&#225;ln&#237; nebo c&#237;lov&#233; dom&#233;n&#283; zabezpe&#269;en&#237; nebo vytvo&#345;te vhodn&#253; alias ov&#283;&#345;ov&#225;n&#237;.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: V uzlu {0} nelze vytvo&#345;it &#269;lena klastru, proto&#382;e aplikace OSGi {1} obsahuj&#237; v z&#225;hlav&#237; Application-Content archivy slo&#382;en&#253;ch objekt&#367; bundle (CBA).
  </MsgText>
  <Explanation>
    V&#353;ichni &#269;lenov&#233; klastru mus&#237; b&#253;t schopni spou&#353;t&#283;t stejn&#233; aplikace, nov&#253; &#269;len klastru v&#353;ak nepodporuje aplikace OSGi s archivy CBA v z&#225;hlav&#237; Application-Content.
  </Explanation>
  <UserResponse>
    Vyberte uzel verze 8, kter&#253; bude hostitelem klastru, nebo upravte aplikace tak, aby ji&#382; neobsahovaly v z&#225;hlav&#237; Application-Content archivy CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: Kompozi&#269;n&#237; jednotka {0} neodpov&#237;d&#225; aplikaci OSGi.
  </MsgText>
  <Explanation>
    Vyvolan&#225; operace pracuje s kompozi&#269;n&#237; jednotkou pro aplikaci OSGi. Vybran&#225; kompozi&#269;n&#237; jednotka neobsahuje aplikaci OSGi.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda je vybran&#225; kompozi&#269;n&#237; jednotka z&#225;lohov&#225;na aktivem s aspektem typu &quot;EBA,version=1.0&quot;.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Do&#353;lo k intern&#237; chyb&#283;. Z bin&#225;rn&#237;ho souboru aktiva {0} se nepoda&#345;ilo extrahovat soubor typu manifest implementace.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Do&#353;lo k intern&#237; chyb&#283;. V registru slu&#382;eb OSGi nen&#237; k dispozici slu&#382;ba ModelledResourceManager.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Do&#353;lo k intern&#237; chyb&#283;. Bal&#237;k CBA {0} u verze {1} nelze modelovat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: Nepoda&#345;ilo se naj&#237;t soubor deskriptoru aplikace Java EE v souboru EBA {0}. Bez tohoto souboru deskriptoru budou pro kontextov&#233; ko&#345;enov&#233; adres&#225;&#345;e pro soubory WAR nastaveny v&#253;choz&#237; hodnoty.
  </MsgText>
  <Explanation>
    Syst&#233;m zpracoval archiv webov&#253;ch aplikac&#237; (WAR) bez pou&#382;it&#237; p&#345;idru&#382;en&#233;ho souboru deskriptoru aplikac&#237; application.xml, kter&#253; definuje kontextov&#233; ko&#345;enov&#233; adres&#225;&#345;e. Pro kontextov&#233; ko&#345;enov&#233; adres&#225;&#345;e pro migrovan&#253; soubor WAR budou nastaveny v&#253;choz&#237; hodnoty.
  </Explanation>
  <UserResponse>
    Je-li vy&#382;adov&#225;n soubor deskriptoru aplikace, ov&#283;&#345;te, zda je tento soubor zad&#225;n a zda byl spr&#225;vn&#283; sbalen do souboru EBA (Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Nelze zpracovat soubor typu manifest implementace, kter&#253; poskytla aplikace z tohoto um&#237;st&#283;n&#237; {0}.
  </MsgText>
  <Explanation>
    Do&#353;lo k pokusu o importov&#225;n&#237; souboru EBA, kter&#253; obsahuje soubor typu manifest implementace. Zpracov&#225;n&#237; tohoto souboru nebylo &#250;sp&#283;&#353;n&#233;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e aplika&#269;n&#237; server m&#225; p&#345;&#237;stupov&#233; opr&#225;vn&#283;n&#237; k dan&#233;mu souboru, a d&#225;le zkontrolujte, &#382;e dan&#253; soubor nen&#237; po&#353;kozen. Neimplementujte soubor typu manifest ru&#269;n&#283;. V p&#345;&#237;pad&#283; pot&#345;eby odeberte soubor typu manifest implementace ze souboru EBA. P&#345;i importov&#225;n&#237; souboru EBA tak dojde k vygenerov&#225;n&#237; nov&#233;ho souboru typu manifest implementace.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Do&#353;lo k intern&#237; chyb&#283;. V registru slu&#382;eb OSGi nen&#237; k dispozici slu&#382;ba {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: Nelze vytvo&#345;it adres&#225;&#345; {0}.
  </MsgText>
  <Explanation>
    Nelze vytvo&#345;it uveden&#253; adres&#225;&#345;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda je v &#250;lo&#382;i&#353;ti voln&#233; m&#237;sto a zda m&#225; dan&#253; produkt pot&#345;ebn&#225; opr&#225;vn&#283;n&#237; k vytvo&#345;en&#237; adres&#225;&#345;e.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Do&#353;lo k intern&#237; chyb&#283;. Modul {0} byl neo&#269;ek&#225;van&#233;ho typu.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: P&#345;i instalaci souboru EBA {0} se vyskytly chyby.
  </MsgText>
  <Explanation>
    V pr&#367;b&#283;hu procesu ov&#283;&#345;ov&#225;n&#237; a instalace souboru archivu EBA se vyskytly chyby.
  </Explanation>
  <UserResponse>
    Dal&#353;&#237; informace naleznete v souvisej&#237;c&#237;ch chybov&#253;ch zpr&#225;v&#225;ch v souboru protokolu SystemOut.log.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Nelze vytvo&#345;it &#382;&#225;dnou v&#253;choz&#237; vazbu pro odkaz na EJB {0} v bal&#237;ku {1} verze {2} s rozhran&#237;m {3}, proto&#382;e v aplikaci neexistuj&#237; odpov&#237;daj&#237;c&#237; objekty enterprise bean.
  </MsgText>
  <Explanation>
    Pro odkazy na EJB bez vazeb je t&#345;eba vytvo&#345;it v&#253;choz&#237; vazby. Nelze naj&#237;t objekt enterprise bean, na n&#283;j&#382; by bylo mo&#382;n&#233; tento odkaz v&#225;zat.
  </Explanation>
  <UserResponse>
    Bu&#271; odkaz nava&#382;te na zn&#225;m&#233; um&#237;st&#283;n&#237; rozhran&#237; JNDI, nebo opravte aplikaci.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Do&#353;lo k intern&#237; chyb&#283;. Nepoda&#345;ilo se naj&#237;t objekt konfigurace aktiva pro aktivum {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: V c&#237;li {2} nebyl nalezen odkaz na prost&#345;edek s n&#225;zvem rozhran&#237; JNDI {0} a typem {1} pro odkaz na prost&#345;edek EJB {3} definovan&#253; v objektu bundle {4} s verz&#237; {5}.
  </MsgText>
  <Explanation>
    Soubor EBA (Enterprise Bundle Archive), kter&#253; obsahuje odkazy na prost&#345;edky v modulu EJB ur&#269;uje n&#225;zev JNDI pro odkaz na prost&#345;edek, kter&#253; neexistuje v oboru n&#225;zv&#367; JNDI.
  </Explanation>
  <UserResponse>
    Pokud m&#225; b&#253;t odkaz na prost&#345;edek obsa&#382;en v oboru n&#225;zv&#367; JNDI, bu&#271; vytvo&#345;te vazbu mezi objektem a n&#225;zvem, nebo opravte odkaz na prost&#345;edek a aktualizujte soubor EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: Aplikace OSGi implementovan&#225; v kompozi&#269;n&#237; jednotce {0} v aplikaci BLA {1} nebyla zastavena.
  </MsgText>
  <Explanation>
    B&#283;hem operace zastavov&#225;n&#237; do&#353;lo k v&#253;jimce.
  </Explanation>
  <UserResponse>
    V protokolech serveru, kter&#233; p&#345;edch&#225;zely t&#233;to v&#253;jimce, vyhledejte p&#345;esn&#283;j&#353;&#237; diagnostiku probl&#233;mu.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: Role {0} nen&#237; platnou rol&#237;.
  </MsgText>
  <Explanation>
    Uveden&#225; role nebyla konfigurov&#225;na.
  </Explanation>
  <UserResponse>
    Nakonfigurujte uvedenou roli.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: &#268;len klastru {0} nen&#237; roz&#353;&#237;&#345;en funkcemi {2} vy&#382;adovan&#253;mi aplikac&#237; OSGi {1}.
  </MsgText>
  <Explanation>
    Aby bylo mo&#382;n&#233; instalovat aplikaci OSGi do klastru, ka&#382;d&#253; &#269;len klastru mus&#237; m&#237;t v&#353;echny vy&#382;adovan&#233; funkce aplikace. P&#345;i p&#345;id&#225;v&#225;n&#237; nov&#233;ho &#269;lena klastru je tak&#233; t&#345;eba, aby tento &#269;len m&#283;l v&#353;echny funkce vy&#382;adovan&#233; v&#353;emi aplikacemi OSGi, kter&#233; jsou v klastru instalov&#225;ny.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda m&#225; navrhovan&#253; &#269;len klastru v&#353;echny po&#382;adovan&#233; funkce pro aplikaci OSGi uvedenou v chybov&#233; zpr&#225;v&#283;.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: Nelze vytvo&#345;it adres&#225;&#345; {0}.
  </MsgText>
  <Explanation>
    Nelze vytvo&#345;it uveden&#253; adres&#225;&#345;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda je v &#250;lo&#382;i&#353;ti voln&#233; m&#237;sto a zda m&#225; dan&#253; produkt pot&#345;ebn&#225; opr&#225;vn&#283;n&#237; k vytvo&#345;en&#237; adres&#225;&#345;e.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: Obsah souboru typu manifest implementace je nespr&#225;vn&#253;. N&#225;sleduj&#237;c&#237; objekty bundle jsou nadbyte&#269;n&#233;: {0}
  </MsgText>
  <Explanation>
    Soubor typu manifest implementace, kter&#253; m&#283;l b&#253;t importov&#225;n, obsahuje objekty bundle, kter&#233; nejsou pot&#345;ebn&#233; k interpretaci aktiva EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Pou&#382;ijte nov&#253; soubor typu manifest implementace DEPLOYMENT.MF, kter&#253; nebude obsahovat objekty bundle uveden&#233; ve zpr&#225;v&#283; v&#253;jimky. Neimplementujte soubor typu manifest ru&#269;n&#283;. V p&#345;&#237;pad&#283; pot&#345;eby odeberte soubor typu manifest implementace ze souboru EBA. P&#345;i importov&#225;n&#237; souboru EBA tak dojde k vygenerov&#225;n&#237; nov&#233;ho souboru typu manifest implementace.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: Zadan&#225; skupina {0} je neplatn&#225;.
  </MsgText>
  <Explanation>
    Byl proveden pokus o mapov&#225;n&#237; role zabezpe&#269;en&#237; na neplatnou skupinu.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te existenci ur&#269;en&#233; skupiny.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Do&#353;lo k intern&#237; chyb&#283;. Slu&#382;ba administrace nebyla registrov&#225;na.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Roz&#353;&#237;&#345;en&#237; kompozi&#269;n&#237; jednotky {0} vy&#382;aduje extern&#237; sta&#382;en&#237;.
  </MsgText>
  <Explanation>
    Vytvo&#345;ili nebo aktualizovali jste archiv slo&#382;en&#253;ch objekt&#367; bundle (CBA), kter&#253; m&#225; b&#253;t pou&#382;&#237;v&#225;n jako roz&#353;&#237;&#345;en&#237; kompozi&#269;n&#237; jednotky. Toto roz&#353;&#237;&#345;en&#237; vy&#382;aduje sta&#382;en&#237; jednoho &#269;i n&#283;kolika objekt&#367; bundle z &#250;lo&#382;i&#353;t&#283;, ne&#382; bude mo&#382;n&#233; p&#345;idat roz&#353;&#237;&#345;en&#237; do kompozi&#269;n&#237; jednotky.
  </Explanation>
  <UserResponse>
    Chcete-li zah&#225;jit proces stahov&#225;n&#237;, ulo&#382;te proveden&#233; zm&#283;ny hlavn&#237; konfigurace.  Pr&#367;b&#283;&#382;n&#253; stav stahov&#225;n&#237; objektu bundle lze sledovat na panelu s &#250;daji o kompozi&#269;n&#237; jednotce v administrativn&#237; konzole. Vy&#269;kejte na dokon&#269;en&#237; stahov&#225;n&#237; objektu bundle a pot&#233; p&#345;idejte roz&#353;&#237;&#345;en&#237; do kompozi&#269;n&#237; jednotky.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: V &#382;&#225;dn&#233;m ze server&#367; a klastr&#367; nen&#237; implementov&#225;na po&#382;adovan&#225; funkce {0} pro aktivum {1}.
  </MsgText>
  <Explanation>
    Po&#382;adovan&#225; funkce nebyla nalezena na &#382;&#225;dn&#233;m serveru.
  </Explanation>
  <UserResponse>
    Nainstalujte po&#382;adovanou funkci alespo&#328; na jeden server.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Do&#353;lo k intern&#237; chyb&#283;. V n&#225;sleduj&#237;c&#237;ch bal&#237;c&#237;ch chyb&#237; soubor archivu EBA {0}: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: Aktivum {0} nelze p&#345;idat do t&#233;to aplikace BLA, proto&#382;e je ji&#382; p&#345;id&#225;n do aplikace BLA {1}.
  </MsgText>
  <Explanation>
    Aktivum EBA (Enterprise Bundle Archive) m&#367;&#382;e b&#253;t obsa&#382;eno jen v jedn&#233; aplikaci obchodn&#237; &#250;rovn&#283; (BLA).
  </Explanation>
  <UserResponse>
    Vytvo&#345;te novou aplikaci se stejn&#253;m obsahem, av&#353;ak s odli&#353;n&#253;m symbolick&#253;m n&#225;zvem aplikace. Importujte novou aplikaci jako aktivum EBA a pot&#233; ji p&#345;idejte do t&#233;to aplikace BLA.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: P&#345;i zaji&#353;&#357;ov&#225;n&#237; aplikace {0} byly dosa&#382;eny rozd&#237;ln&#233; v&#253;sledky pro produkt WebSphere Application Server verze 8 a pro bal&#237;k funkc&#237; OSGi Applications Feature Pack pro produkt WebSphere Application Server verze 7. Pou&#382;it bude v&#253;sledek pro verzi 8.
  </MsgText>
  <Explanation>
    Importovan&#225; aplikace byla &#250;sp&#283;&#353;n&#283; zaji&#353;t&#283;na pro produkt WebSphere Application Server verze 8 a pro bal&#237;k funkc&#237; OSGi Applications Feature Pack pro produkt WebSphere Application Server verze 7. Pro ob&#283; operace zji&#353;t&#283;n&#237; v&#353;ak byly dosa&#382;eny rozd&#237;ln&#233; v&#253;sledky. Tut&#233;&#382; aplikaci nelze spou&#353;t&#283;t s r&#367;zn&#253;mi implementacemi.
  </Explanation>
  <UserResponse>
    Nen&#237; po&#382;adov&#225;na &#382;&#225;dn&#225; akce.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: Polo&#382;ka {1} byla p&#345;i&#345;azena do adres&#225;&#345;e {0}.
  </MsgText>
  <Explanation>
    Aktivum EBA (Enterprise Bundle Archive) je p&#345;id&#225;v&#225;no do kompozi&#269;n&#237; jednotky. Pro &#250;&#269;ely nastaven&#237; webov&#233; aplikace obsa&#382;en&#233; v souboru EBA byl webov&#233; aplikaci p&#345;i&#345;azen adres&#225;&#345;.
  </Explanation>
  <UserResponse>
    Nen&#237;
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Do&#353;lo k intern&#237; chyb&#283;. Nelze na&#269;&#237;st manifest aplikace nebo soubor typu manifest implementace pro soubor EBA (Enterprise Bundle Archive) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Do&#353;lo k intern&#237; chyb&#283;. Nepoda&#345;ilo se naj&#237;t krok {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: Aktivum {0} obsahuje soubor JAR {1}, kter&#253; nen&#237; objektem bundle a nebude p&#345;eveden. Pokud jsou na tomto souboru z&#225;visl&#233; jin&#233; &#269;&#225;sti aplikace, dojde za b&#283;hu aplikace k selh&#225;n&#237;.
  </MsgText>
  <Explanation>
    P&#345;evod soubor&#367; archivu jazyka Java (JAR) obslu&#382;n&#233;ho programu a soubor&#367; JAR objekt&#367; Enterprise JavaBeans (EJB) nen&#237; podporov&#225;n.
  </Explanation>
  <UserResponse>
    Zajist&#283;te, aby &#382;&#225;dn&#253; objekt bundle ani objekt bundle webov&#253;ch aplikac&#237; (soubor WAB) nez&#225;visel na t&#345;&#237;d&#225;ch ze souboru JAR. Chcete-li p&#345;edej&#237;t zobrazen&#237; varovn&#233; zpr&#225;vy, odeberte soubor JAR ze souboru EBA (Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Do&#353;lo k intern&#237; chyb&#283;. Nelze na&#269;&#237;st manifest aplikace nebo soubor typu manifest implementace pro soubor EBA (Enterprise Bundle Archive) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: Rozhran&#237; EJB {0} pro objekt enterprise bean {1} v bal&#237;ku {2} ve verzi {3} nelze v&#225;zat k um&#237;st&#283;n&#237; {4}. Lok&#225;ln&#283; p&#345;&#237;stupn&#225; rozhran&#237; EJB se mus&#237; v&#225;zat na obor n&#225;zv&#367; ejblocal:
  </MsgText>
  <Explanation>
    Lok&#225;ln&#237; pohledy &quot;Bez rozhran&#237;&quot; a &quot;Lok&#225;ln&#237; domovsk&#253; adres&#225;&#345;&quot; objektu enterprise bean mohou b&#253;t v&#225;z&#225;ny na lok&#225;ln&#283; p&#345;&#237;stupn&#233; JNDI. To znamen&#225;, &#382;e jejich n&#225;zvy vazeb mus&#237; za&#269;&#237;nat na &quot;ejblocal:&quot;.
  </Explanation>
  <UserResponse>
    Upravte n&#225;zvy vazeb pro v&#353;echny lok&#225;ln&#283; p&#345;&#237;stupn&#233; pohledy EJB tak, aby pou&#382;&#237;valy p&#345;edponu oboru n&#225;zv&#367; ejblocal:
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: Hodnota CompUnitStatusStep indikuje, &#382;e kompozi&#269;n&#237; jednotka {0} m&#225; b&#253;t p&#345;evedena na nejnov&#283;j&#353;&#237; dostupnou verzi implementace z aktiva {1}. Kompozi&#269;n&#237; jednotka {0} je v&#353;ak aktu&#225;ln&#237;.
  </MsgText>
  <Explanation>
    Ne&#382; bude mo&#382;n&#233; p&#345;ej&#237;t na vy&#353;&#353;&#237; verzi aktiva implementovan&#233;ho v r&#225;mci kompozi&#269;n&#237; jednotky, mus&#237; b&#253;t k dispozici aktualizovan&#225; verze aktiva a stahov&#225;n&#237; v&#353;ech objekt&#367; bundle vy&#382;adovan&#253;ch aktualizovan&#253;m aktivem mus&#237; b&#253;t dokon&#269;eno.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e je k dispozici nov&#283;j&#353;&#237; verze aktiva a &#382;e bylo dokon&#269;eno stahov&#225;n&#237; v&#353;ech objekt&#367; bundle pro p&#345;&#237;slu&#353;n&#233; aktivum.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Do&#353;lo k intern&#237; chyb&#283;. Nelze z&#237;skat kompozi&#269;n&#237; jednotku pro aktivum {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: V uzlu {0} nelze vytvo&#345;it &#269;lena klastru, proto&#382;e aplikace OSGi {1} byly roz&#353;&#237;&#345;eny.
  </MsgText>
  <Explanation>
    V&#353;ichni &#269;lenov&#233; klastru mus&#237; b&#253;t schopni spou&#353;t&#283;t stejn&#233; aplikace, nov&#253; &#269;len klastru v&#353;ak nepodporuje roz&#353;&#237;&#345;en&#237; aplikac&#237; OSGi.
  </Explanation>
  <UserResponse>
    Vyberte uzel verze 8, kter&#253; bude hostitelem klastru, nebo odeberte roz&#353;&#237;&#345;en&#237; z aplikac&#237;, aby je bylo mo&#382;n&#233; spou&#353;t&#283;t s pou&#382;it&#237;m vybran&#233;ho uzlu.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: Bal&#237;k {0} v kompozi&#269;n&#237; jednotce {1} nelze aktualizovat kv&#367;li konfliktu p&#345;&#237;pony se stejn&#253;m symbolick&#253;m n&#225;zvem.
  </MsgText>
  <Explanation>
    Bal&#237;k CBA nelze aktualizovat na po&#382;adovanou verzi, nebo&#357; v dan&#233; verzi ji&#382; existuje p&#345;&#237;pona se stejn&#253;m symbolick&#253;m n&#225;zvem.
  </Explanation>
  <UserResponse>
    Bu&#271; p&#345;&#237;ponu odeberte, nebo upravte verzi bal&#237;ku, na kterou se pokou&#353;&#237;te aktualizovat.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: V c&#237;li {1} pro prost&#345;edek pou&#382;&#237;van&#253; objektem typu bean {2} v bal&#237;ku {3} verze {4} nelze naj&#237;t aktiva&#269;n&#237; specifikaci objektu MDB, kter&#225; odpov&#237;d&#225; n&#225;zvu rozhran&#237; JNDI {0}.
  </MsgText>
  <Explanation>
    Zadan&#253; n&#225;zev rozhran&#237; JNDI odkazu na aktiva&#269;n&#237; specifikaci v&#225;z&#225;n&#237; modulu listener objektu MDB neexistuje.
  </Explanation>
  <UserResponse>
    Pokud m&#225; b&#253;t odkaz obsa&#382;en v oboru n&#225;zv&#367; JNDI, bu&#271; vytvo&#345;te vazbu mezi objektem a n&#225;zvem, nebo opravte odkaz a aktualizujte soubor EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Do&#353;lo k intern&#237; chyb&#283;. Nebylo mo&#382;n&#233; zadat aktivu {0} dotaz na obsah.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: Aplikace {0} obsahuje slo&#382;en&#253; objekt bundle {1}. Tato akce nen&#237; podporov&#225;na.
  </MsgText>
  <Explanation>
    K zahrnut&#237; archiv&#367; slo&#382;en&#253;ch objekt&#367; bundle p&#345;&#237;mo do souboru EBA nelze pou&#382;&#237;t z&#225;hlav&#237; Application-Content.
  </Explanation>
  <UserResponse>
    Odeberte slo&#382;en&#253; objekt bundle z obsahu aplikace. M&#367;&#382;ete bu&#271; zahrnout jednotliv&#233; objekty bundle do z&#225;hlav&#237; Application-Content, nebo nainstalovat slo&#382;en&#253; objekt bundle do &#250;lo&#382;i&#353;t&#283; objekt&#367; bundle za &#250;&#269;elem sd&#237;len&#237;.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Do&#353;lo k intern&#237; chyb&#283;. V mezipam&#283;ti objekt&#367; bundle existuje soubor se spr&#225;vn&#253;m n&#225;zvem, neobsahuje v&#353;ak o&#269;ek&#225;van&#253; objekt bundle {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: Nelze naj&#237;t odkaz na m&#237;sto ur&#269;en&#237; zpr&#225;vy nebo odkaz na prost&#345;ed&#237; prost&#345;edku s n&#225;zvem rozhran&#237; JNDI {0} a typem {1} u c&#237;le {2} pro odkaz na m&#237;sto ur&#269;en&#237; zpr&#225;vy EJB nebo odkaz na prost&#345;ed&#237; prost&#345;edku {3} definovan&#253; v bal&#237;ku {4} verze {5}.
  </MsgText>
  <Explanation>
    Soubor EBA (Enterprise Bundle Archive), kter&#253; obsahuje odkazy na m&#237;sto ur&#269;en&#237; zpr&#225;vy nebo odkazy na prost&#345;ed&#237; prost&#345;edku v modulu EJB, ud&#225;v&#225; n&#225;zev rozhran&#237; JNDI pro odkaz na m&#237;sto ur&#269;en&#237; zpr&#225;vy nebo odkaz na prost&#345;ed&#237; prost&#345;edku, kter&#253; v oboru n&#225;zv&#367; rozhran&#237; JNDI neexistuje.
  </Explanation>
  <UserResponse>
    Pokud m&#225; b&#253;t odkaz na m&#237;sto ur&#269;en&#237; zpr&#225;vy nebo odkaz na prost&#345;ed&#237; prost&#345;edku v oboru n&#225;zv&#367; rozhran&#237; JNDI, bu&#271; vytvo&#345;te vazbu mezi n&#225;zvem a objektem, nebo opravte odkaz na m&#237;sto ur&#269;en&#237; zpr&#225;vy &#269;i odkaz na prost&#345;ed&#237; prost&#345;edku a aktualizujte EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: Aplikace OSGi {0} je neplatn&#225;, proto&#382;e jej&#237; symbolick&#253; n&#225;zev obsahuje dv&#283; po sob&#283; n&#225;sleduj&#237;c&#237; te&#269;ky.
  </MsgText>
  <Explanation>
    Symbolick&#253; n&#225;zev aplikace OSGi nem&#367;&#382;e obsahovat &#345;et&#283;zec &quot;..&quot;, tj. dv&#283; te&#269;ky po sob&#283;.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te symbolick&#253; n&#225;zev aplikace OSGi.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: Nelze &#269;&#237;st soubor EBA {0}.
  </MsgText>
  <Explanation>
    P&#345;i &#269;ten&#237; souboru EBA (Enterprise Bundle Archive) se vyskytla v&#253;jimka I/O. Soubor m&#367;&#382;e b&#253;t po&#353;kozen&#253; nebo nen&#237; &#269;iteln&#253;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda m&#225; dan&#253; soubor odpov&#237;daj&#237;c&#237; opr&#225;vn&#283;n&#237; a zda je uveden ve spr&#225;vn&#233;m form&#225;tu.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Do&#353;lo k intern&#237; chyb&#283;. Objekt MBean SecurityAdmin nebyl registrov&#225;n.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: Odkazy slu&#382;eb v obsahu archivu slo&#382;en&#253;ch objekt&#367; (CBA) {0} nelze interpretovat. Jsou-li tyto slu&#382;by poskytov&#225;ny objekty bundle, je&#382; nejsou obsa&#382;eny v archivu CBA, mus&#237; je archiv CBA importovat. N&#225;sleduj&#237;c&#237; z&#225;vislosti slu&#382;eb nebyly interpretov&#225;ny: {1}.
  </MsgText>
  <Explanation>
    Pokud objekt bundle v archivu slo&#382;en&#253;ch objekt&#367; bundle (CBA) pou&#382;&#237;v&#225; slu&#382;bu, kter&#225; v objektu bundle nen&#237; obsa&#382;ena nebo je exportov&#225;na jin&#253;m objektem bundle v r&#225;mci t&#233;ho&#382; archivu CBA, mus&#237; archiv CBA importovat p&#345;&#237;slu&#353;nou slu&#382;bu.
  </Explanation>
  <UserResponse>
    Opravte slo&#382;en&#253; soubor typu manifest COMPOSITEBUNDLE.MF tak, aby archiv CBA importoval v&#353;echny slu&#382;by, je&#382; jsou pou&#382;&#237;v&#225;ny objekty bundle obsa&#382;en&#253;mi v archivu CBA a nejsou v archivu CBA k dispozici jin&#253;m zp&#367;sobem.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: Nelze zapisovat do migrovan&#233;ho souboru EBA {0}.
  </MsgText>
  <Explanation>
    P&#345;i z&#225;pisu do migrovan&#233;ho souboru EBA (Enterprise Bundle Archive) se vyskytla v&#253;jimka I/O.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda m&#225; dan&#253; produkt pot&#345;ebn&#225; opr&#225;vn&#283;n&#237; k z&#225;pisu do p&#345;&#237;slu&#353;n&#233;ho adres&#225;&#345;e, zda nen&#237; c&#237;lov&#253; soubor uzam&#269;en a zda je k dispozici dostatek &#250;lo&#382;n&#233;ho prostoru.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: Aplikaci {0} nebylo mo&#382;n&#233; zajistit pro v&#353;echny uzly v bu&#328;ce. Aplikaci lze implementovat pouze v uzlech verze 8. Chyba interpretace: {1}.
  </MsgText>
  <Explanation>
    Importovan&#225; aplikace byla &#250;sp&#283;&#353;n&#283; zaji&#353;t&#283;na pro produkt WebSphere Application Server verze 8, nebylo v&#353;ak mo&#382;n&#233; zajistit ji pro bal&#237;k funkc&#237; OSGi Applications Feature Pack v produktu WebSphere Application Server verze 7.
  </Explanation>
  <UserResponse>
    Nen&#237; po&#382;adov&#225;na &#382;&#225;dn&#225; akce. Informace uveden&#233; v r&#225;mci chyby interpretace v&#353;ak m&#367;&#382;ete pou&#382;&#237;t k &#250;prav&#283; aplikace tak, aby mohla b&#253;t implementov&#225;na s bal&#237;kem funkc&#237; OSGi Applications Feature Pack produktu WebSphere Application Server verze 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Pou&#382;it&#237; hodnoty localhost jako n&#225;zvu hostitele pro transport serveru {0}.{1}. Sm&#283;rov&#225;n&#237; po&#382;adavk&#367; bude fungovat, dokud se webov&#253; a aplika&#269;n&#237; server nach&#225;z&#237; ve stejn&#233;m uzlu.
  </MsgText>
  <Explanation>
    N&#225;zev hostitele aplika&#269;n&#237;ho serveru zadan&#253; v transportu byl interpretov&#225;n jako hodnota localhost.
  </Explanation>
  <UserResponse>
    Pokud se webov&#253; a aplika&#269;n&#237; server nach&#225;z&#237; v r&#367;zn&#253;ch uzlech, zjist&#283;te, pro&#269; byl n&#225;zev hostitele aplika&#269;n&#237;ho serveru interpretov&#225;n jako hodnota localhost.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: Soubor EBA {0} nelze nainstalovat. Polo&#382;ka Application-SymbolicName {1} souboru EBA je ji&#382; pou&#382;&#237;v&#225;na aktivem {2}.
  </MsgText>
  <Explanation>
    Pokou&#353;&#237;te se nainstalovat soubor EBA, existuje v&#353;ak aktivum se stejn&#253;m symbolick&#253;m n&#225;zvem.
  </Explanation>
  <UserResponse>
    Bu&#271; zm&#283;&#328;te symbolick&#253; n&#225;zev instalovan&#233;ho souboru EBA, nebo odinstalujte existuj&#237;c&#237; aktivum.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: V uzlu {0} nelze vytvo&#345;it &#269;lena klastru, proto&#382;e pro n&#283;j nelze zajistit aplikace OSGi {1}. Chyba interpretace: {2}.
  </MsgText>
  <Explanation>
    V&#353;ichni &#269;lenov&#233; klastru mus&#237; b&#253;t schopni spou&#353;t&#283;t stejn&#233; aplikace, nov&#253; &#269;len klastru v&#353;ak nem&#367;&#382;e spou&#353;t&#283;t uveden&#233; aplikace OSGi.
  </Explanation>
  <UserResponse>
    Vyberte jin&#253; (kompatibiln&#237;) uzel, kter&#253; bude hostitelem klastru, nebo aplikace upravte tak, aby je bylo mo&#382;n&#233; spou&#353;t&#283;t s pou&#382;it&#237;m vybran&#233;ho uzlu.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: Nelze analyzovat soubor {0} pro soubor EBA (Enterprise Bundle Archive) {1}.
  </MsgText>
  <Explanation>
    Uveden&#253; soubor se nepoda&#345;ilo analyzovat.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda m&#225; soubor spr&#225;vn&#253; form&#225;t a zda nen&#237; po&#353;kozen.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Do&#353;lo k intern&#237; chyb&#283;. Nelze na&#269;&#237;st manifest aplikace nebo soubor typu manifest implementace pro soubor EBA (Enterprise Bundle Archive) {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: Nelze vytvo&#345;it soubor: {0}
  </MsgText>
  <Explanation>
    P&#345;i vytv&#225;&#345;en&#237; vy&#382;adovan&#233;ho n&#225;zvu cesty v pr&#367;b&#283;hu exportov&#225;n&#237; aktiva do&#353;lo k chyb&#283;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e aplika&#269;n&#237; server m&#225; opr&#225;vn&#283;n&#237; k vytvo&#345;en&#237; dan&#233;ho n&#225;zvu cesty.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: P&#345;&#237;kaz UpdateAppContentVersionStep z WAS V7 byl v aplika&#269;n&#237;m serveru WAS V8 nahrazen p&#345;&#237;kazem UpdateAppContentVersions.
  </MsgText>
  <Explanation>
    P&#345;&#237;kaz UpdateAppContentVersionStep pou&#382;&#237;van&#253; v aplika&#269;n&#237;m serveru WAS V7 byl ve WAS V8 nahrazen p&#345;&#237;kazem UpdateAppContentVersions. Dal&#353;&#237; informace naleznete v Informa&#269;n&#237;m centru.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te skript tak, aby pou&#382;&#237;val p&#345;&#237;kaz UpdateAppContentVersions.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Do&#353;lo k intern&#237; chyb&#283;. Soubor archivu EBA {0} po p&#345;evodu neobsahuje &#382;&#225;dn&#253; obsah, kter&#253; by bylo mo&#382;n&#233; implementovat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: Nepoda&#345;ilo se rozpoznat soubor archivu EBA. V&#253;jimka: {0}.
  </MsgText>
  <Explanation>
    Syst&#233;mu se v souboru archivu EBA (Enterprise Bundle Archive) nepoda&#345;ilo rozpoznat um&#237;st&#283;n&#237; konstituuj&#237;c&#237;ch objekt&#367; bundle aplikace (pro odpov&#237;daj&#237;c&#237; verze).
  </Explanation>
  <UserResponse>
    Dal&#353;&#237; informace lze naj&#237;t ve zpr&#225;v&#283; k v&#253;jimce.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Do&#353;lo k intern&#237; chyb&#283;. Nepoda&#345;ilo se rozpoznat soubor archivu EBA (Enterprise Bundle Archive) {0}, proto&#382;e slu&#382;ba {1} nen&#237; dostupn&#225;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: Zadan&#253; u&#382;ivatel {0} je neplatn&#253;.
  </MsgText>
  <Explanation>
    Byl proveden pokus o mapov&#225;n&#237; role zabezpe&#269;en&#237; na neplatn&#233;ho u&#382;ivatele.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te existenci ur&#269;en&#233;ho u&#382;ivatele.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Do&#353;lo k intern&#237; chyb&#283;. Nelze nal&#233;zt spravovan&#253; objekt typu bean BundleCacheManager pro profil {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: Vazba {0} pro odkaz na EJB {1} v bal&#237;ku {2} verze {3} s rozhran&#237;m {4} m&#367;&#382;e zp&#367;sobit nespr&#225;vn&#233; fungov&#225;n&#237; aplikace po aktualizaci.
  </MsgText>
  <Explanation>
    Z&#225;kladn&#237; &#269;&#225;sti odkaz&#367; na vyhled&#225;v&#225;n&#237; java:global/application_name/module_name/ejb_name nebo java:app/module_name/ejb_name se mohou po aktualizaci aplikace OSGi zm&#283;nit, tak&#382;e je t&#345;eba pat&#345;i&#269;n&#253;m zp&#367;sobem upravit odkazy, v d&#367;sledku &#269;eho&#382; je tento p&#345;&#237;stup nepraktick&#253;.
  </Explanation>
  <UserResponse>
    Pomoc&#237; slu&#382;eb OSGi nakonfigurujte z&#225;vislosti EJB nebo deklarujte odkaz EJB a napamujte jej na n&#225;zev rozhran&#237; JNDI EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Nelze rozbalit soubor EBA (Enterprise Bundle Archive) {0}, nelze vytvo&#345;it adres&#225;&#345; {1}.
  </MsgText>
  <Explanation>
    P&#345;i pokusu o rozbalen&#237; zadan&#233;ho souboru EBA nebylo mo&#382;n&#233; vytvo&#345;it po&#382;adovan&#253; adres&#225;&#345;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e aplika&#269;n&#237; server m&#225; opr&#225;vn&#283;n&#237; k vytvo&#345;en&#237; zadan&#233;ho adres&#225;&#345;e.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: Nelze rozpoznat aktivum {0}. Toto aktivum m&#225; nekompatibiln&#237; po&#382;adavky na verze n&#225;sleduj&#237;c&#237;ch bal&#237;k&#367;: {1}
  </MsgText>
  <Explanation>
    U objekt&#367; bundle uveden&#253;ch v z&#225;hlav&#237; Application-Content souboru APPLICATION.MF mus&#237; m&#237;t v&#353;echny importy pro dan&#253; bal&#237;k kompatibiln&#237; po&#382;adavky na verze.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te rozd&#283;len&#237; aplikace do bal&#237;k&#367; nebo jej&#237; konfiguraci tak, aby objekty bundle, kter&#233; jsou uvedeny v z&#225;hlav&#237; Application-Content, m&#283;ly kompatibiln&#237; po&#382;adavky na verze bal&#237;k&#367;.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Role Spustit jako nelze konfigurovat pro uzly verze ni&#382;&#353;&#237; ne&#382; WebSphere Application Server verze 8. Jak&#225;koli konfigurace bude ignorov&#225;na.
  </MsgText>
  <Explanation>
    Role Spustit jako lze konfigurovat pouze pro produkt WebSphere Application Server verze 8 nebo vy&#353;&#353;&#237;. Nelze je konfigurovat pro kompozi&#269;n&#237; jednotku implementovanou v c&#237;lech s bal&#237;kem funkc&#237; OSGi Applications Feature Pack pro produkt WebSphere Application Server verze 7.
  </Explanation>
  <UserResponse>
    Nen&#237; po&#382;adov&#225;na &#382;&#225;dn&#225; akce. Je-li t&#345;eba konfigurovat role Run As, odeberte ve&#353;ker&#225; mapov&#225;n&#237; c&#237;l&#367; pro uzly s bal&#237;kem funkc&#237; OSGi Applications Feature Pack pro produkt WebSphere Application Server verze 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: Jm&#233;no u&#382;ivatele nebo heslo je nespr&#225;vn&#233;.
  </MsgText>
  <Explanation>
    Bylo zad&#225;no nespr&#225;vn&#233; jm&#233;no u&#382;ivatele &#269;i heslo.
  </Explanation>
  <UserResponse>
    Zopakujte akci se spr&#225;vn&#253;m jm&#233;nem u&#382;ivatele a heslem.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: Operace aktualizace pro aplikaci OSGi implementovanou v kompozi&#269;n&#237; jednotce {0} v aplikaci BLA {1} se nezda&#345;ila.
  </MsgText>
  <Explanation>
    B&#283;hem operace aktualizace do&#353;lo k v&#253;jimce.
  </Explanation>
  <UserResponse>
    V protokolech serveru, kter&#233; p&#345;edch&#225;zely t&#233;to v&#253;jimce, vyhledejte p&#345;esn&#283;j&#353;&#237; diagnostiku probl&#233;mu.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Do&#353;lo k intern&#237; chyb&#283;. Polo&#382;ka Application-Content souboru typu manifest aplikace v souboru EBA {0} je pr&#225;zdn&#225;, proto nebude nainstalov&#225;n &#382;&#225;dn&#253; objekt bundle.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: Nelze &#269;&#237;st soubor deskriptoru aplikace Java EE v souboru EBA {0}.
  </MsgText>
  <Explanation>
    P&#345;i &#269;ten&#237; souboru deskriptoru aplikace Java EE v souboru EBA (Enterprise Bundle Archive) se vyskytla v&#253;jimka I/O.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda nen&#237; soubor deskriptoru aplikace po&#353;kozen, zda je &#269;iteln&#253; a zda jsou pro n&#283;j nastavena odpov&#237;daj&#237;c&#237; opr&#225;vn&#283;n&#237;.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: V c&#237;li {2} nebyl nalezen odkaz na prost&#345;edek s n&#225;zvem rozhran&#237; JNDI {0} a typem {1} pro odkaz na prost&#345;edek webov&#233;ho modulu {3} definovan&#253; v objektu bundle {4} s verz&#237; {5}.
  </MsgText>
  <Explanation>
    Soubor EBA (Enterprise Bundle Archive), kter&#253; obsahuje odkazy na prost&#345;edky v archivu webov&#233; aplikace (soubor WAR) ur&#269;uje n&#225;zev JNDI pro odkaz na prost&#345;edek, kter&#253; neexistuje v oboru n&#225;zv&#367; JNDI.
  </Explanation>
  <UserResponse>
    Pokud m&#225; b&#253;t odkaz na prost&#345;edek obsa&#382;en v oboru n&#225;zv&#367; JNDI, bu&#271; vytvo&#345;te vazbu mezi objektem a n&#225;zvem, nebo opravte odkaz na prost&#345;edek a aktualizujte soubor EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Nelze vytvo&#345;it &#382;&#225;dnou v&#253;choz&#237; vazbu pro odkaz na EJB {0} v bal&#237;ku {1} verze {2} s rozhran&#237;m {3}, proto&#382;e existuj&#237; dv&#283; nebo v&#237;ce mo&#382;n&#253;ch vazeb. Odkaz lze v&#225;zat na kter&#253;koli z n&#225;sleduj&#237;c&#237;ch objekt&#367; enterprise bean: {4}.
  </MsgText>
  <Explanation>
    Pro odkazy na EJB bez vazeb je t&#345;eba vytvo&#345;it v&#253;choz&#237; vazby. Bylo nalezeno v&#237;ce mo&#382;n&#253;ch objekt&#367; enterprise bean, na n&#283;&#382; je mo&#382;n&#233; v&#225;zat tento odkaz.
  </Explanation>
  <UserResponse>
    Bu&#271; odkaz nava&#382;te na konkr&#233;tn&#237; objekt enterprise bean, nebo opravte aplikaci.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: Alias ov&#283;&#345;ov&#225;n&#237; {0} nen&#237; spr&#225;vn&#283; konfigurov&#225;n. Nelze jej pou&#382;&#237;t k vytvo&#345;en&#237; vazby aliasu s typem ov&#283;&#345;ov&#225;n&#237; Aplikace na odkazy.
  </MsgText>
  <Explanation>
    Aliasy ov&#283;&#345;ov&#225;n&#237; s typem ov&#283;&#345;ov&#225;n&#237; Aplikace nelze sv&#225;zat s odkazy na prost&#345;edky Blueprint.
  </Explanation>
  <UserResponse>
    Odeberte tento alias ov&#283;&#345;ov&#225;n&#237; z odpov&#237;daj&#237;c&#237;ho odkazu na prost&#345;edek.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: Virtu&#225;ln&#237; hostitel {0} ur&#269;en&#253; pro objekt bundle {1} neexistuje.
  </MsgText>
  <Explanation>
    Byl proveden pokus o mapov&#225;n&#237; souboru objektu bundle webov&#233; aplikace (WAB) na neplatn&#233;ho virtu&#225;ln&#237;ho hostitele.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te existenci ur&#269;en&#233;ho virtu&#225;ln&#237;ho hostitele.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: V souboru typu manifest aplikace {0} souboru EBA jsou v z&#225;hlav&#237; Application-Content uvedeny objekty bundle, kter&#233; jsou obsa&#382;eny tak&#233; v z&#225;hlav&#237; Use-Bundle.
  </MsgText>
  <Explanation>
    N&#225;zvy objekt&#367; bundle uveden&#233; v z&#225;hlav&#237; Application-Content souboru APPLICATION.MF nemohou b&#253;t sou&#269;asn&#283; uvedeny v z&#225;hlav&#237; Use-Bundle, a to bez ohledu na verze objekt&#367; bundle.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te obsah bal&#237;k&#367; v souboru EBA (Enterprise Bundle Archive) tak, aby se v z&#225;hlav&#237;ch Application-Content a Use-Bundle nevyskytovaly duplicitn&#237; n&#225;zvy objekt&#367; bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: Archiv slo&#382;en&#253;ch objekt&#367; (CBA) {0} je neplatn&#253;. Bal&#237;ky importovan&#233; objekty bundle v archivu CBA v z&#225;hlav&#237; Importovat bal&#237;k souboru typu manifest CBA chyb&#237;. Ohl&#225;&#353;eny byly n&#225;sleduj&#237;c&#237; probl&#233;my: {1}.
  </MsgText>
  <Explanation>
    Pokud objekt bundle v archivu slo&#382;en&#253;ch objekt&#367; bundle (CBA) pou&#382;&#237;v&#225; bal&#237;k, kter&#253; v objektu bundle nen&#237; obsa&#382;en nebo je exportov&#225;n jin&#253;m objektem bundle v r&#225;mci t&#233;ho&#382; archivu CBA, mus&#237; archiv CBA importovat p&#345;&#237;slu&#353;n&#253; bal&#237;k.
  </Explanation>
  <UserResponse>
    Opravte slo&#382;en&#253; soubor typu manifest COMPOSITEBUNDLE.MF tak, aby archiv CBA importoval v&#353;echny bal&#237;ky, je&#382; jsou pou&#382;&#237;v&#225;ny objekty bundle obsa&#382;en&#253;mi v archivu CBA a nejsou v archivu CBA k dispozici jin&#253;m zp&#367;sobem.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: Objekt enterprise bean {0} v bal&#237;ku {1} ve verzi {2} m&#225; ve sv&#233;m souboru vazeb v&#237;ce mapov&#225;n&#237; pro rozhran&#237; {3}. Jednalo se o mapov&#225;n&#237; {4} a {5}.
  </MsgText>
  <Explanation>
    V&#225;z&#225;n&#237; EJB zahrnut&#233; v bal&#237;ku obsahuje nejednozna&#269;n&#233; informace o konfiguraci mapov&#225;n&#237; pro rozhran&#237; EJB
  </Explanation>
  <UserResponse>
    Opravte v&#225;zac&#237; soubor, aby obsahoval pro ka&#382;d&#233; rozhran&#237; EJB jen jedno nakonfigurovan&#233; mapov&#225;n&#237;.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: V aktu&#225;ln&#237; bu&#328;ce nebyla nalezena &#382;&#225;dn&#225; kompozi&#269;n&#237; jednotka s n&#225;zvem {0}.
  </MsgText>
  <Explanation>
    Uveden&#253; n&#225;zev neodpov&#237;d&#225; &#382;&#225;dn&#233;mu n&#225;zvu existuj&#237;c&#237; kompozi&#269;n&#237; jednotky.
  </Explanation>
  <UserResponse>
    Zkontrolujte n&#225;zev kompozi&#269;n&#237; jednotky.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: Soubor EBA {0} obsahuje soubor MANIFEST.MF se z&#225;hlav&#237;m Extension-List. P&#345;evod tohoto z&#225;hlav&#237; nen&#237; podporov&#225;n.
  </MsgText>
  <Explanation>
    Pokusili jste se p&#345;ev&#233;st soubor podnikov&#233;ho archivu (EAR) na soubor podnikov&#233;ho objektu bundle (EBA), p&#345;i&#269;em&#382; soubor EAR obsahuje soubor MANIFEST.MF se z&#225;hlav&#237;m Extension-List. P&#345;evod tohoto z&#225;hlav&#237; v&#353;ak nen&#237; podporov&#225;n. Soubor EAR vyu&#382;&#237;v&#225; z&#225;hlav&#237; Extension-List k identifikaci extern&#237;ch soubor&#367; JAR, je&#382; aplikace vy&#382;aduje v b&#283;hov&#233;m re&#382;imu.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e extern&#237; soubory JAR uveden&#233; v z&#225;hlav&#237; Extension-List jsou k dispozici jako objekty bundle v &#250;lo&#382;i&#353;ti objekt&#367; bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: Nelze rozpoznat aktivum {0}. Toto aktivum vy&#382;aduje objekt bundle {1}, kter&#253; nen&#237; uveden v z&#225;hlav&#237; Application-Content v souboru typu manifest aplikace APPLICATION.MF. Tento objekt bundle importuje bal&#237;k {2} z objektu bundle {3} uveden&#233;ho v z&#225;hlav&#237; Application-Content.
  </MsgText>
  <Explanation>
    Aplikace nen&#237; spr&#225;vn&#283; nakonfigurov&#225;na. Do sd&#237;len&#233;ho objektu bundle nelze importovat bal&#237;k z izolovan&#233;ho objektu bundle. Objekty bundle uveden&#233; v z&#225;hlav&#237; Application-Content jsou izolovan&#233; a mohou poskytovat bal&#237;ky pouze dal&#353;&#237;m objekt&#367;m bundle uveden&#253;m v tomto z&#225;hlav&#237;.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te rozd&#283;len&#237; aplikace do bal&#237;k&#367; nebo jej&#237; konfiguraci tak, aby objekty bundle, kter&#233; jsou uvedeny v z&#225;hlav&#237; Use-Bundle nebo byly p&#345;id&#225;ny vyhodnocovac&#237;m modulem, nevy&#382;adovaly bal&#237;ky z objekt&#367; bundle uveden&#253;ch v z&#225;hlav&#237; Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep m&#283;l b&#253;t spu&#353;t&#283;na nebyl.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: Aktivum {0} nelze implementovat v c&#237;li {1} v dom&#233;n&#283; zabezpe&#269;en&#237; {2} a z&#225;rove&#328; v c&#237;li {3} v dom&#233;n&#283; zabezpe&#269;en&#237; {4}.
  </MsgText>
  <Explanation>
    Chcete-li implementovat jedno aktivum do v&#237;ce c&#237;l&#367;, mus&#237; se tyto c&#237;le nach&#225;zet ve stejn&#233; dom&#233;n&#283; zabezpe&#269;en&#237;.
  </Explanation>
  <UserResponse>
    Zm&#283;&#328;te c&#237;le implementace tak, &#382;e vyberete sadu c&#237;l&#367; z jedn&#233; dom&#233;ny zabezpe&#269;en&#237;.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: Slo&#382;en&#253; soubor typu manifest archivu CBA (Composite Bundle Archive) {0} obsahuje z&#225;hlav&#237; CompositeBundle-ExportService, ale tomuto filtru neodpov&#237;daj&#237; &#382;&#225;dn&#233; slu&#382;by definovan&#233; v CBA.
  </MsgText>
  <Explanation>
    Soubor typu manifest kompozitn&#237;ho bal&#237;ku definuje z&#225;hlav&#237; CompositeBundle-ExportService, ale tomuto filtru neodpov&#237;daj&#237; &#382;&#225;dn&#233; deklarace slu&#382;eb blueprint.
  </Explanation>
  <UserResponse>
    Bu&#271; p&#345;idejte chyb&#283;j&#237;c&#237; deklarace slu&#382;eb produktu Blueprint do obsahu archivu CBA, nebo opravte z&#225;hlav&#237; CompositeBundle-ExportService ze slo&#382;en&#233;ho souboru typu manifest COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: Objekt enterprise bean {0} v bal&#237;ku {1} ve verzi {2} m&#225; nadefinov&#225;n n&#225;zev jednoduch&#233;ho mapov&#225;n&#237;, ale ve v&#225;zac&#237;m souboru m&#225; i specifick&#225; mapov&#225;n&#237;.
  </MsgText>
  <Explanation>
    V&#225;z&#225;n&#237; EJB zahrnut&#233; v bal&#237;ku obsahuje neplatnou konfiguraci mapov&#225;n&#237; pro objekt enterprise bean.
  </Explanation>
  <UserResponse>
    Opravte v&#225;zac&#237; soubor, aby obsahoval bu&#271; n&#225;zev jednoduch&#233;ho mapov&#225;n&#237;, nebo specifick&#233; informace o konfiguraci mapov&#225;n&#237;, ale ne oboj&#237;.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Do&#353;lo k intern&#237; chyb&#283;. Nelze odstranit listov&#253; adres&#225;&#345; {0}, aby bylo mo&#382;n&#233; pokra&#269;ovat v p&#345;ejmenov&#225;v&#225;n&#237; adres&#225;&#345;e.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Do&#353;lo k intern&#237; chyb&#283;. Nelze rozbalit soubor EBA (Enterprise Bundle Archive), v konfiguraci nebyl ur&#269;en &#382;&#225;dn&#253; adres&#225;&#345; pro rozbalen&#237; souboru {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: Byl proveden pokus o aktualizaci aktiva aplikace OSGi. Tato akce nen&#237; podporov&#225;na. Aktiva aplikace OSGi lze aktualizovat pomoc&#237; panelu &quot;Aktualizovat verze objekt&#367; bundle v t&#233;to aplikaci&quot; na str&#225;nce konfigurace aktiv aplikace OSGi.
  </MsgText>
  <Explanation>
    Mo&#382;nost aktualizace aktiva funkce OSGi Applications s pou&#382;it&#237;m nov&#233;ho bin&#225;rn&#237;ho k&#243;du nen&#237; podporov&#225;na.
  </Explanation>
  <UserResponse>
    Pokud pot&#345;ebujete prov&#233;st rozs&#225;hlej&#353;&#237; operaci ne&#382; aktualizaci verz&#237; objektu bundle v r&#225;mci existuj&#237;c&#237;ho aktiva, je t&#345;eba p&#345;ed importov&#225;n&#237;m n&#225;hrady aktiva odinstalovat st&#225;vaj&#237;c&#237; aktivum. M&#367;&#382;ete tak&#233; p&#345;idat nov&#233; objekty bundle do existuj&#237;c&#237; aplikace jejich za&#269;len&#283;n&#237;m do archivu slo&#382;en&#253;ch objekt&#367; bundle (CBA) a p&#345;id&#225;n&#237;m archivu CBA jako roz&#353;&#237;&#345;en&#237; do kompozi&#269;n&#237; jednotky.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Pro objekt typu {0} v bal&#237;ku {1} verze {2} na c&#237;li {3} nebyl nakonfigurov&#225;n &#382;&#225;dn&#253; n&#225;zev rozhran&#237; JNDI aktiva&#269;n&#237; specifikace objektu MDB.
  </MsgText>
  <Explanation>
    Nebyl nakonfigurov&#225;n n&#225;zev rozhran&#237; JNDI aktiva&#269;n&#237; specifikace v&#225;z&#225;n&#237; modulu listener objektu MDB.
  </Explanation>
  <UserResponse>
    Pro objekt MDB je t&#345;eba nakonfigurovat odkaz na rozhran&#237; JNDI aktiva&#269;n&#237; specifikace.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Nelze p&#345;ejmenovat soubor {0} na n&#225;zev {1} jako sou&#269;&#225;st rozbalen&#237; souboru EBA (Enterprise Bundle Archive) {2}.
  </MsgText>
  <Explanation>
    Chcete-li dokon&#269;it rozbalen&#237; ur&#269;en&#233;ho souboru EBA, je nutn&#233; p&#345;ejmenovat soubor. Toto p&#345;ejmenov&#225;n&#237; neprob&#283;hlo &#250;sp&#283;&#353;n&#283;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e aplika&#269;n&#237; server m&#225; opr&#225;vn&#283;n&#237; k p&#345;ejmenov&#225;n&#237; dan&#233;ho souboru.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: Archiv slo&#382;en&#253;ch objekt&#367; (CBA) {0} je neplatn&#253;. N&#225;sleduj&#237;c&#237; exportovan&#233; bal&#237;ky uveden&#233; ve slo&#382;en&#233;m souboru typu manifest nejsou exportov&#225;ny objekty bundle v archivu CBA: {1}
  </MsgText>
  <Explanation>
    Archiv CBA m&#367;&#382;e exportovat pouze bal&#237;ky exportovan&#233; objekty bundle v p&#345;&#237;slu&#353;n&#233;m archivu CBA.
  </Explanation>
  <UserResponse>
    P&#345;idejte chyb&#283;j&#237;c&#237; bal&#237;ky pro exportov&#225;n&#237; do objekt&#367; bundle v archivu CBA nebo odeberte podrobnosti o nevy&#345;&#237;zen&#253;ch exportech ze slo&#382;en&#233;ho souboru typu manifest COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: Nelze p&#345;idat aktivum {0}, proto&#382;e nejsou sta&#382;eny objekty bundle, kter&#233; toto aktivum vy&#382;aduje. Chcete-li zah&#225;jit proces stahov&#225;n&#237; objektu bundle, ulo&#382;te po importu aktiva zm&#283;ny v hlavn&#237; konfiguraci.
  </MsgText>
  <Explanation>
    Byl proveden pokus o p&#345;id&#225;n&#237; aktiva, kter&#233; vy&#382;aduje sta&#382;en&#237; jednoho nebo v&#237;ce objekt&#367; bundle z ur&#269;it&#233;ho &#250;lo&#382;i&#353;t&#283;. Je mo&#382;n&#233;, &#382;e stahov&#225;n&#237; nebylo spu&#353;t&#283;no nebo nebylo dosud dokon&#269;eno.
  </Explanation>
  <UserResponse>
    Pokud jste neulo&#382;ili zm&#283;ny po importu aktiva, ulo&#382;te tyto zm&#283;ny nyn&#237;. Vy&#269;kejte na dokon&#269;en&#237; stahov&#225;n&#237; objektu bundle a pot&#233; zkuste aktivum znovu p&#345;idat do aplikace BLA. Pr&#367;b&#283;&#382;n&#253; stav stahov&#225;n&#237; objektu bundle pro aktivum lze sledovat na panelu s &#250;daji o aktivu v administrativn&#237; konzole.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: Obsah souboru typu manifest implementace je nespr&#225;vn&#253;. Jsou vy&#382;adov&#225;ny n&#225;sleduj&#237;c&#237; p&#345;&#237;davn&#233; objekty bundle: {0}
  </MsgText>
  <Explanation>
    Soubor typu manifest implementace, kter&#253; m&#283;l b&#253;t importov&#225;n, neobsahuje v&#353;echny objekty bundle pot&#345;ebn&#233; k interpretaci aktiva EBA (Enterprise Bundle Archive).
  </Explanation>
  <UserResponse>
    Ujist&#283;te se, &#382;e nov&#253; soubor typu manifest implementace DEPLOYMENT.MF obsahuje v&#353;echny objekty bundle uveden&#233; ve zpr&#225;v&#283; v&#253;jimky. Neimplementujte soubor typu manifest ru&#269;n&#283;. V p&#345;&#237;pad&#283; pot&#345;eby odeberte soubor typu manifest implementace ze souboru EBA. P&#345;i importov&#225;n&#237; souboru EBA tak dojde k vygenerov&#225;n&#237; nov&#233;ho souboru typu manifest implementace.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: Nelze vytvo&#345;it adres&#225;&#345; {0}.
  </MsgText>
  <Explanation>
    Nelze vytvo&#345;it uveden&#253; adres&#225;&#345;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, zda je v &#250;lo&#382;i&#353;ti voln&#233; m&#237;sto a zda m&#225; dan&#253; produkt pot&#345;ebn&#225; opr&#225;vn&#283;n&#237; k vytvo&#345;en&#237; adres&#225;&#345;e.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: Nelze exportovat aktivum {0}, proto&#382;e vy&#382;adovan&#253; objekt bundle {1} nen&#237; zcela sta&#382;en.
  </MsgText>
  <Explanation>
    Byl proveden pokus o exportov&#225;n&#237; aktiva, kter&#233; vy&#382;aduje sta&#382;en&#237; jednoho nebo v&#237;ce objekt&#367; bundle z ur&#269;it&#233;ho &#250;lo&#382;i&#353;t&#283;. Je mo&#382;n&#233;, &#382;e stahov&#225;n&#237; nebylo spu&#353;t&#283;no nebo nebylo dosud dokon&#269;eno.
  </Explanation>
  <UserResponse>
    Pokud jste neulo&#382;ili zm&#283;ny po importu aktiva, ulo&#382;te tyto zm&#283;ny nyn&#237;. Vy&#269;kejte na dokon&#269;en&#237; stahov&#225;n&#237; objektu bundle a pot&#233; zkuste znovu exportovat aktivum.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Do&#353;lo k intern&#237; chyb&#283;. V registru slu&#382;eb OSGi nen&#237; k dispozici slu&#382;ba DeploymentManifestManager.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: Nepoda&#345;ilo se rozpoznat soubor archivu EBA. Pou&#382;it&#253; soubor typu manifest implementace nen&#237; v tomto syst&#233;mu platn&#253;. V&#253;jimka: {0}.
  </MsgText>
  <Explanation>
    V souboru typu manifest implementace jsou uvedeny konkr&#233;tn&#237; verze vy&#382;adovan&#253;ch objekt&#367; bundle. Syst&#233;mu se nepoda&#345;ilo zjistit, o jak&#233; verze objekt&#367; bundle se jedn&#225;. Je-li soubor typu manifest implementace zahrnut do souboru EBA, vyhodnocovac&#237; modul pou&#382;ije pouze verze objekt&#367; bundle uveden&#233; v souboru typu manifest. V syst&#233;mu mohou b&#253;t k dispozici jin&#233; platn&#233; verze objekt&#367; bundle, ty v&#353;ak nebudou pou&#382;ity, proto&#382;e nejsou uvedeny v souboru typu manifest implementace.
  </Explanation>
  <UserResponse>
    Pot&#345;ebuje-li aplikace pou&#382;&#237;t soubor typu manifest implementace, nap&#345;&#237;klad pro zaji&#353;t&#283;n&#237; shodn&#233; konfigurace objektu bundle v n&#283;kolika r&#367;zn&#253;ch prost&#345;ed&#237;ch, identifikujte z informac&#237; uveden&#253;ch ve zpr&#225;v&#283; o v&#253;jimce, kter&#233; verze objektu bundle jsou po&#382;adov&#225;ny, a zp&#345;&#237;stupn&#283;te je v syst&#233;mu. Pokud aplikace tuto dodate&#269;nou &#250;rove&#328; kontroly nevy&#382;aduje, odeberte soubor typu manifest implementace. Neimplementujte soubor typu manifest ru&#269;n&#283;.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: Hodnota zadan&#225; pro soubor typu manifest aplikace verze {0} nen&#237; podporov&#225;na. Podporovan&#225; verze je {1}.
  </MsgText>
  <Explanation>
    Hodnota zadan&#225; pro z&#225;hlav&#237; Application-ManifestVersion v souboru APPLICATION.MF je nespr&#225;vn&#225;.
  </Explanation>
  <UserResponse>
    Opravte hodnotu Application-ManifestVersion v souboru APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Po&#382;adavky ur&#269;en&#233; souborem typu manifest implementace v dan&#233;m souboru EBA nelze splnit. Bude vygenerov&#225;na v&#253;jimka {0}.
  </MsgText>
  <Explanation>
    Do&#353;lo k pokusu o importov&#225;n&#237; souboru EBA, kter&#253; obsahuje soubor typu manifest implementace. Po&#382;adavky ur&#269;en&#233; t&#237;mto souborem nelze splnit.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te obsah souboru typu manifest implementace a ov&#283;&#345;te kompatibilitu syst&#233;mu, kde je implementov&#225;n dan&#253; soubor EBA. Ov&#283;&#345;te, &#382;e jsou konfigurov&#225;na vy&#382;adovan&#225; intern&#237; nebo extern&#237; &#250;lo&#382;i&#353;t&#283; objekt&#367; bundle. Neimplementujte soubor typu manifest ru&#269;n&#283;. V p&#345;&#237;pad&#283; pot&#345;eby odeberte soubor typu manifest implementace ze souboru EBA. P&#345;i importov&#225;n&#237; souboru EBA tak dojde k vygenerov&#225;n&#237; nov&#233;ho souboru typu manifest implementace.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: V souboru EBA {0} je v p&#345;&#237;slu&#353;n&#233;m souboru typu manifest aplikace specifikov&#225;no z&#225;hlav&#237; Application-Content, av&#353;ak tato polo&#382;ka je pr&#225;zdn&#225;.
  </MsgText>
  <Explanation>
    Soubor EBA (Enterprise Bundle Archive) obsahuje pr&#225;zdn&#233; z&#225;hlav&#237; Application-Content v p&#345;&#237;slu&#353;n&#233;m souboru typu manifest aplikace application.mf. Je-li z&#225;hlav&#237; zad&#225;no, mus&#237; tato polo&#382;ka obsahovat alespo&#328; jeden platn&#253; objekt bundle.
  </Explanation>
  <UserResponse>
    Upravte z&#225;hlav&#237; Application-Content v souboru application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: V c&#237;li {1} pro prost&#345;edek pou&#382;&#237;van&#253; objektem typu bean {2} v bal&#237;ku {3} verze {4} nelze naj&#237;t m&#237;sto ur&#269;en&#237; objektu MDB, kter&#233; odpov&#237;d&#225; n&#225;zvu rozhran&#237; JNDI {0}.
  </MsgText>
  <Explanation>
    Zadan&#253; n&#225;zev rozhran&#237; JNDI odkazu na m&#237;sto ur&#269;en&#237; v&#225;z&#225;n&#237; modulu listener objektu MDB neexistuje.
  </Explanation>
  <UserResponse>
    Pokud m&#225; b&#253;t odkaz obsa&#382;en v oboru n&#225;zv&#367; JNDI, bu&#271; vytvo&#345;te vazbu mezi objektem a n&#225;zvem, nebo opravte odkaz a aktualizujte soubor EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: V souboru EBA {0} nen&#237; definov&#225;no &#382;&#225;dn&#233; z&#225;hlav&#237; Application-Content a tento soubor neobsahuje ani &#382;&#225;dn&#233; platn&#233; objekty bundle.
  </MsgText>
  <Explanation>
    Soubor EBA (Enterprise Bundle Archive) mus&#237; obsahovat alespo&#328; jeden platn&#253; objekt bundle OSGi &#269;i soubor archivu webov&#253;ch aplikac&#237; (WAR) nebo mus&#237; b&#253;t v z&#225;hlav&#237; Application-Content p&#345;&#237;slu&#353;n&#233;ho souboru typu manifest aplikace uveden alespo&#328; jeden objekt bundle OSGi.
  </Explanation>
  <UserResponse>
    Upravte soubor EBA tak, aby obsahoval alespo&#328; jeden platn&#253; objekt bundle nebo soubor WAR (vlo&#382;en&#253; prost&#345;ednictv&#237;m hodnoty), nebo zajist&#283;te uveden&#237; alespo&#328; jednoho objektu bundle v z&#225;hlav&#237; Application-Content p&#345;&#237;slu&#353;n&#233;ho souboru typu manifest aplikace application.mf (vlo&#382;en&#233;ho prost&#345;ednictv&#237;m odkazu).
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: Nelze vytvo&#345;it adres&#225;&#345;: {0}
  </MsgText>
  <Explanation>
    P&#345;i vytv&#225;&#345;en&#237; vy&#382;adovan&#233;ho n&#225;zvu cesty v pr&#367;b&#283;hu exportov&#225;n&#237; aktiva do&#353;lo k chyb&#283;.
  </Explanation>
  <UserResponse>
    Ov&#283;&#345;te, &#382;e aplika&#269;n&#237; server m&#225; opr&#225;vn&#283;n&#237; k vytvo&#345;en&#237; dan&#233;ho n&#225;zvu cesty.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
