# COPYRIGHT_START***********************************************************
#
# IBM Confidential OCO Source Material
# 5724-J34 (C) COPYRIGHT International Business Machines Corp.
#   2009,2010
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#
xd.70.virtual.enterprise.description=WebSphere Virtual Enterprise\ub294 \ub3d9\uc801 \uc870\uc791 \ubc0f \ud655\uc7a5 \uad00\ub9ac \uac00\ub2a5\uc131\uc744 \uac1c\uc120\ud558\uc5ec WebSphere Application Server Network Deployment \ubc84\uc804 7.0\uc744 \ud655\uc7a5\ud569\ub2c8\ub2e4. \
\ud574\ub2f9 \ud504\ub85c\uadf8\ub7a8\uc5d0\ub294 PHP, Compute Grid \ubc0f \uace0\uc131\ub2a5 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0 \ub300\ud55c \uc870\uc791 \uc9c0\uc6d0\uc774 \ud3ec\ud568\ub429\ub2c8\ub2e4.

xd.70.xdagent.description=\uc774\ub294 \uc6d0\uaca9 \ubaa8\ub2c8\ud130\ub9c1\uc744 \ud3ec\ud568\ud55c \ud63c\ud569 \uc11c\ubc84 \ud658\uacbd\uc744 \uc9c0\uc6d0\ud558\uae30 \uc704\ud574 WebSphere Application Server\uac00 \uc124\uce58\ub418\uc9c0 \uc54a\uc740 \uc6d0\uaca9 \uc6cc\ud06c\uc2a4\ud14c\uc774\uc158\uc5d0 \uc124\uce58\ub418\ub294 \uc120\ud0dd\uc801 WebSphere Virtual Enterprise \uae30\ub2a5\uc785\ub2c8\ub2e4.

ve.70.fixpack.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Virtual Enterprise \ubc84\uc804 7.0 \uc124\uce58\ub97c \uc9c0\uc815\ub41c \uc218\uc815\ud329 \ub808\ubca8\ub85c \uc5c5\ub370\uc774\ud2b8\ud560 \ub54c \ud544\uc694\ud55c \ud30c\uc77c\uc744 \ud3ec\ud568\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ud544\uc694\ud55c \ud50c\ub7ab\ud3fc \ud30c\uc77c\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud558\uba74, \uad00\ub9ac\uc790\uac00 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere Update Installer\ub97c \uc0ac\uc6a9\ud558\uc5ec \ud574\ub2f9 \ud638\uc2a4\ud2b8\uc5d0 \uc124\uce58\ud560 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\uac8c \ub429\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Update Installer \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \ub300\uc0c1 \ud638\uc2a4\ud2b8 \uc5c5\ub370\uc774\ud2b8\ub97c \uc704\ud574 \uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud558\uae30 \uc804\uc5d0 Update Installer\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

xd.611.virtual.enterprise.description=WebSphere Virtual Enterprise\ub294 \ub3d9\uc801 \uc870\uc791 \ubc0f \ud655\uc7a5 \uad00\ub9ac \uac00\ub2a5\uc131\uc744 \uac1c\uc120\ud558\uc5ec WebSphere Application Server Network Deployment \ubc84\uc804 6.1 \ub610\ub294 \ubc84\uc804 7.0\uc744 \ud655\uc7a5\ud569\ub2c8\ub2e4. \
\ud574\ub2f9 \ud504\ub85c\uadf8\ub7a8\uc5d0\ub294 PHP, Compute Grid \ubc0f \uace0\uc131\ub2a5 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0 \ub300\ud55c \uc870\uc791 \uc9c0\uc6d0\uc774 \ud3ec\ud568\ub429\ub2c8\ub2e4.

xd.611.compute.grid.description=WebSphere Compute Grid\ub294 Compute Grid \uc791\uc5c5(\ud2b8\ub79c\uc7ad\uc158 \uc77c\uad04\ucc98\ub9ac \uc791\uc5c5, \ucef4\ud4e8\ud2b8 \uc9d1\uc57d \uc791\uc5c5 \ubc0f \uae30\ubcf8 \uc791\uc5c5)\uc758 \uc2e4\ud589\uc744 \uc9c0\uc6d0\ud558\uc5ec WebSphere Application Server Network Deployment \ubc84\uc804 6.1 \ub610\ub294 \ubc84\uc804 7.0\uc744 \ud655\uc7a5\ud569\ub2c8\ub2e4. \
\uc774 \uc791\uc5c5\uc744 \uc81c\uc5b4\ud558\ub294 \uc791\uc5c5 \uad00\ub9ac \uae30\ub2a5 \ubc0f \uc2a4\ucf00\uc904\ub7ec\ub3c4 \uc5ec\uae30\uc5d0 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. 
xd.61.operations.optimizer.description=WebSphere Virtual Enterprise\ub294 \ub3d9\uc801 \uc870\uc791 \ubc0f \ud655\uc7a5 \uad00\ub9ac \uac00\ub2a5\uc131\uc744 \uac1c\uc120\ud558\uc5ec WebSphere Application Server Network Deployment \ubc84\uc804 6.1 \ub610\ub294 \ubc84\uc804 7.0\uc744 \ud655\uc7a5\ud569\ub2c8\ub2e4. \
\ud574\ub2f9 \ud504\ub85c\uadf8\ub7a8\uc5d0\ub294 PHP, Compute Grid \ubc0f \uace0\uc131\ub2a5 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0 \ub300\ud55c \uc870\uc791 \uc9c0\uc6d0\uc774 \ud3ec\ud568\ub429\ub2c8\ub2e4.

xd.61.xdagent.description=\uc774\ub294 \uc6d0\uaca9 \ubaa8\ub2c8\ud130\ub9c1\uc744 \ud3ec\ud568\ud55c \ud63c\ud569 \uc11c\ubc84 \ud658\uacbd\uc744 \uc9c0\uc6d0\ud558\uae30 \uc704\ud574 WebSphere Application Server\uac00 \uc124\uce58\ub418\uc9c0 \uc54a\uc740 \uc6d0\uaca9 \uc6cc\ud06c\uc2a4\ud14c\uc774\uc158\uc5d0 \uc124\uce58\ub418\ub294 \uc120\ud0dd\uc801 WebSphere Extended Deployment \uae30\ub2a5\uc785\ub2c8\ub2e4.
xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid\ub294 Compute Grid \uc791\uc5c5(\ud2b8\ub79c\uc7ad\uc158 \uc77c\uad04\ucc98\ub9ac \uc791\uc5c5, \ucef4\ud4e8\ud2b8 \uc9d1\uc57d \uc791\uc5c5 \ubc0f \uae30\ubcf8 \uc791\uc5c5)\uc758 \uc2e4\ud589\uc744 \uc9c0\uc6d0\ud558\uc5ec WebSphere Application Server Network Deployment \ubc84\uc804 6.1\uc744 \ud655\uc7a5\ud569\ub2c8\ub2e4. \
\uc774 \uc791\uc5c5\uc744 \uc81c\uc5b4\ud558\ub294 \uc791\uc5c5 \uad00\ub9ac \uae30\ub2a5 \ubc0f \uc2a4\ucf00\uc904\ub7ec\ub3c4 \uc5ec\uae30\uc5d0 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. 
xd.61.data.grid.description=WebSphere Extended Deployment Data Grid\ub294 \uace0\uc131\ub2a5 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc9c0\uc6d0\ud558\uc5ec WebSphere Application Server Network Deployment \ubc84\uc804 6.1\uc744 \ud655\uc7a5\ud569\ub2c8\ub2e4. \
\uc624\ube0c\uc81d\ud2b8 \uadf8\ub9ac\ub4dc \ubc0f \ud30c\ud2f0\uc158 \ubd84\ud560 \uae30\ub2a5\uc774 \uc5ec\uae30\uc5d0 \ud3ec\ud568\ub429\ub2c8\ub2e4. 
updi.61.description=Update Installer\ub294 IBM WebSphere \uc18c\ud504\ud2b8\uc6e8\uc5b4\uc5d0 \ub300\ud55c \uc784\uc2dc \uc218\uc815\uc0ac\ud56d, \uc218\uc815\ud329, Refresh Pack\uacfc \uac19\uc740 \uc5c5\ub370\uc774\ud2b8\ub97c \uc124\uce58\ud569\ub2c8\ub2e4. \
\uc774 Update Installer\ub294 WebSphere Application Server V6.1 \ub9b4\ub9ac\uc2a4\uc5d0 \uc0ac\uc6a9\ub429\ub2c8\ub2e4.

updi.70.description=Update Installer\ub294 IBM WebSphere \uc18c\ud504\ud2b8\uc6e8\uc5b4\uc5d0 \ub300\ud55c \uc784\uc2dc \uc218\uc815\uc0ac\ud56d, \uc218\uc815\ud329, Refresh Pack\uacfc \uac19\uc740 \uc5c5\ub370\uc774\ud2b8\ub97c \uc124\uce58\ud569\ub2c8\ub2e4. \
\uc774 Update Installer\ub294 WebSphere Application Server V6.1, V7.0 \ub9b4\ub9ac\uc2a4 \uc774\uc0c1\uc5d0 \uc0ac\uc6a9\ub429\ub2c8\ub2e4.

nd.61.fixpack.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Application Server Network Deployment \ubc84\uc804 6.1 \uc124\uce58\ub97c \uc9c0\uc815\ub41c \uc218\uc815\ud329 \ub808\ubca8\ub85c \uc5c5\ub370\uc774\ud2b8\ud560 \ub54c \ud544\uc694\ud55c \ud30c\uc77c\uc744 \ud3ec\ud568\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ud544\uc694\ud55c \ud50c\ub7ab\ud3fc \ud30c\uc77c\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud558\uba74, \uad00\ub9ac\uc790\uac00 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere Update Installer\ub97c \uc0ac\uc6a9\ud558\uc5ec \ud574\ub2f9 \ud638\uc2a4\ud2b8\uc5d0 \uc124\uce58\ud560 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\uac8c \ub429\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Update Installer \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \ub300\uc0c1 \ud638\uc2a4\ud2b8 \uc5c5\ub370\uc774\ud2b8\ub97c \uc704\ud574 \uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud558\uae30 \uc804\uc5d0 Update Installer\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

xd.61.fixpack.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Extended Deployment \ubc84\uc804 6.1 \uc124\uce58\ub97c \uc9c0\uc815\ub41c \uc218\uc815\ud329 \ub808\ubca8\ub85c \uc5c5\ub370\uc774\ud2b8\ud560 \ub54c \ud544\uc694\ud55c \ud30c\uc77c\uc744 \ud3ec\ud568\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ud544\uc694\ud55c \ud50c\ub7ab\ud3fc \ud30c\uc77c\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud558\uba74, \uad00\ub9ac\uc790\uac00 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere Update Installer\ub97c \uc0ac\uc6a9\ud558\uc5ec \ud574\ub2f9 \ud638\uc2a4\ud2b8\uc5d0 \uc124\uce58\ud560 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\uac8c \ub429\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Update Installer \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \ub300\uc0c1 \ud638\uc2a4\ud2b8 \uc5c5\ub370\uc774\ud2b8\ub97c \uc704\ud574 \uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub97c \uc0ac\uc6a9\ud558\uae30 \uc804\uc5d0 Update Installer\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

nd.61.maintenance.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 Application Server Network Deployment \ubc84\uc804 6.1\uc5d0 \uc801\uc6a9\ud558\ub294 \uc720\uc9c0\ubcf4\uc218 \ud328\ud0a4\uc9c0\ub85c, \uc0ac\uc6a9\uc790\uac00 \uc218\uc9d1\ud55c \uac83\uc785\ub2c8\ub2e4. \
\uc774 \ud328\ud0a4\uc9c0\ub294 IBM \uc9c0\uc6d0 \uc6f9 \uc0ac\uc774\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\uc790\uac00 \uc120\ud0dd\ud558\uc5ec \ub2e4\uc6b4\ub85c\ub4dc\ud55c \ud2b9\uc815 \uc81c\ud488\uc758 \uc784\uc2dc \ud53d\uc2a4\ub97c \ud3ec\ud568\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ub610\ud55c \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere Update Installer\ub97c \uc0ac\uc6a9\ud558\uc5ec \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc120\ud0dd\ud55c \uc720\uc9c0\ubcf4\uc218\ub97c \uc124\uce58\ud558\uac70\ub098 \uc124\uce58 \uc81c\uac70\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Update Installer \uc124\uce58 \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \uc774 \ud328\ud0a4\uc9c0\uc5d0\uc11c \uc218\uc815\uc0ac\ud56d\uc744 \uc124\uce58\ud558\uae30 \uc804\uc5d0 Update Installer\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

xd.61.maintenance.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Extended Deployment \ubc84\uc804 6.1\uc5d0 \uc801\uc6a9\ud558\ub294 \uc720\uc9c0\ubcf4\uc218 \ud328\ud0a4\uc9c0\ub85c, \uc0ac\uc6a9\uc790\uac00 \uc218\uc9d1\ud55c \uac83\uc785\ub2c8\ub2e4. \
\uc774 \ud328\ud0a4\uc9c0\ub294 IBM \uc9c0\uc6d0 \uc0ac\uc774\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\uc790\uac00 \uc120\ud0dd\ud558\uc5ec \ub2e4\uc6b4\ub85c\ub4dc\ud55c \ud2b9\uc815 \uc81c\ud488\uc758 \uc784\uc2dc \ud53d\uc2a4\ub97c \uc800\uc7a5\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ub610\ud55c \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere Update Installer\ub97c \uc0ac\uc6a9\ud558\uc5ec \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc120\ud0dd\ud55c \uc720\uc9c0\ubcf4\uc218\ub97c \uc124\uce58\ud558\uac70\ub098 \uc124\uce58 \uc81c\uac70\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Update Installer \uc124\uce58 \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \uc774 \ud328\ud0a4\uc9c0\uc5d0\uc11c \uc218\uc815\uc0ac\ud56d\uc744 \uc124\uce58\ud558\uae30 \uc804\uc5d0 Update Installer\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

ve.70.maintenance.description=\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Virtual Enterprise \ubc84\uc804 7.0\uc5d0 \uc801\uc6a9\ud558\ub294 \uc720\uc9c0\ubcf4\uc218 \ud328\ud0a4\uc9c0\ub85c, \uc0ac\uc6a9\uc790\uac00 \uc218\uc9d1\ud55c \uac83\uc785\ub2c8\ub2e4. \
\uc774 \ud328\ud0a4\uc9c0\ub294 IBM \uc9c0\uc6d0 \uc0ac\uc774\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\uc790\uac00 \uc120\ud0dd\ud558\uc5ec \ub2e4\uc6b4\ub85c\ub4dc\ud55c \ud2b9\uc815 \uc81c\ud488\uc758 \uc784\uc2dc \ud53d\uc2a4\ub97c \uc800\uc7a5\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \
\ub610\ud55c \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790 \ubc0f WebSphere Update Installer\ub97c \uc0ac\uc6a9\ud558\uc5ec \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc120\ud0dd\ud55c \uc720\uc9c0\ubcf4\uc218\ub97c \uc124\uce58\ud558\uac70\ub098 \uc124\uce58 \uc81c\uac70\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \
\uc774 \uc124\uce58 \ud328\ud0a4\uc9c0\ub294 WebSphere Update Installer \uc124\uce58 \ud328\ud0a4\uc9c0\uc5d0 \uc885\uc18d\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
\ub610\ud55c \uc774 \ud328\ud0a4\uc9c0\uc5d0\uc11c \uc218\uc815\uc0ac\ud56d\uc744 \uc124\uce58\ud558\uae30 \uc804\uc5d0 Update Installer\uc758 2\uc9c4\uc744 \ub2e4\uc6b4\ub85c\ub4dc\ud574\uc57c \ud569\ub2c8\ub2e4.

wasce.description=WebSphere Application Server Community Edition\uc740 \uac04\ub2e8\ud55c Java Platform, Enterprise Edition 5(Java EE 5) Application Server\ub85c\uc11c Apache Geronimo\ub85c \ube4c\ub4dc\ud588\uc2b5\ub2c8\ub2e4. \
\uc774\ub294 \uac1c\ubc29\ud615 \uc18c\uc2a4 \ucee4\ubba4\ub2c8\ud2f0\uc758 \ucd5c\uadfc \uc774\ub178\ubca0\uc774\uc158\uc744 \uc0ac\uc6a9\ud558\uc5ec Java EE \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uac1c\ubc1c\ud558\uace0 \uc804\uac1c\ud558\ub294 \ub370 \ud544\uc694\ud55c \uc989\uc2dc \uc561\uc138\uc2a4\ud560 \uc218 \uc788\ub294 \uc720\uc5f0\ud55c \ud1a0\ub300\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4.
wasce.feature.longname.ServerOnly=\uc11c\ubc84 \uc804\uc6a9
wasce.feature.description.ServerOnly=\uc774 \uae30\ub2a5\uc5d0\ub294 \uc11c\ubc84\ub9cc \ud3ec\ud568\ub429\ub2c8\ub2e4.
wasce.feature.longname.ServerAndSDK=Java 2, v5.0\uc6a9 \uc11c\ubc84 \ubc0f IBM SDK(Software Developer Kit)
wasce.feature.description.ServerAndSDK=\uc774 \uae30\ub2a5\uc5d0\ub294 \ub2e4\uc6b4\ub85c\ub4dc\ud55c \ud50c\ub7ab\ud3fc\uc5d0 \ud544\uc694\ud55c Java 2 \ubc84\uc804 5.0\uc6a9 \uc11c\ubc84 \ubc0f IBM SDK(Software Developer Kit)\uac00 \ud3ec\ud568\ub429\ub2c8\ub2e4.
wasce.feature.longname.ServerAndSDK6=Java v6\uc6a9 \uc11c\ubc84 \ubc0f IBM SDK(Software Developer Kit)
wasce.feature.description.ServerAndSDK6=\uc774 \uae30\ub2a5\uc5d0\ub294 \ub2e4\uc6b4\ub85c\ub4dc\ud55c \ud50c\ub7ab\ud3fc\uc5d0 \ud544\uc694\ud55c Java \ubc84\uc804 6\uc6a9 \uc11c\ubc84 \ubc0f IBM SDK(Software Developer Kit)\uac00 \ud3ec\ud568\ub429\ub2c8\ub2e4.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=\uc9c0\uc6d0\ub418\ub294 Java \ud658\uacbd\uc758 \uc124\uce58 \ub514\ub809\ud1a0\ub9ac\ub97c \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0 \uc9c0\uc815\ud569\ub2c8\ub2e4. \
\uc124\uce58 \ub514\ub809\ud1a0\ub9ac \uacbd\ub85c\ub97c \uc9c0\uc815\ud558\uc9c0 \uc54a\uc73c\uba74, WebSphere Application Server Community Edition \uc124\uce58 \ud504\ub85c\uadf8\ub7a8\uc774 \uc774 \uacbd\ub85c\ub97c \ucc3e\uc2b5\ub2c8\ub2e4. \
\uadf8\ub7ec\ub098 \uc124\uce58 \ud504\ub85c\uadf8\ub7a8\uc774 \uc9c0\uc6d0\ub418\ub294 Java \ud658\uacbd\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc73c\uba74 WebSphere Application Server Community Edition\uc744 \uc124\uce58\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=\ub2e4\uc74c\uc740 IBM SDK(Software Developer Kit), Java 2 Technology Edition\uc758 \uc124\uce58 \uc704\uce58\ub97c \ubcf4\uc5ec\uc8fc\ub294 \ud45c\uc785\ub2c8\ub2e4.   

wasce.sdk.default.install.loc.aix=\uae30\ubcf8 \uc124\uce58 \uc704\uce58\uc785\ub2c8\ub2e4. \uc774 \uc704\uce58\ub294 \uc218\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
wasce.sdk.default.install.loc.linux=\uc2e4\uc81c \uc704\uce58\ub294 \uc0ac\uc6a9\ub41c \ud2b9\uc815 SDK \ubc88\ub4e4\uc5d0 \ub530\ub77c \ub2e4\ub985\ub2c8\ub2e4. \uc704\uce58\ub294 \uc0ac\uc804 \uc815\uc758\ub418\uc5b4 \uc788\uc73c\uba70 \uc218\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
wasce.sdk.default.install.loc.solaris=\uc124\uce58 \uc704\uce58\ub294 WebSphere Application Server Community Edition\uc758 \uc124\uce58 \uc704\uce58\uc640 \uad00\ub828\ub429\ub2c8\ub2e4. \uc704\uce58\ub294 \uc0ac\uc804 \uc815\uc758\ub418\uc5b4 \uc788\uc73c\uba70 \uc218\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
wasce.sdk.default.install.loc.windows=\uae30\ubcf8 \uc124\uce58 \uc704\uce58\uc785\ub2c8\ub2e4. \uc774 \uc704\uce58\ub294 \uc218\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Windows\uc6a9 IBM SDK(Software Developer Kit)\ub294 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\ub97c \uc0ac\uc6a9\ud558\uc5ec \uc124\uce58 \uc81c\uac70\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \
\uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\ub97c \uc0ac\uc6a9\ud558\uc5ec WebSphere Application Server Community Edition \ubc0f Windows\uc6a9 IBM SDK\ub97c \ub098\uc911\uc5d0 \uc124\uce58 \uc81c\uac70\ud558\ub824\uba74, Windows \ud504\ub85c\uadf8\ub7a8 \ucd94\uac00/\uc81c\uac70 \uc81c\uc5b4\ud310 \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud558\uc5ec \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c SDK\ub97c \uc218\ub3d9\uc73c\ub85c \uc124\uce58 \uc81c\uac70\ud574\uc57c \ud569\ub2c8\ub2e4.

wasce.sdk.uninstall.summary.win=Windows\uc6a9 IBM SDK(Software Developer Kit)\ub294 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\ub97c \uc0ac\uc6a9\ud558\uc5ec \uc124\uce58 \uc81c\uac70\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \
Windows\uc6a9 IBM SDK\ub294 \uc774 \uc124\uce58 \uc81c\uac70 \ud504\ub85c\uc138\uc2a4\uac00 \uc644\ub8cc\ub41c \ud6c4\uc5d0\ub3c4 \uacc4\uc18d \uc124\uce58\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \
Windows \ud504\ub85c\uadf8\ub7a8 \ucd94\uac00/\uc81c\uac70 \uc81c\uc5b4\ud310 \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud558\uc5ec \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c SDK\ub97c \uc218\ub3d9\uc73c\ub85c \uc124\uce58 \uc81c\uac70\ud574\uc57c \ud569\ub2c8\ub2e4.

wasce.uninstall.summary.all=\uc11c\ubc84\ub97c \uc124\uce58 \uc81c\uac70\ud558\uae30 \uc804\uc5d0 \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \ubaa8\ub4e0 WebSphere Application Server Community Edition \uc11c\ubc84\ub97c \uc911\uc9c0\ud574\uc57c \ud569\ub2c8\ub2e4. \
\uc124\uce58 \uc81c\uac70 \uc694\uccad\uc744 \uc81c\ucd9c\ud558\uae30 \uc804\uc5d0 \uc11c\ubc84\uac00 \uacc4\uc18d \uc2e4\ud589 \uc911\uc774\uba74 \uc11c\ubc84\ub97c \uc911\uc9c0\ud558\uc2ed\uc2dc\uc624.


was.maintenance.update.warning.all=\uc120\ud0dd\ud55c \ub300\uc0c1\uc5d0\uc11c WebSphere Update Installer \ub3c4\uad6c\ub97c \uc2e4\ud589\ud558\uc5ec \uc720\uc9c0\ubcf4\uc218\ub97c \uc124\uce58\ud558\uac70\ub098 \uc81c\uac70\ud558\uae30 \uc804\uc5d0 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uac00 \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc758 Node Agent\ub97c \ud638\ucd9c\ud558\uc5ec \ub300\uc0c1\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \ubaa8\ub4e0 \uc11c\ubc84 \ud504\ub85c\uc138\uc2a4\ub97c \uc911\uc9c0\ud558\ub3c4\ub85d \ud569\ub2c8\ub2e4. \
Node Agent\uac00 \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c \uc2e4\ud589\ud558\uace0 \uc788\uc9c0 \uc54a\uc740 \uacbd\uc6b0 \uacc4\uc18d\ud558\uae30 \uc804\uc5d0 \uc120\ud0dd\ud55c \ub300\uc0c1\uc758 \ubaa8\ub4e0 \uc11c\ubc84 \ud504\ub85c\uc138\uc2a4\ub97c \uc911\uc9c0\ud574\uc57c \ud569\ub2c8\ub2e4. \
\uc120\ud0dd\ud55c \ub300\uc0c1\uc5d0\uc11c \uc720\uc9c0\ubcf4\uc218 \uc5c5\ub370\uc774\ud2b8\ub97c \uc644\ub8cc\ud558\uba74 \uc911\uc559 \uc9d1\uc911\uc2dd \uc124\uce58 \uad00\ub9ac\uc790\uac00 \ub300\uc0c1 \ud638\uc2a4\ud2b8\uc5d0\uc11c Node Agent\ub97c \uc790\ub3d9\uc73c\ub85c \ub2e4\uc2dc \uc2dc\uc791\ud569\ub2c8\ub2e4.
   
