# COPYRIGHT_START***********************************************************
#
# IBM Confidential OCO Source Material
# 5724-J34 (C) COPYRIGHT International Business Machines Corp.
#   2009,2010
#
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#   IBM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
#   ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
#   PURPOSE. IN NO EVENT SHALL IBM BE LIABLE FOR ANY SPECIAL, INDIRECT OR
#   CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
#   USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR
#   OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
#   OR PERFORMANCE OF THIS SOFTWARE.
#
#
# COPYRIGHT_END*************************************************************/
#
#CMVCPATHNAME ws/code/xd.admin.cimgr/properties/messages/InstallPackageMsgs.properties
#COMPONENTPREFIX XCIM
#COMPONENTNAMEFOR XCIM XD Centralized Installation Manager
#ISMESSAGEFILE TRUE
#NLS_MESSAGEFORMAT_NONE
#
xd.70.virtual.enterprise.description=WebSphere Virtual Enterprise extinde WebSphere Application Server Network Deployment Version 7.0 prin asigurarea \u00eembun\u0103t\u0103\u0163irilor \u00een opera\u0163iile dinamice \u015fi gestionarea extins\u0103. \
Include suport de func\u0163ionare pentru aplica\u0163iile PHP, Grila de calcul \u015fi performan\u0163a \u00eenalt\u0103.

xd.70.xdagent.description=Este o caracteristic\u0103 WebSphere Virtual Enterprise op\u0163ional\u0103 care este instalat\u0103 pe sta\u0163iile de lucru aflate la distan\u0163\u0103 pe care nu este instalat serverul de aplica\u0163ii WebSphere pentru a oferi suport pentru mediul de server mixt incluz\u00e2nd monitorizarea la distan\u0163\u0103.

ve.70.fixpack.description=Acest pachet de instalare poate fi utilizat pentru con\u0163inerea fi\u015fierelor necesare pentru actualizarea instal\u0103rilor de WebSphere Virtual Enterprise Version 7.0 la nivelul pachetului de corec\u0163ii specificat. \
Dup\u0103 ce sunt desc\u0103rcate fi\u015fierele pentru platformele necesare, un administrator poate utiliza pachetul pentru instalarea pe gazdele aplicabile prin utilizarea managerului de instalare centralizat \u015fi Programul de instalare al actualiz\u0103rilor pentru WebSphere.. \
Acest pachet de instalare este dependent de pachetul programului de instalare al actualiz\u0103rilor pentru WebSphere. \
Ca atare, binarele pentru programul de instalare al actualiz\u0103rilor trebuie s\u0103 fie desc\u0103rcat \u00eenainte utilizarea acestui pachet de instalare pentru actualizarea gazdelor \u0163int\u0103.

xd.611.virtual.enterprise.description=WebSphere Virtual Enterprise extinde WebSphere Application Server Network Deployment Versiunea  6.1 sau Versiunea 7.0 prin asigurarea \u00eembun\u0103t\u0103\u0163irilor \u00een opera\u0163iile dinamice \u015fi gestionarea extins\u0103. \
Include suport de func\u0163ionare pentru aplica\u0163iile PHP, Grila de calcul \u015fi performan\u0163a \u00eenalt\u0103.

xd.611.compute.grid.description=WebSphere Compute Grid extinde WebSphere Application Server Network Deployment Versiunea 6.1 sau Versiunea 7.0 prin asigurarea suportului pentru rularea joburilor Compute Grid (joburi batch tranzac\u0163ionale, joburi de calcul intensiv, \u015fi joburi native). \
De asemenea, include un planificator \u015fi func\u0163ii de gestionare a joburilor pentru a controla aceste joburi.

xd.61.operations.optimizer.description=WebSphere Virtual Enterprise extinde WebSphere Application Server Network Deployment Versiunea  6.1 sau Versiunea 7.0 prin asigurarea \u00eembun\u0103t\u0103\u0163irilor \u00een opera\u0163iile dinamice \u015fi gestionarea extins\u0103. \
Include suport de func\u0163ionare pentru aplica\u0163iile PHP, Grila de calcul \u015fi performan\u0163a \u00eenalt\u0103.

xd.61.xdagent.description=Este o caracteristic\u0103 WebSphere Extended Deployment op\u0163ional\u0103 care este instalat\u0103 pe sta\u0163iile de lucru aflate la distan\u0163\u0103 pe care nu este instalat serverul de aplica\u0163ii WebSphere pentru a oferi suport pentru mediul de server mixt incluz\u00e2nd monitorizarea la distan\u0163\u0103.

xd.61.compute.grid.description=WebSphere Extended Deployment Compute Grid extinde WebSphere Application Server Network Deployment Versiunea 6.1 prin asigurarea suportului pentru rularea joburilor Compute Grid (joburi batch tranzac\u0163ionale, joburi de calcul intensiv, \u015fi joburi native). \
De asemenea, include un planificator \u015fi func\u0163ii de gestionare a joburilor pentru a controla aceste joburi.

xd.61.data.grid.description=WebSphere Extended Deployment Data Grid extinde WebSphere Application Server Network Deployment Versiunea  6.1 prin asigurarea suportului pentru aplica\u0163iile de \u00eenalt\u0103 performan\u0163\u0103. \
Include ObjectGrid \u015fi facilitatea de parti\u0163ionare.

updi.61.description=Program de instalare actualiz\u0103ri instaleaz\u0103 actualiz\u0103ri, precum corec\u0163ii interimare, pachete de corec\u0163ii, pentru software-ul IBM WebSphere. \
Acest Program de instalare pentru actualiz\u0103ri este pentru edi\u0163iile WebSphere Application Server V6.1.

updi.70.description=Program de instalare actualiz\u0103ri instaleaz\u0103 actualiz\u0103ri, precum corec\u0163ii interimare, pachete de corec\u0163ii, pentru software-ul IBM WebSphere. \
Acest Program de instalare pentru actualiz\u0103ri este pentru edi\u0163iile WebSphere Application Server V6.1, V7.0 \u015fi mai recente.

nd.61.fixpack.description=Acest pachet de instalare poate fi utilizat pentru con\u0163inerea fi\u015fierelor necesare pentru actualizarea instal\u0103rilor WebSphere Application Server Network Deployment Version 6.1 la nivelul pachetului de corec\u0163ii specificat. \
Dup\u0103 ce sunt desc\u0103rcate fi\u015fierele pentru platformele necesare, un administrator poate utiliza pachetul pentru instalarea pe gazdele aplicabile prin utilizarea managerului de instalare centralizat \u015fi Programul de instalare al actualiz\u0103rilor pentru WebSphere.. \
Acest pachet de instalare este dependent de pachetul programului de instalare al actualiz\u0103rilor pentru WebSphere. \
Ca atare, binarele pentru programul de instalare al actualiz\u0103rilor trebuie s\u0103 fie desc\u0103rcat \u00eenainte utilizarea acestui pachet de instalare pentru actualizarea gazdelor \u0163int\u0103.

xd.61.fixpack.description=Acest pachet de instalare poate fi utilizat pentru con\u0163inerea fi\u015fierelor necesare pentru actualizarea instal\u0103rilor WebSphere Extended Deployment Versiunea 6.1 la nivelul pachetului de corec\u0163ii specificat. \
Dup\u0103 ce sunt desc\u0103rcate fi\u015fierele pentru platformele necesare, un administrator poate utiliza pachetul pentru instalarea pe gazdele aplicabile prin utilizarea managerului de instalare centralizat \u015fi Programul de instalare al actualiz\u0103rilor pentru WebSphere.. \
Acest pachet de instalare este dependent de pachetul programului de instalare al actualiz\u0103rilor pentru WebSphere. \
Ca atare, binarele pentru programul de instalare al actualiz\u0103rilor trebuie s\u0103 fie desc\u0103rcat \u00eenainte utilizarea acestui pachet de instalare pentru actualizarea gazdelor \u0163int\u0103.

nd.61.maintenance.description=Acest pachet de instalare este un pachet asamblat de utilizator pentru \u00eentre\u0163inerea WebSphere Application Server Network Deployment Versiunea 6.1. \
Acest pachet poate fi folosit pentru a re\u0163ine corec\u0163iile interimare selectate de utilizator pentru produsul men\u0163ionat desc\u0103rcat de pe site-ul de suport IBM. \
Acest pachet poate fi utilizat de asemenea pentru a instala sau a dezinstala \u00eentre\u0163inerea selectat\u0103 de pe target host-urile folosind managerul de instalare centralizat \u015fi programul de instalare al actualiz\u0103rilor WebSphere. \
Acest pachet de instalare este dependent de pachetul de instalare al programului de instalare al actualiz\u0103rilor pentru WebSphere. \
Ca atare, binarele pentru programul de instalare al actualiz\u0103rilor trebuie s\u0103 fie desc\u0103rcat \u00eenainte de instalarea oric\u0103rei dintre corec\u0163iile din acest pachet.

xd.61.maintenance.description=Acest pachet de instalare este un pachet asamblat de utilizator pentru \u00eentre\u0163inerea WebSphere Extended Deployment Versiunea 6.1. \
Acest pachet poate fi folosit pentru a re\u0163ine corec\u0163iile interimare selectate de utilizator pentru produsul men\u0163ionat desc\u0103rcat de pe site-ul de suport IBM. \
Acest pachet poate fi utilizat de asemenea pentru a instala sau a dezinstala \u00eentre\u0163inerea selectat\u0103 de pe target host-urile folosind managerul de instalare centralizat \u015fi programul de instalare al actualiz\u0103rilor WebSphere. \
Acest pachet de instalare este dependent de pachetul de instalare al programului de instalare al actualiz\u0103rilor pentru WebSphere. \
Ca atare, binarele pentru programul de instalare al actualiz\u0103rilor trebuie s\u0103 fie desc\u0103rcat \u00eenainte de instalarea oric\u0103rei dintre corec\u0163iile din acest pachet.

ve.70.maintenance.description=Acest pachet de instalare este un pachet asamblat de utilizator pentru \u00eentre\u0163inerea WebSphere Virtual Enterprise Versiunea 7.0. \
Acest pachet poate fi folosit pentru a re\u0163ine corec\u0163iile interimare selectate de utilizator pentru produsul men\u0163ionat desc\u0103rcat de pe site-ul de suport IBM. \
Acest pachet poate fi utilizat de asemenea pentru a instala sau a dezinstala \u00eentre\u0163inerea selectat\u0103 de pe target host-urile folosind managerul de instalare centralizat \u015fi programul de instalare al actualiz\u0103rilor WebSphere. \
Acest pachet de instalare este dependent de pachetul de instalare al programului de instalare al actualiz\u0103rilor pentru WebSphere. \
Ca atare, binarele pentru programul de instalare al actualiz\u0103rilor trebuie s\u0103 fie desc\u0103rcat \u00eenainte de instalarea oric\u0103rei dintre corec\u0163iile din acest pachet.

wasce.description=WebSphere Application Server Community Edition este o platform\u0103 Java de categorie u\u015foar\u0103, server de aplica\u0163iiEnterprise Edition 5 (Java EE 5) construit pe Apache Geronimo, proiectul serverului de aplica\u0163ii cu surs\u0103 deschis\u0103 a Apache Software Foundation. \
Acesta exploateaz\u0103 cele mai recente inova\u0163ii de la comunitatea cu surs\u0103 deschis\u0103 pentru a livra un fundament u\u015for accesibil, flexibil \u015fi pentru dezvoltarea \u015fi implementarea aplica\u0163iilor Java EE.
wasce.feature.longname.ServerOnly=Doar server
wasce.feature.description.ServerOnly=Aceast\u0103 caracteristic\u0103 include doar server-ul.
wasce.feature.longname.ServerAndSDK=Server \u015fi IBM SDK pentru Java 2, v5.0
wasce.feature.description.ServerAndSDK=Aceast\u0103 caracteristic\u0103 include serverul \u015fi IBM SDK pentru Java 2, versiunea  5.0, pentru platformele care le-a\u0163i desc\u0103rcat.
wasce.feature.longname.ServerAndSDK6=Server \u015fi IBM SDK pentru Java v6
wasce.feature.description.ServerAndSDK6=Aceast\u0103 caracteristic\u0103 include serverul \u015fi IBM SDK pentru Java, versiunea  6, pentru platformele care le-a\u0163i desc\u0103rcat.

#
# The following are messages used by OtherInstallLocation elements in the InstallPackageDescriptors for wasce.  
#
wasce.dependent.jdk.path=Specifica\u0163i directorul de instalare de pe target host pentru mediul Java suportat. \
Dac\u0103 nu specifica\u0163i calea directorului de instalare, programul de instalare WebSphere Application Server Community Edition va \u00eencerca s\u0103 localizeze una.\
Totu\u015fi, instalarea WebSphere Application Server Community Edition va e\u015fua dac\u0103 un mediu Java suportat nu poate fi localizat de un program de instalare.

# The following messages are purposely left empty. 
wasce.dependent.jdk.path.aix=
wasce.dependent.jdk.path.linux=
wasce.dependent.jdk.path.solaris=
wasce.dependent.jdk.path.windows=

wasce.sdk.default.install.loc=Tabelul de mai jos prezint\u0103 loca\u0163ia de instalare pentru IBM SDK, Java 2 Technology Edition.   

wasce.sdk.default.install.loc.aix=Aceasta este loca\u0163ia implicit\u0103 de instalare. Aceast\u0103 loca\u0163ie nu poate fi modificat\u0103.
wasce.sdk.default.install.loc.linux=Loca\u0163ia real\u0103 depinde de bundle-ul SDK specific utilizat. Aceast\u0103 loca\u0163ie este predefinit\u0103 \u015fi nu poate fi modificat\u0103.
wasce.sdk.default.install.loc.solaris=Loca\u0163ia de instalare este relativ\u0103 la loca\u0163ia de instalare pentru WebSphere Application Server Community Edition. Aceast\u0103 loca\u0163ie este predefinit\u0103 \u015fi nu poate fi modificat\u0103.
wasce.sdk.default.install.loc.windows=Aceasta este loca\u0163ia implicit\u0103 de instalare. Aceast\u0103 loca\u0163ie nu poate fi modificat\u0103.
#wasce.sdk.default.install.loc.windows=This is the default install location. User may specify a different directory for install location. 

#
# The following are messages used by SummaryMessage elements in the InstallPackageDescriptors for wasce.  
#
wasce.sdk.install.summary.win=Re\u0163ine-\u0163i c\u0103 IBM SDK pentru Windows nu poate fi dezinstalat folosind managerul de instalare centralizat. \
Pentru a dezinstala mai t\u00e2rziu WebSphere Application Server Community Edition \u015fi IBM SDK pentru Windows folosind managerul de instalare centralizat, trebuie s\u0103 dezinstala\u0163i manual SDK de pe target host folosind func\u0163ia Windows din Control Panel Ad\u0103ugare/\u00cenl\u0103turare progame.

wasce.sdk.uninstall.summary.win=Re\u0163ine-\u0163i c\u0103 IBM SDK pentru Windows nu poate fi dezinstalat folosind managerul de instalare centralizat. \
IBM SDK pentru Windows va r\u0103m\u00e2ne instalat dup\u0103 ce acest process de dezinstalare este finalizat. \
Trebuie s\u0103 dezinstala\u0163i manual SDK de pe target host folosind func\u0163ia Windows din Control Panel Ad\u0103ugare/\u00cenl\u0103turare progame.

wasce.uninstall.summary.all=Trebuie s\u0103 opri\u0163i toate serverele WebSphere Application Server Community Edition care ruleaz\u0103 pe target host-urile \u00eenainte de a dezinstala serverele. \
Opri\u0163i serverele dac\u0103 acestea ruleaz\u0103 \u00een continuare \u00eenainte de lansarea cererii de dezinstalare.


was.maintenance.update.warning.all=\u00cenainte de a rula unealta WebSphere Update Installer pentru a instala sau a dezinstala \u00eentre\u0163ineri pe \u0163intele selectate, managerul de instalare centralizat\u0103 apeleaz\u0103 agen\u0163ii nodurilor de pe target host-uri pentru a opri toate procesele serverelor \u00een func\u0163iune la \u0163inte. \
Dac\u0103 agen\u0163ii nodurilor nu ruleaz\u0103 pe un target host, trebuie sa v\u0103 asigura\u0163i c\u0103 toate procesele serverului de pe \u0163intele selectate sunt oprite \u00eenainte de a continua.  \
La finalizarea cu succes a actualiz\u0103rii de \u00eentre\u0163inere pe \u0163inta seletat\u0103 managerul de instalare centralizat va reporni automat agentul nodului pe target host.
   
