<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny.  Manifest pakunku z&#322;o&#380;onego musi zawiera&#263; dok&#322;adnie jeden wpis Bundle-SymbolicName. Znaleziono nast&#281;puj&#261;cy wpis: {0}.
  </MsgText>
  <Explanation>
    &#346;rodowisko wykonawcze pr&#243;bowa&#322;o przetworzy&#263; metadane dla pakunku z&#322;o&#380;onego, ale nie mo&#380;na by&#322;o okre&#347;li&#263; nazwy symbolicznej pakunku.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: Wyst&#261;pi&#322; b&#322;&#261;d sk&#322;adniowy podczas pr&#243;by przeanalizowania &#322;a&#324;cucha filtru obiektu Blueprint {0} dla elementu o identyfikatorze {1}: {2}
  </MsgText>
  <Explanation>
    Podczas pr&#243;by przeanalizowania &#322;a&#324;cucha filtru dla elementu o podanym identyfikatorze zg&#322;oszony zosta&#322; wyj&#261;tek InvalidSyntaxException.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy &#322;a&#324;cuch filtru dla podanego identyfikatora jest poprawny pod wzgl&#281;dem sk&#322;adniowym.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny.  Manifest pakunku musi zawiera&#263; dok&#322;adnie jeden wpis Bundle-SymbolicName. Znaleziono nast&#281;puj&#261;cy wpis: {0}.
  </MsgText>
  <Explanation>
    &#346;rodowisko wykonawcze pr&#243;bowa&#322;o przetworzy&#263; metadane pakunku, ale nie mo&#380;na by&#322;o okre&#347;li&#263; jego nazwy symbolicznej.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny.  Manifest fragmentu pakunku musi zawiera&#263; dok&#322;adnie jeden wpis Fragment-Host. Znaleziono nast&#281;puj&#261;cy wpis: {0}.
  </MsgText>
  <Explanation>
    &#346;rodowisko wykonawcze pr&#243;bowa&#322;o przetworzy&#263; metadane dla fragmentu pakunku, ale nie mo&#380;na by&#322;o okre&#347;li&#263; pakunku hosta fragmentu.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny.  Nie mo&#380;na przetworzy&#263; pakunku z&#322;o&#380;onego o nazwie symbolicznej {0} i wersji manifestu {1}.
  </MsgText>
  <Explanation>
    Manifest pakunku z&#322;o&#380;onego musi zawiera&#263; wpisy Bundle-SymbolicName i CompositeBundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    Upewnij si&#281;, &#380;e w plikach manifestu wszystkich pakunk&#243;w z&#322;o&#380;onych znajduj&#261; si&#281; poprawne wpisy Bundle-SymbolicName i CompositeBundle-ManifestVersion.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny.  Nie mo&#380;na przetworzy&#263; pakunku o nazwie symbolicznej {0} i wersji manifestu {1}.
  </MsgText>
  <Explanation>
    Manifest pakunku musi zawiera&#263; wpisy Bundle-SymbolicName i Bundle-ManifestVersion.
  </Explanation>
  <UserResponse>
    Upewnij si&#281;, &#380;e w plikach manifestu wszystkich pakunk&#243;w znajduj&#261; si&#281; poprawne wpisy Bundle-SymbolicName i Bundle-ManifestVersion.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
