<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: Rozstrzyganie zasobu aplikacyjnego {0} wskazuje niepoprawne zale&#380;no&#347;ci tre&#347;ci wsp&#243;&#322;u&#380;ytkowanej od tre&#347;ci aplikacji: {1}
  </MsgText>
  <Explanation>
    Pakunki aplikacji nie mog&#261; udost&#281;pnia&#263; pakiet&#243;w ani us&#322;ug pakunkom wsp&#243;&#322;u&#380;ytkowanym. Ponadto nie mo&#380;na wdra&#380;a&#263; pakunk&#243;w jednocze&#347;nie jako pakunk&#243;w wsp&#243;&#322;u&#380;ytkowanych i pakunk&#243;w aplikacji. Ka&#380;de wdro&#380;enie, w kt&#243;rym wymagane s&#261; pakunki wsp&#243;&#322;u&#380;ytkowane zale&#380;ne od pakunk&#243;w aplikacji, jest niepoprawne.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy wszystkie niepoprawne pakunki wsp&#243;&#322;u&#380;ytkowane s&#261; wymagane przez aplikacj&#281;. Je&#347;li tak, zmodyfikuj je, aby nie zale&#380;a&#322;y od zawarto&#347;ci aplikacji.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: Nie mo&#380;na odczyta&#263; manifestu pakunku pliku JAR {0} w pliku EBA {1}.
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; wyj&#261;tek IOException podczas poszukiwania manifestu pliku JAR w pliku archiwum pakunku korporacyjnego (EBA). Plik m&#243;g&#322; by&#263; uszkodzony lub nie mo&#380;na by&#322;o go odczyta&#263;.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy plik ma odpowiednie uprawnienia i czy ma poprawny format.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Us&#322;uga udost&#281;pniania {0} jest niedost&#281;pna.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: Aplikacja OSGi wdro&#380;ona w jednostce kompozycji {0} aplikacji na poziomie biznesowym {1} nie zosta&#322;a uruchomiona.
  </MsgText>
  <Explanation>
    Podczas operacji uruchamiania wyst&#261;pi&#322; wyj&#261;tek.
  </Explanation>
  <UserResponse>
    Sprawd&#378; wpisy w dziennikach serwera poprzedzaj&#261;ce ten wyj&#261;tek, aby przeprowadzi&#263; bardziej szczeg&#243;&#322;ow&#261; diagnostyk&#281; problemu.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: Plik archiwum pakunku korporacyjnego {1} zawiera katalog {0}, kt&#243;ry nie jest obs&#322;ugiwany.
  </MsgText>
  <Explanation>
    Okre&#347;lony plik EBA zawiera katalog o nazwie byValue lub byReference. Katalogi o takich nazwach nie s&#261; obs&#322;ugiwane w katalogu g&#322;&#243;wnym pliku EBA.
  </Explanation>
  <UserResponse>
    Usu&#324; nieobs&#322;ugiwany katalog lub zmie&#324; jego nazw&#281;.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: Okre&#347;lona rola {0} nie istnieje.
  </MsgText>
  <Explanation>
    Podj&#281;to pr&#243;b&#281; odwzorowania u&#380;ytkownik&#243;w lub grup na rol&#281; zabezpiecze&#324;, kt&#243;ra nie istnieje.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy okre&#347;lona rola zabezpiecze&#324; istnieje lub utw&#243;rz rol&#281; w aplikacji.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: Manifest wdra&#380;ania, kt&#243;ry ma zosta&#263; zaimportowany, nie jest poprawny w przypadku zasobu aplikacyjnego {0}, poniewa&#380; nie spe&#322;nia wymaga&#324; okre&#347;lonych w manife&#347;cie aplikacji.
  </MsgText>
  <Explanation>
    Manifest wdra&#380;ania DEPLOYMENT.MF nie jest zgodny z manifestem aplikacji APPLICATION.MF zasobu aplikacyjnego.
  </Explanation>
  <UserResponse>
    Sprawd&#378; nowy manifest wdra&#380;ania i upewnij si&#281;, &#380;e spe&#322;nione s&#261; nast&#281;puj&#261;ce warunki. 
   1. Wpisy Application-SymbolicName oraz Application-Version w pliku DEPLOYMENT.MF musz&#261; by&#263; zgodne z odpowiadaj&#261;cymi im wpisami w pliku APPLICATION.MF.
   2. Pakunki wymienione w nag&#322;&#243;wku Deployed-Content pliku DEPLOYMENT.MF musz&#261; by&#263; zgodne z pakunkami wymienionymi w nag&#322;&#243;wku Application-Content pliku APPLICATION.MF.
 3. Wersja pakunku w nag&#322;&#243;wku Deployed-Content pliku DEPLOYMENT.MF musi znajdowa&#263; si&#281; w zakresie wersji dla odpowiedniego pakunku w pliku APPLICATION.MF.
 4. Pakunki wymienione w nag&#322;&#243;wku Deployed-Use-Bundle pliku DEPLOYMENT.MF musz&#261; by&#263; tak&#380;e wymienione w nag&#322;&#243;wku Use-Bundle pliku APPLICATION.MF.
   5. Wersja pakunku w nag&#322;&#243;wku Deployed-Use-Bundle pliku DEPLOYMENT.MF musi znajdowa&#263; si&#281; w zakresie wersji odpowiedniego pakunku w nag&#322;&#243;wku Use-Bundle pliku APPLICATION.MF.
 Nie modyfikuj manifestu wdra&#380;ania r&#281;cznie. W razie potrzeby usu&#324; manifest wdro&#380;enia z pliku EBA. Spowoduje to wygenerowanie nowego pliku manifestu wdro&#380;enia podczas importowania pliku EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: Nie mo&#380;na rozstrzygn&#261;&#263; wersji wybranych pakunk&#243;w lub s&#261; one niekompatybilne.
  </MsgText>
  <Explanation>
    System nie mo&#380;e rozstrzygn&#261;&#263; wersji wybranych pakunk&#243;w. W pakunkach mo&#380;e brakowa&#263; zale&#380;no&#347;ci, pakunki mog&#261; by&#263; niekompatybilne lub nie istniej&#261;.
  </Explanation>
  <UserResponse>
    Zmodyfikuj wybrany zbi&#243;r pakunk&#243;w wej&#347;ciowych i spr&#243;buj ponownie. Status zasobu aplikacyjnego mo&#380;na wy&#347;wietli&#263; lub przejrze&#263; za pomoc&#261; Konsoli administracyjnej.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: U&#380;ytkownik {0} nie jest u&#380;ytkownikiem odwzorowanym ani cz&#322;onkiem grupy odwzorowanej dla roli {1}.
  </MsgText>
  <Explanation>
    Ka&#380;dy okre&#347;lony u&#380;ytkownik musi by&#263; u&#380;ytkownikiem odwzorowanym w roli zabezpiecze&#324; lub musi by&#263; cz&#322;onkiem grupy odwzorowanej w roli zabezpiecze&#324;. Okre&#347;lony u&#380;ytkownik nie spe&#322;nia &#380;adnego z tych tych wymaga&#324;.
  </Explanation>
  <UserResponse>
    Skonfiguruj odwzorowania u&#380;ytkownik&#243;w/grup na rol&#281; zabezpiecze&#324;, aby zezwoli&#263; okre&#347;lonemu u&#380;ytkownikowi dzia&#322;a&#263; w ramach okre&#347;lonej roli, lub okre&#347;l innego u&#380;ytkownika, kt&#243;ry ju&#380; ma wymagane uprawnienia.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: Aplikacja {0} zawiera co najmniej jedno archiwum pakunku z&#322;o&#380;onego (CBA) {1} w nag&#322;&#243;wku Application-Content. Taka sytuacja nie jest obs&#322;ugiwana na serwerze WebSphere Application Server 7 z pakietem OSGi Applications Feature Pack.
  </MsgText>
  <Explanation>
    Archiwa CBA s&#261; obs&#322;ugiwane w nag&#322;&#243;wku Application-Content dla serwera WebSphere Application Server w wersji 8 i nowszych.
  </Explanation>
  <UserResponse>
    Nie jest wymagana &#380;adna czynno&#347;&#263;. Je&#347;li aplikacja musi by&#263; uruchamiania na serwerze WebSphere Application Server 7 z pakietem OSGi Applications Feature Pack, zmodyfikuj j&#261;, aby nie zawiera&#322;a archiw&#243;w CBA w nag&#322;&#243;wku Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: Wyst&#261;pi&#322; wyj&#261;tek IOException podczas odczytywania pliku manifestu aplikacji archiwum pakunku korporacyjnego (EBA) {0}. Plik mo&#380;e by&#263; niepoprawny, uszkodzony lub niemo&#380;liwy do odczytania.
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; wyj&#261;tek IOException podczas odczytywania pliku manifestu aplikacji archiwum pakunku korporacyjnego (EBA). Plik mo&#380;e by&#263; niepoprawny, uszkodzony lub niemo&#380;liwy do odczytania.
  </Explanation>
  <UserResponse>
    Upewnij si&#281;, &#380;e plik manifestu aplikacji APPLICATION.MF jest zgodny ze specyfikacj&#261; plik&#243;w manifestu.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Identyfikator URI pliku konfiguracyjnego wtyczki ma nieoczekiwany format {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Podczas udost&#281;pniania pliku archiwum pakunku korporacyjnego (EBA) {0} zwr&#243;cony zosta&#322; niepoprawny wynik. Oczekiwano, &#380;e wersja maksymalna {1} b&#281;dzie taka sama, jak wersja minimalna {2}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: Nie mo&#380;na udost&#281;pni&#263; aplikacji {0} dla wszystkich w&#281;z&#322;&#243;w w kom&#243;rce. Aplikacj&#281; mo&#380;na wdro&#380;y&#263; tylko w w&#281;z&#322;ach w wersji 7, na kt&#243;rych dzia&#322;a pakiet OSGi Applications Feature Pack. B&#322;&#261;d rozstrzygni&#281;cia to {1}.
  </MsgText>
  <Explanation>
    Importowana aplikacja zosta&#322;a pomy&#347;lnie udost&#281;pniona na serwerze WebSphere Application Server w wersji 7 z pakietem OSGi Applications Feature Pack, ale nie mo&#380;na jej by&#322;o udost&#281;pni&#263; na serwerze WebSphere Application Server w wersji 8.
  </Explanation>
  <UserResponse>
    Nie jest wymagana &#380;adna czynno&#347;&#263;. Jednak to ostrze&#380;enie wskazuje, &#380;e aplikacja mo&#380;e zawiera&#263; bardzo &#347;cis&#322;e wymaganie dotycz&#261;ce wersji. Mo&#380;na u&#380;y&#263; informacji z komunikatu o b&#322;&#281;dzie rozstrzygni&#281;cia w celu zmodyfikowania aplikacji, aby mo&#380;na j&#261; by&#322;o wdro&#380;y&#263; w w&#281;z&#322;ach wersji 8.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: Nie mo&#380;na utworzy&#263; elementu klastra w w&#281;&#378;le {0}, poniewa&#380; aplikacje OSGi {1} definiuj&#261; role dla polecenia Uruchom jako.
  </MsgText>
  <Explanation>
    Wszystkie elementy klastra musz&#261; obs&#322;ugiwa&#263; uruchamianie tych samych aplikacji, ale nowy element klastra nie obs&#322;uguje aplikacji OSGi ze zdefiniowanymi rolami dla polecenia Uruchom jako.
  </Explanation>
  <UserResponse>
    Wybierz w&#281;ze&#322; w wersji 8 jako hosta elementu klastra lub zmodyfikuj aplikacje, aby nie definiowa&#322;y r&#243;l dla polecenia Uruchom jako.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: Manifest wdra&#380;ania aplikacji {0} w wersji {1} obejmuje tre&#347;&#263; o takiej samej nazwie symbolicznej i wersji jak aplikacja.
  </MsgText>
  <Explanation>
    Aplikacje, pakunki i pakunki z&#322;o&#380;one wsp&#243;&#322;u&#380;ytkuj&#261; t&#281; sam&#261; przestrze&#324; nazw, dlatego musz&#261; mie&#263; unikalne identyfikatory w przestrzeni nazw. Podczas sprawdzania poprawno&#347;ci wdro&#380;enia aplikacji &#347;rodowisko wykonawcze wykry&#322;o odwo&#322;anie do pakunku o takiej samej nazwie symbolicznej i wersji jak aplikacja.
  </Explanation>
  <UserResponse>
    Popraw nazw&#281; symboliczn&#261; pakunku, pakunku z&#322;o&#380;onego lub aplikacji, tak aby nie powodowa&#322;a konfliktu w przestrzeni nazw.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: Nie mo&#380;na rozstrzygn&#261;&#263; zasobu aplikacyjnego {0}. Atrybut {1} w imporcie dla pakietu {2} nie mo&#380;e zosta&#263; spe&#322;niony podczas wdra&#380;ania.
  </MsgText>
  <Explanation>
    W przypadku pakunk&#243;w wymienionych w nag&#322;&#243;wku Application-Content pliku APPLICATION.MF wszystkie importy pakietu musz&#261; mie&#263; atrybuty, kt&#243;re mog&#261; zosta&#263; spe&#322;nione podczas wdra&#380;ania.
  </Explanation>
  <UserResponse>
    Zmie&#324; spos&#243;b pakowania lub konfiguracj&#281; aplikacji tak, aby wszystkie pakunki wymienione w nag&#322;&#243;wku Application-Content mia&#322;y importy pakietu, kt&#243;re mog&#261; zosta&#263; spe&#322;nione podczas wdra&#380;ania.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na znale&#378;&#263; danych konfiguracyjnych potrzebnych do rozszerzenia {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Podczas modelowania pakunku {0} wyst&#261;pi&#322; wyj&#261;tek: {1}
  </MsgText>
  <Explanation>
    Podany wyj&#261;tek wyst&#261;pi&#322; podczas modelowania okre&#347;lonego pakunku.
  </Explanation>
  <UserResponse>
    Zbadaj podany wyj&#261;tek w celu uzyskania szczeg&#243;&#322;owych informacji o problemie i rozwi&#261;&#380; go.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na pobra&#263; strumienia wej&#347;ciowego dla pozycji zip pliku web.xml w pliku WAR {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: W elemencie docelowym {1} dla zasobu u&#380;ywanego przez komponent bean {2} w pakunku {3} o wersji {4} nie mo&#380;na znale&#378;&#263; aliasu uwierzytelniania programu nas&#322;uchuj&#261;cego komponentu MDB zgodnego z nazw&#261; {0}.
  </MsgText>
  <Explanation>
    Okre&#347;lony alias uwierzytelniania nie istnieje lub nie jest widoczny dla aplikacji.
  </Explanation>
  <UserResponse>
    Skonfiguruj wymagany alias uwierzytelniania lub sprawd&#378;, czy jest on skonfigurowany w poprawnym zasi&#281;gu dla aplikacji.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: Nie mo&#380;na rozstrzygn&#261;&#263; zasobu aplikacyjnego {0}. Wymaga on pakunku {1}, kt&#243;ry nie jest wymieniony w nag&#322;&#243;wku Application-Content manifestu aplikacji APPLICATION.MF. Ten pakunek korzysta z us&#322;ugi {2} z pakunku {3}, kt&#243;ry jest wymieniony w nag&#322;&#243;wku Application-Content.
  </MsgText>
  <Explanation>
    Aplikacja nie zosta&#322;a poprawnie skonfigurowana. Pakunek wsp&#243;&#322;u&#380;ytkowany nie mo&#380;e korzysta&#263; z us&#322;ugi z pakunku izolowanego. Pakunki wymienione w nag&#322;&#243;wku Application-Content s&#261; izolowane i mog&#261; eksportowa&#263; us&#322;ugi tylko do innych aplikacji przy u&#380;yciu mechanizmu Application-ExportService.
  </Explanation>
  <UserResponse>
    Zmie&#324; spos&#243;b pakowania lub konfiguracj&#281; aplikacji tak, aby pakunki wymienione w nag&#322;&#243;wku Use-Bundle lub dodane przez element rozstrzygaj&#261;cy nie wymaga&#322;y us&#322;ug udost&#281;pnianych przez pakunki wymienione w nag&#322;&#243;wku Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: Zas&#243;b aplikacyjny {0} wymaga pobrania element&#243;w zewn&#281;trznych, aby mo&#380;liwe by&#322;o jego wdro&#380;enie w jednostce kompozycji.
  </MsgText>
  <Explanation>
    Nowy lub zaktualizowany zas&#243;b wymaga pobrania co najmniej jednego pakunku z repozytorium przed dodaniem go do jednostki kompozycji lub zaktualizowaniem w jednostce kompozycji.
  </Explanation>
  <UserResponse>
    Aby rozpocz&#261;&#263; proces pobierania pakunku, zapisz zmiany w konfiguracji g&#322;&#243;wnej. Status pobierania pakunku mo&#380;na wy&#347;wietli&#263; na panelu szczeg&#243;&#322;&#243;w zasobu aplikacyjnego Konsoli administracyjnej. Po zako&#324;czeniu pobierania pakunku spr&#243;buj ponownie doda&#263; lub zaktualizowa&#263; zas&#243;b aplikacyjny w jednostce kompozycji.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: Konwersja pliku WAR {0} znajduj&#261;cego si&#281; w pliku EBA {1} na plik WAB zako&#324;czy&#322;a si&#281; niepowodzeniem.
  </MsgText>
  <Explanation>
    Pliki archiwum aplikacji WWW (WAR) w archiwum pakunku korporacyjnego (EBA) nale&#380;y przekszta&#322;ci&#263; w pakunki aplikacji WWW (WAB), aby mo&#380;na by&#322;o je wdro&#380;y&#263;. Proces konwersji nie zosta&#322; pomy&#347;lnie zako&#324;czony.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy plik WAR jest poprawny.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Us&#322;uga RepositoryAdminSupport jest niedost&#281;pna z poziomu rejestru us&#322;ug OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: Alias uwierzytelniania {0} nie istnieje w domenie zabezpiecze&#324; {2} w elemencie docelowym {1}.
  </MsgText>
  <Explanation>
    Alias uwierzytelniania musi istnie&#263; w globalnej lub docelowej domenie zabezpiecze&#324;, kiedy odwo&#322;ania do zasobu obiektu Blueprint s&#261; powi&#261;zane.
  </Explanation>
  <UserResponse>
    Wybierz alias uwierzytelniania, kt&#243;ry istnieje w globalnej lub docelowej domenie zabezpiecze&#324;, lub utw&#243;rz odpowiedni alias uwierzytelniania.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: Nie mo&#380;na utworzy&#263; elementu klastra w w&#281;&#378;le {0}, poniewa&#380; aplikacje OSGi {1} zawieraj&#261; archiwa pakunk&#243;w z&#322;o&#380;onych (CBA) w nag&#322;&#243;wku Application-Content.
  </MsgText>
  <Explanation>
    Wszystkie elementy klastra musz&#261; obs&#322;ugiwa&#263; uruchamianie tych samych aplikacji, ale nowy element klastra nie obs&#322;uguje aplikacji OSGi z archiwami CBA w nag&#322;&#243;wku Application-Content.
  </Explanation>
  <UserResponse>
    Wybierz w&#281;ze&#322; w wersji 8 jako hosta elementu klastra lub zmodyfikuj aplikacje, aby nie zawiera&#322;y archiw&#243;w CBA w nag&#322;&#243;wku Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: Jednostka kompozycji {0} nie odpowiada aplikacji OSGi.
  </MsgText>
  <Explanation>
    Wywo&#322;ana operacja dzia&#322;a na jednostce kompozycji dla aplikacji OSGi. Wybrana jednostka kompozycji nie zawiera aplikacji OSGi.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy wybrana jednostka kompozycji ma zas&#243;b z aspektem typu &quot;EBA,version=1.0&quot;.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na wyodr&#281;bni&#263; manifestu wdra&#380;ania z pliku binarnego zasobu aplikacyjnego {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Us&#322;uga ModelledResourceManager jest niedost&#281;pna z poziomu rejestru us&#322;ug OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na modelowa&#263; pakunku CBA {0} w wersji {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: W pliku EBA {0} nie znaleziono pliku deskryptora aplikacji Java EE. W przypadku braku tego deskryptora kontekstowe katalogi g&#322;&#243;wne plik&#243;w WAR przyjmuj&#261; warto&#347;ci domy&#347;lne.
  </MsgText>
  <Explanation>
    System przetworzy&#322; archiwum aplikacji WWW (WAR) bez powi&#261;zanego z nim pliku deskryptora aplikacji (application.xml), w kt&#243;rym s&#261; definiowane kontekstowe katalogi g&#322;&#243;wne. Kontekstowe katalogi g&#322;&#243;wne poddanego migracji pliku WAR przyjm&#261; warto&#347;ci domy&#347;lne.
  </Explanation>
  <UserResponse>
    Je&#347;li plik deskryptora aplikacji jest wymagany, sprawd&#378;, czy zosta&#322; udost&#281;pniony i poprawnie spakowany w pliku archiwum pakunku korporacyjnego (EBA).
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Nie mo&#380;na przetworzy&#263; pliku manifestu wdro&#380;enia udost&#281;pnionego przez aplikacj&#281; z tego po&#322;o&#380;enia {0}.
  </MsgText>
  <Explanation>
    Pr&#243;bowano zaimportowa&#263; plik EBA, kt&#243;ry zawiera plik manifestu wdra&#380;ania. Przetworzenie tego pliku nie powiod&#322;o si&#281;.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy serwer aplikacji ma uprawnienia dost&#281;pu do tego pliku i czy plik nie jest uszkodzony. Nie modyfikuj manifestu wdra&#380;ania r&#281;cznie. W razie potrzeby usu&#324; manifest wdro&#380;enia z pliku EBA. Spowoduje to wygenerowanie nowego pliku manifestu wdra&#380;ania podczas importowania pliku EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Us&#322;uga {0} jest niedost&#281;pna z poziomu rejestru us&#322;ug OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: Nie mo&#380;na utworzy&#263; katalogu {0}.
  </MsgText>
  <Explanation>
    Nie mo&#380;na utworzy&#263; podanego katalogu.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy jest miejsce w pami&#281;ci masowej i czy produkt dysponuje uprawnieniami umo&#380;liwiaj&#261;cymi utworzenie tego katalogu.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Modu&#322; {0} by&#322; nieoczekiwanego typu.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: Plik EBA {0} zosta&#322; zainstalowany z b&#322;&#281;dami.
  </MsgText>
  <Explanation>
    Operacje sprawdzania poprawno&#347;ci i instalacji pliku archiwum pakunku korporacyjnego (EBA) zosta&#322;y zako&#324;czone z b&#322;&#281;dami.
  </Explanation>
  <UserResponse>
    Wi&#281;cej informacji zawieraj&#261; do&#322;&#261;czone komunikaty o b&#322;&#281;dach znajduj&#261;ce si&#281; w pliku SystemOut.log.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Nie mo&#380;na utworzy&#263; domy&#347;lnego powi&#261;zania dla odwo&#322;ania do komponentu EJB {0} w pakunku {1} w wersji {2} z interfejsem {3}, poniewa&#380; w aplikacji nie istniej&#261; zgodne komponenty EJB.
  </MsgText>
  <Explanation>
    Dla niepowi&#261;zanych odwo&#322;a&#324; do komponent&#243;w EJB nale&#380;y utworzy&#263; powi&#261;zania domy&#347;lne. Nie znaleziono &#380;adnego komponentu EJB, z kt&#243;rym mo&#380;na powi&#261;za&#263; dane odwo&#322;anie.
  </Explanation>
  <UserResponse>
    Powi&#261;&#380; odwo&#322;anie ze znanym po&#322;o&#380;eniem JNDI lub popraw aplikacj&#281;.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na znale&#378;&#263; obiektu zasobu aplikacyjnego konfiguracji {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: Nie mo&#380;na znale&#378;&#263; odwo&#322;ania do zasobu o nazwie JNDI {0} oraz typie {1} w elemencie docelowym {2} dla odwo&#322;ania do zasobu EJB {3} zdefiniowanego w pakunku {4} o wersji {5}.
  </MsgText>
  <Explanation>
    Archiwum pakunku korporacyjnego (Enterprise Bundle Archive - EBA) zawieraj&#261;ce odwo&#322;ania do zasob&#243;w w module EJB okre&#347;la nazw&#281; JNDI odwo&#322;ania do zasobu, kt&#243;re nie istnieje w przestrzeni nazw JNDI.
  </Explanation>
  <UserResponse>
    Je&#347;li odwo&#322;anie do zasobu powinno si&#281; znajdowa&#263; w przestrzeni nazw JNDI, powi&#261;&#380; obiekt z nazw&#261; lub popraw odwo&#322;anie do zasobu i zaktualizuj archiwum pakunku korporacyjnego.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: Aplikacja OSGi wdro&#380;ona w jednostce kompozycji {0} aplikacji na poziomie biznesowym {1} nie zosta&#322;a zatrzymana.
  </MsgText>
  <Explanation>
    Podczas operacji zatrzymywania wyst&#261;pi&#322; wyj&#261;tek.
  </Explanation>
  <UserResponse>
    Sprawd&#378; wpisy w dziennikach serwera poprzedzaj&#261;ce ten wyj&#261;tek, aby przeprowadzi&#263; bardziej szczeg&#243;&#322;ow&#261; diagnostyk&#281; problemu.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: Rola {0} jest niepoprawna.
  </MsgText>
  <Explanation>
    Okre&#347;lona rola nie zosta&#322;a skonfigurowana.
  </Explanation>
  <UserResponse>
    Skonfiguruj okre&#347;lon&#261; rol&#281;.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: Element klastra {0} nie zosta&#322; rozszerzony o sk&#322;adniki {2} wymagane przez aplikacj&#281; OSGi {1}.
  </MsgText>
  <Explanation>
    Aby mo&#380;na by&#322;o zainstalowa&#263; aplikacj&#281; OSGi w klastrze, ka&#380;dy element klastra musi mie&#263; wszystkie wymagane sk&#322;adniki aplikacji. Podczas dodawania nowego elementu klastra ten element r&#243;wnie&#380; musi mie&#263; wszystkie sk&#322;adniki wymagane przez aplikacje OSGi zainstalowane w klastrze.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy proponowany element klastra ma wszystkie wymagane sk&#322;adniki aplikacji OSGi wymienione w komunikacie o b&#322;&#281;dzie.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: Nie mo&#380;na utworzy&#263; katalogu {0}.
  </MsgText>
  <Explanation>
    Nie mo&#380;na utworzy&#263; podanego katalogu.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy jest miejsce w pami&#281;ci masowej i czy produkt dysponuje uprawnieniami umo&#380;liwiaj&#261;cymi utworzenie tego katalogu.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: Tre&#347;&#263; manifestu wdra&#380;ania jest niepoprawna. Nast&#281;puj&#261;ce pakunki s&#261; nadmiarowe: {0}.
  </MsgText>
  <Explanation>
    Manifest wdra&#380;ania, kt&#243;ry ma zosta&#263; zaimportowany, obejmuje pakunki, kt&#243;re nie s&#261; wymagane do rozstrzygni&#281;cia zasobu aplikacyjnego archiwum pakunku korporacyjnego (EBA).
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy w nowym manife&#347;cie wdra&#380;ania DEPLOYMENT.MF nie uwzgl&#281;dniono &#380;adnych pakunk&#243;w wymienionych w komunikacie o wyj&#261;tku. Nie modyfikuj manifestu wdra&#380;ania r&#281;cznie. W razie potrzeby usu&#324; manifest wdro&#380;enia z pliku EBA. Spowoduje to wygenerowanie nowego pliku manifestu wdro&#380;enia podczas importowania pliku EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: Okre&#347;lona grupa {0} jest niepoprawna.
  </MsgText>
  <Explanation>
    Podj&#281;to pr&#243;b&#281; odwzorowania roli zabezpiecze&#324; na grup&#281;, kt&#243;ra jest niepoprawna.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy podana grupa istnieje.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Us&#322;uga administracyjna nie zosta&#322;a zarejestrowana.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Rozszerzenie jednostki kompozycji {0} wymaga pobrania danych zewn&#281;trznych.
  </MsgText>
  <Explanation>
    Utworzono lub zaktualizowano archiwum pakunku z&#322;o&#380;onego (CBA) w celu u&#380;ycia jako rozszerzenia jednostki kompozycji. To rozszerzenie wymaga pobrania co najmniej jednego pakunku z repozytorium, aby mo&#380;na je by&#322;o doda&#263; do jednostki kompozycji.
  </Explanation>
  <UserResponse>
    Aby rozpocz&#261;&#263; proces pobierania, nale&#380;y zapisa&#263; zmiany w konfiguracji g&#322;&#243;wnej.  Status pobierania pakunku mo&#380;na wy&#347;wietli&#263; na panelu szczeg&#243;&#322;&#243;w jednostki kompozycji w Konsoli administracyjnej. Poczekaj na uko&#324;czenie pobierania pakunku, nast&#281;pnie dodaj rozszerzenie do jednostki kompozycji.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: Wymagany sk&#322;adnik {0} nie jest wdro&#380;ony dla zasobu aplikacyjnego {1} na &#380;adnym z serwer&#243;w i klastr&#243;w.
  </MsgText>
  <Explanation>
    Wybrany sk&#322;adnik nie zosta&#322; znaleziony na &#380;adnym z serwer&#243;w.
  </Explanation>
  <UserResponse>
    Zainstaluj wymagany sk&#322;adnik na co najmniej jednym z serwer&#243;w.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. W pliku archiwum pakunku korporacyjnego (EBA) {0} nie ma nast&#281;puj&#261;cych pakunk&#243;w: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: Nie mo&#380;na doda&#263; zasobu aplikacyjnego {0} do tej aplikacji na poziomie biznesowym, poniewa&#380; zosta&#322; on ju&#380; dodany do aplikacji tego rodzaju: {1}
  </MsgText>
  <Explanation>
    Zas&#243;b aplikacyjny archiwum pakunku korporacyjnego mo&#380;e znajdowa&#263; si&#281; tylko w pojedynczej aplikacji BLA.
  </Explanation>
  <UserResponse>
    Utw&#243;rz now&#261; aplikacj&#281; o tej samej zawarto&#347;ci, ale o innej nazwie symbolicznej aplikacji. Zaimportuj now&#261; aplikacj&#281; jako zas&#243;b archiwum pakunku korporacyjnego, a nast&#281;pnie dodaj j&#261; do tej aplikacji BLA.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: Udost&#281;pnienie aplikacji {0} da&#322;o r&#243;&#380;ne wyniki dla serwera WebSphere Application Server 8 i serwera WebSphere Application Server 7 z pakietem OSGi Applications Feature Pack. Zostanie u&#380;yty wynik dla wersji 8.
  </MsgText>
  <Explanation>
    Importowana aplikacja zosta&#322;a pomy&#347;lnie udost&#281;pniona na serwerze WebSphere Application Server w wersji 8 i na serwerze WebSphere Application Server w wersji 7 z pakietem OSGi Applications Feature Pack. Jednak dla obu operacji udost&#281;pniania uzyskano r&#243;&#380;ne wyniki. Nie mo&#380;na uruchamia&#263; tej samej aplikacji z r&#243;&#380;nymi wdro&#380;eniami.
  </Explanation>
  <UserResponse>
    Nie jest wymagana &#380;adna czynno&#347;&#263;.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: Aplikacja {1} zosta&#322;a przypisana do katalogu {0}.
  </MsgText>
  <Explanation>
    Zas&#243;b aplikacyjny archiwum pakunku korporacyjnego (EBA) jest dodawany do jednostki kompozycji. Aby skonfigurowa&#263; aplikacj&#281; WWW zawart&#261; w pliku EBA, przypisano katalog do tej aplikacji.
  </Explanation>
  <UserResponse>
    Brak.
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na odczyta&#263; manifestu aplikacji lub manifestu wdra&#380;ania pliku EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na znale&#378;&#263; kroku {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: Zas&#243;b aplikacyjny {0} zawiera plik JAR {1}, kt&#243;ry nie jest pakunkiem i nie zostanie przekszta&#322;cony. Je&#347;li inne cz&#281;&#347;ci aplikacji zale&#380;&#261; od tego pliku, dzia&#322;anie aplikacji nie powiedzie si&#281; w czasie wykonywania.
  </MsgText>
  <Explanation>
    Przekszta&#322;canie narz&#281;dziowych plik&#243;w archiwum Java (JAR) oraz plik&#243;w JAR komponent&#243;w EJB (Enterprise JavaBeans) nie jest obs&#322;ugiwane.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy &#380;aden pakunek lub pakunek aplikacji WWW (WAB) nie jest zale&#380;ny od klas pochodz&#261;cych z tego pliku JAR. Aby zapobiec wy&#347;wietlaniu komunikatu ostrzegawczego, usu&#324; plik JAR z archiwum pakunku korporacyjnego.
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na odczyta&#263; manifestu aplikacji lub manifestu wdra&#380;ania pliku EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: Interfejsu {0} dla komponentu EJB {1} w pakunku {2} w wersji {3} nie mo&#380;na powi&#261;za&#263; z po&#322;o&#380;eniem {4}. Dost&#281;pne lokalnie interfejsy komponent&#243;w EJB musz&#261; by&#263; powi&#261;zane z przestrzeni&#261; nazw ejblocal:.
  </MsgText>
  <Explanation>
    Widoki Lokalny, Bez interfejsu i Lokalny obiekt podstawowy komponentu EJB mog&#261; by&#263; powi&#261;zane tylko z lokalnie dost&#281;pnym interfejsem JNDI. Oznacza to, &#380;e ich nazwy powi&#261;za&#324; musz&#261; zaczyna&#263; si&#281; od &#322;a&#324;cucha ejblocal:.
  </Explanation>
  <UserResponse>
    Dostosuj nazwy powi&#261;za&#324; wszelkich lokalnie dost&#281;pnych widok&#243;w komponent&#243;w EJB w taki spos&#243;b, aby zawiera&#322;y przedrostek przestrzeni nazw ejblocal:.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: Element CompUnitStatusStep wskazuje, &#380;e jednostka kompozycji {0} powinna zosta&#263; zaktualizowana do najnowszej wersji wdro&#380;enia dost&#281;pnej w ramach zasobu aplikacyjnego {1}. Jednak jednostka kompozycji {0} jest aktualna.
  </MsgText>
  <Explanation>
    Aby mo&#380;na by&#322;o zaktualizowa&#263; zas&#243;b aplikacyjny wdro&#380;ony w jednostce kompozycji, musi by&#263; dost&#281;pna zaktualizowana wersja, a dla wszystkich pakunk&#243;w wymaganych przez zaktualizowany zas&#243;b aplikacyjny pobieranie musi by&#263; zako&#324;czone.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy nowsza wersja zasobu aplikacyjnego jest dost&#281;pna i czy wszystkie operacje pobierania pakunk&#243;w dla zasobu aplikacyjnego zosta&#322;y uko&#324;czone.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na uzyska&#263; jednostki kompozycji dla zasobu aplikacyjnego {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: Nie mo&#380;na utworzy&#263; elementu klastra w w&#281;&#378;le {0}, poniewa&#380; aplikacje OSGi {1} zosta&#322;y rozszerzone.
  </MsgText>
  <Explanation>
    Wszystkie elementy klastra musz&#261; obs&#322;ugiwa&#263; uruchamianie tych samych aplikacji, ale nowy element klastra nie obs&#322;uguje rozszerze&#324; aplikacji OSGi.
  </Explanation>
  <UserResponse>
    Wybierz w&#281;ze&#322; w wersji 8 jako hosta elementu klastra lub usu&#324; rozszerzenia z aplikacji, aby mo&#380;na je by&#322;o uruchamia&#263; przy u&#380;yciu wybranego w&#281;z&#322;a.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: Pakunek {0} w jednostce kompozycji {1} nie mo&#380;e zosta&#263; zaktualizowany, poniewa&#380; istnieje powoduj&#261;ce konflikt rozszerzenie o tej samej nazwie symbolicznej.
  </MsgText>
  <Explanation>
    Nie jest mo&#380;liwe zaktualizowanie pakunku CBA do &#380;&#261;danej wersji, poniewa&#380; istnieje ju&#380; rozszerzenie o tej samej nazwie symbolicznej w tej wersji.
  </Explanation>
  <UserResponse>
    Usu&#324; rozszerzenie albo zmodyfikuj wersj&#281; pakunku, do poziomu kt&#243;rej ma by&#263; wykonana aktualizacja.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: W elemencie docelowym {1} dla zasobu u&#380;ywanego przez komponent bean {2} w pakunku {3} o wersji {4} nie mo&#380;na znale&#378;&#263; specyfikacji aktywowania komponentu MDB zgodnej z nazw&#261; JNDI {0}.
  </MsgText>
  <Explanation>
    Okre&#347;lona nazwa JNDI odwo&#322;ania do specyfikacji aktywowania powi&#261;zania programu nas&#322;uchuj&#261;cego komponentu MDB nie istnieje.
  </Explanation>
  <UserResponse>
    Je&#347;li odwo&#322;anie powinno si&#281; znajdowa&#263; w przestrzeni nazw JNDI, powi&#261;&#380; obiekt z nazw&#261; lub popraw odwo&#322;anie i zaktualizuj archiwum pakunku korporacyjnego.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na wykona&#263; zasobu dotycz&#261;cego tre&#347;ci zasobu aplikacyjnego {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: W tre&#347;ci aplikacji {0} znajduje si&#281; pakunek z&#322;o&#380;ony {1}. Taka operacja nie jest obs&#322;ugiwana.
  </MsgText>
  <Explanation>
    Nie mo&#380;na u&#380;y&#263; nag&#322;&#243;wka Application-Content do w&#322;&#261;czania archiw&#243;w pakunk&#243;w z&#322;o&#380;onych bezpo&#347;rednio w pliku EBA.
  </Explanation>
  <UserResponse>
    Usu&#324; pakunek z&#322;o&#380;ony z zawarto&#347;ci aplikacji. Mo&#380;na w&#322;&#261;czy&#263; indywidualne pakunki w nag&#322;&#243;wku Application-Content lub zainstalowa&#263; pakunek z&#322;o&#380;ony w repozytorium pakunk&#243;w w celu wsp&#243;&#322;u&#380;ytkowania.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Plik o poprawnej nazwie istnieje w pami&#281;ci podr&#281;cznej pakunk&#243;w, ale nie zawiera on oczekiwanego pakunku {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: Nie mo&#380;na znale&#378;&#263; odwo&#322;ania do miejsca docelowego komunikat&#243;w lub odwo&#322;ania do &#347;rodowiska zasob&#243;w o nazwie JNDI {0} oraz typie {1} w elemencie docelowym {2} dla odwo&#322;ania do miejsca docelowego komunikat&#243;w komponentu EJB lub odwo&#322;ania do &#347;rodowiska zasob&#243;w {3} zdefiniowanego w pakunku {4} o wersji {5}.
  </MsgText>
  <Explanation>
    Archiwum pakunku korporacyjnego (Enterprise Bundle Archive - EBA) zawieraj&#261;ce odwo&#322;ania do miejsca docelowego komunikat&#243;w lub odwo&#322;ania do &#347;rodowiska zasob&#243;w w module EJB okre&#347;la nazw&#281; JNDI dla odwo&#322;ania do miejsca docelowego komunikat&#243;w lub odwo&#322;ania do &#347;rodowiska zasob&#243;w, kt&#243;re nie istnieje w przestrzeni nazw JNDI.
  </Explanation>
  <UserResponse>
    Je&#347;li odwo&#322;anie do miejsca docelowego komunikat&#243;w lub odwo&#322;anie do &#347;rodowiska zasob&#243;w powinno si&#281; znajdowa&#263; w przestrzeni nazw JNDI, powi&#261;&#380; obiekt z nazw&#261; b&#261;d&#378; popraw odwo&#322;anie do miejsca docelowego komunikat&#243;w lub odwo&#322;anie do &#347;rodowiska zasob&#243;w i zaktualizuj archiwum pakunku korporacyjnego.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: Aplikacja OSGi {0} jest niepoprawna, poniewa&#380; jej nazwa symboliczna zawiera dwa s&#261;siaduj&#261;ce znaki kropki.
  </MsgText>
  <Explanation>
    Nazwa symboliczna aplikacji OSGi nie mo&#380;e zawiera&#263; &#322;a&#324;cucha .. (dwa s&#261;siaduj&#261;ce znaki kropki).
  </Explanation>
  <UserResponse>
    Zmie&#324; nazw&#281; symboliczn&#261; aplikacji OSGi.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: Nie mo&#380;na odczyta&#263; pliku EBA {0}.
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; wyj&#261;tek IOException podczas odczytywania pliku archiwum pakunku korporacyjnego (EBA). Plik m&#243;g&#322; by&#263; uszkodzony lub nie mo&#380;na by&#322;o go odczyta&#263;.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy plik ma odpowiednie uprawnienia i czy ma poprawny format.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Komponent MBean SecurityAdmin nie zosta&#322; zarejestrowany.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: Nie mo&#380;na rozstrzygn&#261;&#263; odwo&#322;a&#324; w tre&#347;ci archiwum pakunku z&#322;o&#380;onego (Composite Bundle Archive - CBA) {0}. Je&#347;li te us&#322;ugi s&#261; dostarczane przez pakunki, kt&#243;re nie znajduj&#261; si&#281; w tym archiwum CBA, nale&#380;y je zaimportowa&#263; do tego archiwum CBA. Nierozstrzygni&#281;te pozosta&#322;y nast&#281;puj&#261;ce zale&#380;no&#347;ci us&#322;ug: {1}
  </MsgText>
  <Explanation>
    Je&#347;li pakunek w archiwum CBA korzysta z us&#322;ugi, kt&#243;rej nie ma w pakunku, lub kt&#243;ra zosta&#322;a wyeksportowana przez inny pakunek w archiwum CBA, nale&#380;y zaimportowa&#263; t&#281; us&#322;ug&#281; do archiwum CBA.
  </Explanation>
  <UserResponse>
    Popraw manifest pakunku z&#322;o&#380;onego COMPOSITEBUNDLE.MF w taki spos&#243;b, aby do archiwum CBA by&#322;y importowane wszystkie us&#322;ugi, kt&#243;re s&#261; u&#380;ywane przez pakunki w tym archiwum CBA i kt&#243;re nie s&#261; w nim dost&#281;pne.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: Nie mo&#380;na zapisa&#263; poddanego migracji pliku EBA {0}.
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; wyj&#261;tek IOException podczas zapisywania poddanego migracji pliku archiwum pakunku korporacyjnego (EBA).
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy produkt dysponuje niezb&#281;dnymi uprawnieniami zapisu we w&#322;a&#347;ciwym katalogu, czy plik docelowy nie jest zablokowany i czy jest dost&#281;pne miejsce w pami&#281;ci masowej.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: Nie mo&#380;na udost&#281;pni&#263; aplikacji {0} dla wszystkich w&#281;z&#322;&#243;w w kom&#243;rce. Aplikacja mo&#380;e zosta&#263; wdro&#380;ona tylko w w&#281;z&#322;ach wersji 8. B&#322;&#261;d rozstrzygni&#281;cia to {1}.
  </MsgText>
  <Explanation>
    Importowana aplikacja zosta&#322;a pomy&#347;lnie udost&#281;pniona na serwerze WebSphere Application Server w wersji 8, ale nie mo&#380;na jej by&#322;o udost&#281;pni&#263; w ramach pakietu OSGi Applications Feature Pack na serwerze WebSphere Application Server w wersji 7.
  </Explanation>
  <UserResponse>
    Nie jest wymagana &#380;adna czynno&#347;&#263;. Jednak mo&#380;na u&#380;y&#263; informacji z komunikatu o b&#322;&#281;dzie rozstrzygni&#281;cia w celu zmodyfikowania aplikacji, aby mo&#380;na j&#261; by&#322;o wdro&#380;y&#263; w ramach pakietu OSGi Applications Feature Pack na serwerze WebSphere Application Server w wersji 7.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Nazwa localhost jest u&#380;ywana jako nazwa hosta dla transportu serwera {0}.{1} Routing &#380;&#261;da&#324; b&#281;dzie dzia&#322;a&#322;, je&#347;li serwer WWW i serwer aplikacji b&#281;d&#261; w tym samym w&#281;&#378;le.
  </MsgText>
  <Explanation>
    Nazwa hosta serwera aplikacji okre&#347;lona w transporcie zosta&#322;a przet&#322;umaczona jako localhost.
  </Explanation>
  <UserResponse>
    Je&#347;li serwer WWW i serwer aplikacji znajduj&#261; si&#281; w r&#243;&#380;nych w&#281;z&#322;ach, sprawd&#378;, dlaczego nazwa hosta serwera aplikacji zosta&#322;a przet&#322;umaczona jako localhost.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: Nie mo&#380;na zainstalowa&#263; pliku EBA {0}. Nazwa Application-SymbolicName {1} pliku EBA jest ju&#380; u&#380;ywana przez zas&#243;b aplikacyjny {2}.
  </MsgText>
  <Explanation>
    Pr&#243;bowano zainstalowa&#263; plik EBA, ale istnieje zas&#243;b aplikacyjny, kt&#243;ry u&#380;ywa tej samej nazwy symbolicznej.
  </Explanation>
  <UserResponse>
    Zmie&#324; nazw&#281; symboliczn&#261; instalowanego pliku EBA lub odinstaluj istniej&#261;cy zas&#243;b aplikacyjny.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: Nie mo&#380;na utworzy&#263; elementu klastra w w&#281;&#378;le {0}, poniewa&#380; nie mo&#380;na udost&#281;pni&#263; aplikacji OSGi {1} w tym w&#281;&#378;le. B&#322;&#261;d rozstrzygni&#281;cia to {2}.
  </MsgText>
  <Explanation>
    Wszystkie elementy klastra musz&#261; obs&#322;ugiwa&#263; uruchamianie tych samych aplikacji, ale w nowym elemencie klastra nie mo&#380;na uruchamia&#263; nazwanych aplikacji OSGi.
  </Explanation>
  <UserResponse>
    Wybierz inny, zgodny w&#281;ze&#322; jako hosta elementu klastra lub zmodyfikuj aplikacje, aby mo&#380;na je by&#322;o uruchamia&#263; przy u&#380;yciu wybranego w&#281;z&#322;a.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: Nie mo&#380;na przeanalizowa&#263; pliku {0} dla pliku archiwum pakunku korporacyjnego {1}.
  </MsgText>
  <Explanation>
    Nie mo&#380;na przeanalizowa&#263; okre&#347;lonego pliku.
  </Explanation>
  <UserResponse>
    Upewnij si&#281;, &#380;e plik zosta&#322; poprawnie sformatowany i nie zosta&#322; uszkodzony.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na odczyta&#263; manifestu aplikacji lub manifestu wdra&#380;ania pliku EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: Nie mo&#380;na utworzy&#263; pliku: {0}
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; problem dotycz&#261;cy tworzenia wymaganej nazwy &#347;cie&#380;ki podczas eksportowania zasobu aplikacyjnego.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy serwer aplikacji ma uprawnienia do utworzenia tej nazwy &#347;cie&#380;ki.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: Komenda UpdateAppContentVersionStep produktu WAS 7 zosta&#322;a zast&#261;piona w produkcie WAS 8 komend&#261; UpdateAppContentVersions.
  </MsgText>
  <Explanation>
    Komenda UpdateAppContentVersionStep produktu WAS 7 zosta&#322;a zast&#261;piona w produkcie WAS 8 komend&#261; UpdateAppContentVersions. Wi&#281;cej informacji na ten temat zawiera Centrum informacyjne.
  </Explanation>
  <UserResponse>
    Zmie&#324; skrypt w taki spos&#243;b, aby by&#322;a u&#380;ywana komenda UpdateAppContentVersions.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Plik archiwum pakunku korporacyjnego (EBA) {0} nie okre&#347;la &#380;adnej zawarto&#347;ci, kt&#243;r&#261; mo&#380;na wdro&#380;y&#263;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: Nie mo&#380;na rozstrzygn&#261;&#263; pliku EBA. Wyj&#261;tek: {0}.
  </MsgText>
  <Explanation>
    System nie mo&#380;e rozstrzygn&#261;&#263; po&#322;o&#380;e&#324; sk&#322;adowych pakunk&#243;w aplikacji (w odpowiednich wersjach) pliku archiwum pakunku korporacyjnego (EBA).
  </Explanation>
  <UserResponse>
    Wi&#281;cej informacji zawiera wyj&#261;tek.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na rozstrzygn&#261;&#263; pliku archiwum pakunku korporacyjnego (EBA) {0}, poniewa&#380; us&#322;uga {1} jest niedost&#281;pna.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: Okre&#347;lony u&#380;ytkownik {0} jest niepoprawny.
  </MsgText>
  <Explanation>
    Podj&#281;to pr&#243;b&#281; odwzorowania roli zabezpiecze&#324; na u&#380;ytkownika, kt&#243;ry jest niepoprawny.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy podany u&#380;ytkownik istnieje.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie znaleziono komponentu MBean dla elementu BundleCacheManager dla profilu {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: Powi&#261;zanie {0} dla odwo&#322;ania do komponentu EJB {1} w pakunku {2} o wersji {3} z interfejsem {4} mo&#380;e spowodowa&#263; niepoprawne dzia&#322;anie aplikacji po aktualizacji.
  </MsgText>
  <Explanation>
    Cz&#281;&#347;ci sk&#322;adowe odwo&#322;a&#324; do wyszukania java:global/nazwa_aplikacji/nazwa_modu&#322;u/nazwa_komponentu_EJB lub java:app/nazwa_modu&#322;u/nazwa_komponentu_EJB mog&#261; ulec zmianie po zaktualizowaniu aplikacji OSGi. Powoduje to konieczno&#347;&#263; odpowiedniego zmodyfikowania odwo&#322;a&#324;, przez co to podej&#347;cie jest niepraktyczne.
  </Explanation>
  <UserResponse>
    U&#380;yj us&#322;ug OSGi do skonfigurowania zale&#380;no&#347;ci komponentu EJB lub zadeklaruj odwo&#322;anie do komponentu EJB i odwzoruj je na nazw&#281; JNDI komponentu EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Nie mo&#380;na rozszerzy&#263; pliku archiwum pakunku korporacyjnego {0}. Nie mo&#380;na utworzy&#263; katalogu {1}.
  </MsgText>
  <Explanation>
    Podczas pr&#243;by rozszerzenia okre&#347;lonego pliku EBA nie mo&#380;na by&#322;o utworzy&#263; wymaganego katalogu.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy serwer aplikacji ma uprawnienia do utworzenia okre&#347;lonego katalogu.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: Nie mo&#380;na rozstrzygn&#261;&#263; zasobu aplikacyjnego {0}. Jego wymagania dotycz&#261;ce wersji nie s&#261; zgodne w przypadku nast&#281;puj&#261;cych pakiet&#243;w: {1}.
  </MsgText>
  <Explanation>
    W przypadku pakunk&#243;w wymienionych w nag&#322;&#243;wku Application-Content pliku APPLICATION.MF wszystkie importy dla danego pakietu musz&#261; mie&#263; zgodne wymagania dotycz&#261;ce wersji.
  </Explanation>
  <UserResponse>
    Zmie&#324; spos&#243;b pakowania lub konfiguracj&#281; aplikacji tak, aby wszystkie pakunki wymienione w nag&#322;&#243;wku Application-Content mia&#322;y zgodne wymagania dotycz&#261;ce wersji pakietu.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Nie mo&#380;na skonfigurowa&#263; r&#243;l dla polecenia Uruchom jako w w&#281;z&#322;ach WebSphere Application Server w wersji wcze&#347;niejszej ni&#380; 8. Taka konfiguracja zostanie zignorowana.
  </MsgText>
  <Explanation>
    Role dla polecenia Uruchom jako mo&#380;na konfigurowa&#263; tylko dla serwera WebSphere Application Server w wersji 8 i nowszych. Nie mo&#380;na ich konfigurowa&#263; dla jednostki kompozycji wdro&#380;onej w w&#281;z&#322;ach docelowych WebSphere Application Server 7 z pakietem OSGi Applications Feature Pack.
  </Explanation>
  <UserResponse>
    Nie jest wymagana &#380;adna czynno&#347;&#263;. Je&#347;li jest wymagane skonfigurowanie r&#243;l dla polecenia Uruchom jako, usu&#324; odwzorowania element&#243;w docelowych dla w&#281;z&#322;&#243;w WebSphere Application Server 7 z pakietem OSGi Applications Feature Pack.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: ID u&#380;ytkownika lub has&#322;o jest niepoprawne.
  </MsgText>
  <Explanation>
    Podano niepoprawny identyfikator u&#380;ytkownika lub has&#322;o.
  </Explanation>
  <UserResponse>
    Pon&#243;w dzia&#322;anie, u&#380;ywaj&#261;c poprawnego identyfikatora u&#380;ytkownika i has&#322;a.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: Pr&#243;ba zaktualizowania aplikacji OSGi wdro&#380;onej w jednostce kompozycji {0} aplikacji na poziomie biznesowym {1} nie powiod&#322;a si&#281;.
  </MsgText>
  <Explanation>
    Podczas operacji aktualizowania wyst&#261;pi&#322; wyj&#261;tek.
  </Explanation>
  <UserResponse>
    Sprawd&#378; wpisy w dziennikach serwera poprzedzaj&#261;ce ten wyj&#261;tek, aby przeprowadzi&#263; bardziej szczeg&#243;&#322;ow&#261; diagnostyk&#281; problemu.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Pozycja Application-Content manifestu aplikacji w pliku archiwum pakunku korporacyjnego (EBA) {0} jest pusta, dlatego nie zostanie zainstalowany &#380;aden pakunek.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: Nie mo&#380;na odczyta&#263; pliku deskryptora aplikacji Java EE z pliku EBA {0}.
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; wyj&#261;tek IOException podczas odczytywania pliku deskryptora aplikacji Java EE z pliku archiwum pakunku korporacyjnego (EBA).
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy plik deskryptora aplikacji nie jest uszkodzony, czy mo&#380;na go odczyta&#263; i czy ma ustawione odpowiednie uprawnienia.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: Nie mo&#380;na znale&#378;&#263; odwo&#322;ania do zasobu o nazwie JNDI {0} oraz typie {1} w elemencie docelowym {2} odwo&#322;ania do zasobu modu&#322;u WWW {3} zdefiniowanego w pakunku {4} o wersji {5}.
  </MsgText>
  <Explanation>
    Archiwum pakunku korporacyjnego (EBA) uwzgl&#281;dniaj&#261;ce odwo&#322;ania do zasobu w archiwum aplikacji WWW (WAR) okre&#347;la nazw&#281; JNDI odwo&#322;ania do zasobu, kt&#243;ry nie istnieje w przestrzeni nazw JNDI.
  </Explanation>
  <UserResponse>
    Je&#347;li odwo&#322;anie do zasobu powinno si&#281; znajdowa&#263; w przestrzeni nazw JNDI, powi&#261;&#380; obiekt z nazw&#261; lub popraw odwo&#322;anie do zasobu i zaktualizuj archiwum pakunku korporacyjnego.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Nie mo&#380;na utworzy&#263; domy&#347;lnego powi&#261;zania dla odwo&#322;ania do komponentu EJB {0} w pakunku {1} w wersji {2} z interfejsem {3}, poniewa&#380; wyst&#281;puj&#261; co najmniej dwa mo&#380;liwe powi&#261;zania. Odwo&#322;anie mo&#380;na powi&#261;za&#263; z ka&#380;dym z nast&#281;puj&#261;cych komponent&#243;w EJB: {4}.
  </MsgText>
  <Explanation>
    Dla niepowi&#261;zanych odwo&#322;a&#324; do komponent&#243;w EJB nale&#380;y utworzy&#263; powi&#261;zania domy&#347;lne. Znaleziono wi&#281;cej ni&#380; jeden komponent EJB, z kt&#243;rym mog&#322;oby zosta&#263; powi&#261;zane to odwo&#322;anie.
  </Explanation>
  <UserResponse>
    Powi&#261;&#380; odwo&#322;anie z okre&#347;lonym komponentem EJB lub popraw aplikacj&#281;.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: Alias uwierzytelniania {0} jest niepoprawnie skonfigurowany. Nie mo&#380;na powi&#261;za&#263; aliasu o typie uwierzytelniania Application (aplikacja) z odwo&#322;aniami.
  </MsgText>
  <Explanation>
    Alias&#243;w uwierzytelniania o typie uwierzytelniania Application (aplikacja) nie mo&#380;na powi&#261;za&#263; z odwo&#322;aniami do zasobu obiektu Blueprint.
  </Explanation>
  <UserResponse>
    Usu&#324; alias uwierzytelniania z odpowiedniego odwo&#322;ania do zasobu.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: Host wirtualny {0} okre&#347;lony dla pakunku {1} nie istnieje.
  </MsgText>
  <Explanation>
    Podj&#281;to pr&#243;b&#281; odwzorowania pakunku aplikacji WWW (WAB) na host wirtualny, kt&#243;ry jest niepoprawny.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy istnieje podany host wirtualny.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: Manifest aplikacji pliku EBA {0} zawiera w nag&#322;&#243;wku Application-Content pakunki, kt&#243;re s&#261; tak&#380;e wymienione w nag&#322;&#243;wku Use-Bundle.
  </MsgText>
  <Explanation>
    Nazwy pakunk&#243;w wymienione w nag&#322;&#243;wku Application-Content pliku APPLICATION.MF nie mog&#261; by&#263; tak&#380;e wymienione w nag&#322;&#243;wku Use-Bundle bez wzgl&#281;du na wersje pakunk&#243;w.
  </Explanation>
  <UserResponse>
    Zmie&#324; spos&#243;b pakowania archiwum pakunku korporacyjnego (Enterprise Bundle Archive - EBA) tak, aby nazwy pakunk&#243;w nie by&#322;y duplikowane w nag&#322;&#243;wkach Application-Content oraz Use-Bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: Archiwum pakunku z&#322;o&#380;onego (Composite Bundle Archive - CBA) {0} jest niepoprawne. W nag&#322;&#243;wku Import-Package pliku manifestu archiwum CBA nie ma pakiet&#243;w importowanych przez pakunki w tym archiwum CBA. Zosta&#322;y zg&#322;oszone nast&#281;puj&#261;ce problemy: {1}
  </MsgText>
  <Explanation>
    Je&#347;li pakunek w archiwum CBA korzysta z pakietu, kt&#243;rego nie ma w pakunku, lub kt&#243;ry zosta&#322; wyeksportowany przez inny pakunek w archiwum CBA, nale&#380;y zaimportowa&#263; ten pakiet do archiwum CBA.
  </Explanation>
  <UserResponse>
    Popraw manifest pakunku z&#322;o&#380;onego COMPOSITEBUNDLE.MF w taki spos&#243;b, aby do archiwum CBA by&#322;y importowane wszystkie pakiety, kt&#243;re s&#261; u&#380;ywane przez pakunki w tym archiwum CBA i kt&#243;re nie s&#261; w nim dost&#281;pne.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: Plik powi&#261;za&#324; komponentu EJB {0} w pakunku {1} w wersji {2} zawiera wiele odwzorowa&#324; dla interfejsu {3}. Te odwzorowania to {4} i {5}.
  </MsgText>
  <Explanation>
    Plik powi&#261;za&#324; komponentu EJB do&#322;&#261;czony do pakunku zawiera niejednoznaczne informacje o konfiguracji odwzorowania dla interfejsu komponentu EJB.
  </Explanation>
  <UserResponse>
    Popraw plik powi&#261;za&#324; w taki spos&#243;b, aby dla ka&#380;dego interfejsu komponentu EJB istnia&#322;o tylko jedno skonfigurowane odwzorowanie.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: W bie&#380;&#261;cej kom&#243;rce nie znaleziono jednostki kompozycji o nazwie {0}.
  </MsgText>
  <Explanation>
    Podana nazwa nie jest zgodna z &#380;adn&#261; nazw&#261; istniej&#261;cej jednostki kompozycji.
  </Explanation>
  <UserResponse>
    Sprawd&#378; nazw&#281; jednostki kompozycji.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: Plik EBA {0} zawiera plik MANIFEST.MF z nag&#322;&#243;wkiem Extension-List. Przekszta&#322;cenie tego nag&#322;&#243;wka nie jest obs&#322;ugiwane.
  </MsgText>
  <Explanation>
    Pr&#243;bowano przekszta&#322;ci&#263; plik archiwum korporacyjnego (EAR) w plik archiwum pakunku korporacyjnego (EBA), jednak plik EAR zawiera plik MANIFEST.MF z nag&#322;&#243;wkiem Extension-List, kt&#243;rego przekszta&#322;cenie nie jest obs&#322;ugiwane. Nag&#322;&#243;wek Extension-List w pliku EAR s&#322;u&#380;y do identyfikacji zewn&#281;trznych plik&#243;w JAR wymaganych przez aplikacj&#281; w czasie wykonywania.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy zewn&#281;trzne pliki JAR wymienione w nag&#322;&#243;wku Extension-List s&#261; dost&#281;pne jako pakunki w repozytorium pakunk&#243;w.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: Nie mo&#380;na rozstrzygn&#261;&#263; zasobu aplikacyjnego {0}. Wymaga on pakunku {1}, kt&#243;ry nie jest wymieniony w nag&#322;&#243;wku Application-Content manifestu aplikacji APPLICATION.MF. Pakunek ten importuje pakiet {2} z pakunku {3}, kt&#243;ry jest wymieniony w nag&#322;&#243;wku Application-Content.
  </MsgText>
  <Explanation>
    Aplikacja nie zosta&#322;a poprawnie skonfigurowana. Pakunek wsp&#243;&#322;u&#380;ytkowany nie mo&#380;e importowa&#263; pakietu z pakunku izolowanego. Pakunki wymienione w nag&#322;&#243;wku Application-Content s&#261; izolowane i mog&#261; udost&#281;pnia&#263; pakiety tylko innym pakunkom wymienionym w nag&#322;&#243;wku.
  </Explanation>
  <UserResponse>
    Zmie&#324; spos&#243;b pakowania lub konfiguracj&#281; aplikacji tak, aby pakunki wymienione w nag&#322;&#243;wku Use-Bundle lub dodane przez element rozstrzygaj&#261;cy nie wymaga&#322;y pakiet&#243;w z pakunk&#243;w wymienionych w nag&#322;&#243;wku Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): element EJBMappingsStep nie zosta&#322; uruchomiony, mimo &#380;e powinno to nast&#261;pi&#263;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: Nie mo&#380;na wdro&#380;y&#263; zasobu aplikacyjnego {0} zar&#243;wno w elemencie docelowym {1} w domenie zabezpiecze&#324; {2}, jak i w elemencie docelowym {3} w domenie zabezpiecze&#324; {4}.
  </MsgText>
  <Explanation>
    Aby mo&#380;na by&#322;o wdro&#380;y&#263; zas&#243;b aplikacyjny w wi&#281;cej ni&#380; jednym miejscu docelowym, wszystkie miejsca docelowe musz&#261; znajdowa&#263; si&#281; w tej samej domenie zabezpiecze&#324;.
  </Explanation>
  <UserResponse>
    Zmie&#324; miejsca docelowe wdra&#380;ania tak, aby wybra&#263; zestaw miejsc docelowych znajduj&#261;cych si&#281; w pojedynczej domenie zabezpiecze&#324;.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: Manifest elementu z&#322;o&#380;onego w archiwum pakunku z&#322;o&#380;onego (CBA) {0} zawiera nag&#322;&#243;wek CompositeBundle-ExportService, ale w archiwum CBA brak zdefiniowanych us&#322;ug zgodnych z tym filtrem.
  </MsgText>
  <Explanation>
    Manifest pakunku z&#322;o&#380;onego definiuje nag&#322;&#243;wek CompositeBundle-ExportService, ale brak deklaracji us&#322;ug obiektu Blueprint zgodnych z tym filtrem.
  </Explanation>
  <UserResponse>
    Dodaj brakuj&#261;ce deklaracje us&#322;ug obiektu Blueprint w tre&#347;ci archiwum CBA lub popraw nag&#322;&#243;wek CompositeBundle-ExportService w pliku manifestu elementu z&#322;o&#380;onego - COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: Komponent EJB {0} w pakunku {1} w wersji {2} ma zdefiniowan&#261; prost&#261; nazw&#281; odwzorowania, ale opr&#243;cz tego istniej&#261; konkretne odwzorowania w jego pliku powi&#261;za&#324;.
  </MsgText>
  <Explanation>
    Plik powi&#261;za&#324; komponentu EJB do&#322;&#261;czony do pakunku zawiera niepoprawn&#261; konfiguracj&#281; odwzorowania dla komponentu EJB.
  </Explanation>
  <UserResponse>
    Popraw plik powi&#261;za&#324; w taki spos&#243;b, aby istnia&#322;a tylko prosta nazwa odwzorowania lub tylko konkretne informacje o konfiguracji odwzorowania.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na usun&#261;&#263; katalogu li&#347;cia dla {0} w celu umo&#380;liwienia zmiany nazwy katalogu.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Nie mo&#380;na rozszerzy&#263; archiwum pakunku korporacyjnego (EBA); nie okre&#347;lono katalogu rozszerzenia w konfiguracji dla {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: Podj&#281;to pr&#243;b&#281; zaktualizowania zasobu aplikacyjnego OSGi. Taka operacja nie jest obs&#322;ugiwana. Aktualizacj&#281; zasob&#243;w aplikacyjnych OSGi mo&#380;na przeprowadzi&#263; przy u&#380;yciu panelu Aktualizacja wersji pakunk&#243;w w tej aplikacji na stronie konfiguracji zasobu aplikacyjnego aplikacji OSGi.
  </MsgText>
  <Explanation>
    Aktualizacja danych binarnych zasobu aplikacyjnego OSGi nie jest obs&#322;ugiwana.
  </Explanation>
  <UserResponse>
    Je&#347;li zakres czynno&#347;ci do wykonania jest wi&#281;kszy ni&#380; tylko zaktualizowanie wersji pakunk&#243;w w istniej&#261;cym zasobie aplikacyjnym, odinstaluj zas&#243;b przed zaimportowaniem jego zamiennika. Zamiast tego mo&#380;na doda&#263; nowe pakunki do istniej&#261;cej aplikacji, pakuj&#261;c je w archiwum pakunku z&#322;o&#380;onego (CBA) i dodaj&#261;c to archiwum jako rozszerzenie do jednostki kompozycji.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Dla komponentu bean {0} w pakunku {1} o wersji {2} w elemencie docelowym {3} nie skonfigurowano nazwy JNDI specyfikacji aktywowania komponentu MDB.
  </MsgText>
  <Explanation>
    Nie skonfigurowano nazwy JNDI specyfikacji aktywowania powi&#261;zania programu nas&#322;uchuj&#261;cego komponentu MDB.
  </Explanation>
  <UserResponse>
    Skonfiguruj odwo&#322;anie do nazwy JNDI specyfikacji aktywowania dla komponentu MDB.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Nie mo&#380;na zmieni&#263; nazwy pliku {0} na {1} w ramach rozszerzania pliku archiwum pakunku korporacyjnego {2}.
  </MsgText>
  <Explanation>
    W celu uko&#324;czenia rozszerzania okre&#347;lonego pliku EBA konieczna jest zmiana nazwy pliku. Operacja zmiany nazwy nie powiod&#322;a si&#281;.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy serwer aplikacji ma uprawnienia do zmiany nazwy pliku.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: Archiwum pakunku z&#322;o&#380;onego (Composite Bundle Archive - CBA) {0} jest niepoprawne. Nast&#281;puj&#261;ce wyeksportowane pakiety wymienione w manife&#347;cie elementu z&#322;o&#380;onego nie zosta&#322;y wyeksportowane przez pakunki z tego archiwum CBA: {1}
  </MsgText>
  <Explanation>
    Z archiwum CBA mo&#380;na wyeksportowa&#263; tylko te pakiety, kt&#243;re s&#261; eksportowane przez pakunki z tego archiwum CBA.
  </Explanation>
  <UserResponse>
    Dodaj brakuj&#261;ce pakiety eksport&#243;w do pakunk&#243;w w archiwum CBA lub usu&#324; szczeg&#243;&#322;owe informacje o tych eksportach z pliku manifestu elementu z&#322;o&#380;onego - COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: Nie mo&#380;na doda&#263; zasobu aplikacyjnego {0}, poniewa&#380; wymagane przez niego pakunki nie zosta&#322;y pobrane. Aby rozpocz&#261;&#263; pobieranie pakunk&#243;w, zapisz zmiany konfiguracji g&#322;&#243;wnej po zaimportowaniu zasobu aplikacyjnego.
  </MsgText>
  <Explanation>
    Podj&#281;to pr&#243;b&#281; dodania zasobu aplikacyjnego, kt&#243;ry wymaga pobrania co najmniej jednego pakunku z repozytorium. Pobieranie nie zosta&#322;o rozpocz&#281;te albo nie zosta&#322;o jeszcze zako&#324;czone.
  </Explanation>
  <UserResponse>
    Je&#347;li nie zapisano zmian po zaimportowaniu zasobu aplikacyjnego, zapisz je. Zaczekaj na zako&#324;czenie pobierania pakunku, a nast&#281;pnie ponownie spr&#243;buj doda&#263; zas&#243;b aplikacyjny do aplikacji na poziomie biznesowym (Business-Level Application - BLA). Status pobierania pakunku mo&#380;na wy&#347;wietli&#263; na panelu szczeg&#243;&#322;&#243;w zasobu aplikacyjnego Konsoli administracyjnej.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: Tre&#347;&#263; manifestu wdra&#380;ania jest niepoprawna. Wymagane s&#261; nast&#281;puj&#261;ce dodatkowe pakunki {0}.
  </MsgText>
  <Explanation>
    Manifest wdra&#380;ania, kt&#243;ry ma zosta&#263; zaimportowany, nie uwzgl&#281;dnia wszystkich pakunk&#243;w wymaganych do rozstrzygni&#281;cia zasobu aplikacyjnego archiwum pakunku korporacyjnego (EBA).
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy w nowym manife&#347;cie wdra&#380;ania DEPLOYMENT.MF uwzgl&#281;dniono wszystkie pakunki wymienione w komunikacie o wyj&#261;tku. Nie modyfikuj manifestu wdra&#380;ania r&#281;cznie. W razie potrzeby usu&#324; manifest wdro&#380;enia z pliku EBA. Spowoduje to wygenerowanie nowego pliku manifestu wdra&#380;ania podczas importowania pliku EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: Nie mo&#380;na utworzy&#263; katalogu {0}.
  </MsgText>
  <Explanation>
    Nie mo&#380;na utworzy&#263; podanego katalogu.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy jest miejsce w pami&#281;ci masowej i czy produkt dysponuje uprawnieniami umo&#380;liwiaj&#261;cymi utworzenie tego katalogu.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: Nie mo&#380;na wyeksportowa&#263; zasobu aplikacyjnego {0}, poniewa&#380; wymagany przez ten zas&#243;b pakunek {1} nie zosta&#322; w pe&#322;ni pobrany.
  </MsgText>
  <Explanation>
    Pr&#243;bowano wyeksportowa&#263; zas&#243;b aplikacyjny, kt&#243;ry wymaga pobrania z repozytorium co najmniej jednego pakunku. Pobieranie nie zosta&#322;o rozpocz&#281;te albo nie zosta&#322;o jeszcze zako&#324;czone.
  </Explanation>
  <UserResponse>
    Je&#347;li nie zapisano zmian po zaimportowaniu zasobu aplikacyjnego, nale&#380;y to zrobi&#263; teraz. Poczekaj na zako&#324;czenie pobierania &#322;adunku, nast&#281;pnie spr&#243;buj ponownie wyeksportowa&#263; zas&#243;b aplikacyjny.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Wyst&#261;pi&#322; b&#322;&#261;d wewn&#281;trzny. Us&#322;uga DeploymentManifestManager jest niedost&#281;pna z poziomu rejestru us&#322;ug OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: Nie mo&#380;na rozstrzygn&#261;&#263; pliku EBA. Do&#322;&#261;czony manifest wdra&#380;ania jest niepoprawny w tym systemie. Wyj&#261;tek: {0}.
  </MsgText>
  <Explanation>
    Manifest wdra&#380;ania zawiera list&#281; konkretnych wersji wymaganych pakunk&#243;w. System nie mo&#380;e rozstrzygn&#261;&#263; tych wersji pakunk&#243;w. Je&#347;li manifest wdra&#380;ania jest zawarty w pliku EBA, program rozstrzygaj&#261;cy u&#380;ywa tylko wersji pakunk&#243;w okre&#347;lonych w tym manife&#347;cie. Inne poprawne wersje mog&#261; by&#263; obecne w systemie, ale nie s&#261; u&#380;ywane, poniewa&#380; nie zosta&#322;y okre&#347;lone w manife&#347;cie wdra&#380;ania.
  </Explanation>
  <UserResponse>
    Je&#347;li zachodzi konieczno&#347;&#263; u&#380;ycia w aplikacji manifestu wdra&#380;ania, na przyk&#322;ad w celu zagwarantowania uruchomienia dok&#322;adnie tej samej konfiguracji pakunk&#243;w w wielu r&#243;&#380;nych &#347;rodowiskach, na podstawie informacji udost&#281;pnionych w wyj&#261;tku zidentyfikuj wymagane wersje pakunk&#243;w, a nast&#281;pnie udost&#281;pnij te wersje w systemie. Je&#347;li ten dodatkowy poziom kontroli nie jest wymagany w przypadku danej aplikacji, usu&#324; manifest wdra&#380;ania. Nie modyfikuj manifestu wdra&#380;ania r&#281;cznie.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: Warto&#347;&#263; okre&#347;lona dla wersji manifestu aplikacji {0} nie jest obs&#322;ugiwana. Obs&#322;ugiwan&#261; wersj&#261; jest {1}.
  </MsgText>
  <Explanation>
    Warto&#347;&#263; okre&#347;lona dla nag&#322;&#243;wka Application-ManifestVersion w pliku APPLICATION.MF jest niepoprawna.
  </Explanation>
  <UserResponse>
    Popraw warto&#347;&#263; nag&#322;&#243;wka Application-ManifestVersion w pliku APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Nie mo&#380;na spe&#322;ni&#263; wymaga&#324; okre&#347;lonych przez manifest wdra&#380;ania w archiwum EBA. Wygenerowany wyj&#261;tek to {0}.
  </MsgText>
  <Explanation>
    Pr&#243;bowano zaimportowa&#263; plik EBA, kt&#243;ry zawiera plik manifestu wdra&#380;ania. Jednak nie mo&#380;na spe&#322;ni&#263; wymaga&#324; okre&#347;lonych w tym pliku.
  </Explanation>
  <UserResponse>
    Sprawd&#378; zawarto&#347;&#263; pliku manifestu wdro&#380;enia i sprawd&#378;, czy system, w kt&#243;rym ten plik EBA jest wdra&#380;any, jest zgodny. Sprawd&#378;, czy skonfigurowano wszelkie wymagane wewn&#281;trzne lub zewn&#281;trzne repozytoria pakunk&#243;w. Nie modyfikuj manifestu wdra&#380;ania r&#281;cznie. W razie potrzeby usu&#324; manifest wdro&#380;enia z pliku EBA. Spowoduje to wygenerowanie nowego pliku manifestu wdra&#380;ania podczas importowania pliku EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: W manife&#347;cie aplikacji pliku EBA {0} okre&#347;lono nag&#322;&#243;wek Application-Content, ale ta pozycja jest pusta.
  </MsgText>
  <Explanation>
    Plik archiwum pakunku korporacyjnego (EBA) zawiera pusty nag&#322;&#243;wek Application-Content w swoim manife&#347;cie aplikacji(application.mf). Je&#347;li pozycja ta wyst&#281;puje, musi zawiera&#263; co najmniej jeden poprawny pakunek.
  </Explanation>
  <UserResponse>
    Zmodyfikuj nag&#322;&#243;wek Application-Content w pliku application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: W elemencie docelowym {1} dla zasobu u&#380;ywanego przez komponent bean {2} w pakunku {3} o wersji {4} nie mo&#380;na znale&#378;&#263; miejsca docelowego komponentu MDB zgodnego z nazw&#261; JNDI {0}.
  </MsgText>
  <Explanation>
    Okre&#347;lona nazwa JNDI odwo&#322;ania do miejsca docelowego powi&#261;zania programu nas&#322;uchuj&#261;cego komponentu MDB nie istnieje.
  </Explanation>
  <UserResponse>
    Je&#347;li odwo&#322;anie powinno si&#281; znajdowa&#263; w przestrzeni nazw JNDI, powi&#261;&#380; obiekt z nazw&#261; lub popraw odwo&#322;anie i zaktualizuj archiwum pakunku korporacyjnego.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: Plik EBA {0} nie zawiera poprawnych pakunk&#243;w ani nie okre&#347;lono w nim nag&#322;&#243;wka Application-Content.
  </MsgText>
  <Explanation>
    Plik archiwum pakunku korporacyjnego (EBA) musi zawiera&#263; co najmniej jeden poprawny pakunek OSGi lub plik archiwum aplikacji WWW (WAR) lub w nag&#322;&#243;wku Application-Content jego pliku manifestu aplikacji musi by&#263; wymieniony co najmniej jeden pakunek OSGi.
  </Explanation>
  <UserResponse>
    Zmodyfikuj plik EBA w taki spos&#243;b, aby zawiera&#322; co najmniej jeden poprawny pakunek, b&#261;d&#378; pliku WAR (w&#322;&#261;czony przez warto&#347;&#263;) lub aby w nag&#322;&#243;wku Application-Content jego pliku manifestu aplikacji (application.mf) wymieniony by&#322; co najmniej jeden pakunek (w&#322;&#261;czony przez odwo&#322;anie).
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: Nie mo&#380;na utworzy&#263; katalogu: {0}
  </MsgText>
  <Explanation>
    Wyst&#261;pi&#322; problem dotycz&#261;cy tworzenia wymaganej nazwy &#347;cie&#380;ki podczas eksportowania zasobu aplikacyjnego.
  </Explanation>
  <UserResponse>
    Sprawd&#378;, czy serwer aplikacji ma uprawnienia do utworzenia tej nazwy &#347;cie&#380;ki.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
