<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: Der Parameter symbolicName wurde nicht angegeben, ist aber erforderlich.
  </MsgText>
  <Explanation>
    Der Befehl erfordert die Angabe des Parameters symbolicName.
  </Explanation>
  <UserResponse>
    Setzen Sie den Befehl erneut mit dem erforderlichen Parameter symbolicName ab.
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: Das Implementierungsmanifest wurde nicht an der Position {0} gefunden.
  </MsgText>
  <Explanation>
    Das zu importierende Implementierungsmanifest DEPLOYMENT.MF ist nicht vorhanden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass der Pfad des Implementierungsmanifests korrekt ist.
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: Die Bundles {0} konnten nicht aus dem internen Bundle-Repository entfernt werden. Alle anderen Bundles ({1}) wurden erfolgreich entfernt.
  </MsgText>
  <Explanation>
    Einige Bundles konnten nicht aus dem internen Bundle-Repository gel&#246;scht werden.
  </Explanation>
  <UserResponse>
    Stoppen Sie alle Anwendungen, die die Bundles, die nicht gel&#246;scht werden konnten, m&#246;glicherweise verwenden, und versuchen Sie anschlie&#223;end erneut, die Bundles zu entfernen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: Das Bundle {0} wurde bereits gestoppt.
  </MsgText>
  <Explanation>
    Sie k&#246;nnen das Bundle nicht stoppen, weil es bereits gestoppt ist.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: Das Bundle {0} kann nicht gel&#246;scht werden, weil die folgenden Verbundbundlearchive (CBA, Composite Bundle Archive) vom Bundle {1} abh&#228;ngig sind.
  </MsgText>
  <Explanation>
    Ein Bundle kann nicht aus dem internen Bundle-Repository gel&#246;scht werden, wenn ein Verbundbundlearchiv (CBA, Composite Bundle Archive) von diesem Bundle abh&#228;ngig ist.
  </Explanation>
  <UserResponse>
    Zum L&#246;schen des Bundles m&#252;ssen Sie zuerst die aufgelisteten Verbundbundlearchive (CBA, Composite Bundle Archive) l&#246;schen. Anschlie&#223;end k&#246;nnen Sie das Bundle l&#246;schen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: Die erforderlichen Featurefunktionen f&#252;r Features wie das JPA2-Feature k&#246;nnen nicht abgerufen werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: Es wurde kein Service mit der Service-ID {0} gefunden.
  </MsgText>
  <Explanation>
    Die Service-ID, die mit dem Befehl angegeben wurde, stimmt mit keinem Service in der Registry &#252;berein.
  </Explanation>
  <UserResponse>
    Wiederholen Sie den Befehl mit einer g&#252;ltigen Service-ID.
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: Das Bundle {1} mit der Version {2}, das in der Datei {0} definiert ist, ist bereits im Repository vorhanden.
  </MsgText>
  <Explanation>
    Das Bundle kann dem Repository nicht hinzugef&#252;gt werden, da das Bundle bereits im Repository vorhanden ist.
  </Explanation>
  <UserResponse>
    Pr&#252;fen Sie, ob das Bundle im Repository das richtige ist. Wenn das Bundle im Repository nicht korrekt ist, entfernen Sie dieses Bundle aus dem Repository, bevor Sie das richtige Bundle hinzuf&#252;gen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: Der Parameter cuName wurde nicht angegeben, ist aber erforderlich.
  </MsgText>
  <Explanation>
    Der Befehl erfordert die Angabe des Parameters cuName.
  </Explanation>
  <UserResponse>
    Setzen Sie den Befehl erneut mit dem erforderlichen Parameter cuName ab.
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: Servicereferenzen im Inhalt des Verbundbundlearchivs (CBA, Composite Bundle Archive) {0} k&#246;nnen nicht aufgel&#246;st werden. Wenn diese Services von Bundles bereitgestellt werden, die nicht im Verbundbundlearchiv (CBA, Composite Bundle Archive) enthalten sind, m&#252;ssen Sie vom CBA importiert werden. Die folgenden Serviceabh&#228;ngigkeiten wurden nicht aufgel&#246;st: {1}
  </MsgText>
  <Explanation>
    Wenn ein Bundle in einem Verbundbundlearchiv (CBA, Composite Bundle Archive) einen Service verwendet, der nicht im Bundle enthalten ist oder von einem anderen Bundle im CBA exportiert wird, muss der Service vom CBA importiert werden.
  </Explanation>
  <UserResponse>
    Korrigieren Sie das Verbundmanifest COMPOSITEBUNDLE.MF so, dass das CBA alle Services importiert, die von Bundles im CBA verwendet werden und nicht im CBA verf&#252;gbar sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: Es ist ein interner Fehler auftreten. Das Implementierungsmanifest wurde nicht im EBA-Asset {0} gefunden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: Es ist ein interner Fehler aufgetreten. Die Metadaten f&#252;r die Bundles {0} konnten nicht aus dem internen Bundle-Repository entfernt werden. Au&#223;erdem konnten die Bundles {1} nicht aus dem Repository gel&#246;scht werden. Ausnahme: {2}
  </MsgText>
  <Explanation>
    Einige Bundles konnten nicht aus dem internen Bundle-Repository gel&#246;scht werden, und f&#252;r andere Bundles konnten die Metadaten nicht entfernt werden. Das System befindet sich m&#246;glicherweise gerade in einem inkonsistenten Status.
  </Explanation>
  <UserResponse>
    Verwerfen Sie die &#196;nderungen im aktuellen Arbeitsbereich, und versuchen Sie, die Bundles einzeln zu entfernen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: Das Bundle {0} wurde erfolgreich gestartet.
  </MsgText>
  <Explanation>
    Diese Nachricht ist nur zu Informationszwecken bestimmt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: Die Paketinformationen k&#246;nnen nicht abgerufen werden, weil Sie keine Verbindung zu einem Framework hergestellt haben.
  </MsgText>
  <Explanation>
    Sie sind derzeit nicht mit einem Framework verbunden.
  </Explanation>
  <UserResponse>
    Verwenden Sie den Befehl connect, um eine Verbindung zu einem Framework herzustellen. Mit dem Befehl list() k&#246;nnen Sie eine Liste der verf&#252;gbaren Frameworks abrufen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: Es ist ein interner Fehler aufgetreten. Der Launcher-Service kann nicht gestartet werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: Es wurde kein Bundle mit der Bundle-ID {0} gefunden.
  </MsgText>
  <Explanation>
    Die Bundle-ID die mit dem Befehl angegeben wurde, stimmt mit keinem Bundle im Framework &#252;berein.
  </Explanation>
  <UserResponse>
    Wiederholen Sie den Befehl mit einer g&#252;ltigen Bundle-ID.
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: Die angegebene Datei {0} enth&#228;lt kein g&#252;ltiges Bundlemanifest.
  </MsgText>
  <Explanation>
    Die angegebene Datei ist kein OSGi-Bundle.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen und korrigieren Sie das Bundlemanifest der angegebenen Datei.
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: Es ist ein interner Fehler aufgetreten. Ein Laufzeitservice ist nicht in der OSGi-Serviceregistry verf&#252;gbar: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: Das angegebene Asset {0} ist kein EBA-Asset.
  </MsgText>
  <Explanation>
    Das angegebene Asset ist kein EBA-Asset (Enterprise Bundle Archive, Unternehmensbundlearchiv).
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das angegebene Asset ein EBA-Asset ist.
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: Es ist ein interner Fehler aufgetreten. Die Metadaten f&#252;r die Bundles {0} konnten nicht aus dem internen Bundle-Repository entfernt werden. Ausnahme: {1}
  </MsgText>
  <Explanation>
    Die Bundles konnten nicht aus dem internen Bundle-Repository entfernt werden. Das System befindet sich m&#246;glicherweise gerade in einem inkonsistenten Status.
  </Explanation>
  <UserResponse>
    Verwerfen Sie die &#196;nderungen im aktuellen Arbeitsbereich, und versuchen Sie, die Bundles einzeln zu entfernen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: Das Bundle {0} ist bereits gestartet.
  </MsgText>
  <Explanation>
    Sie k&#246;nnen das Bundle nicht starten, weil es bereits gestartet ist.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: Der Servicefilter ist nicht g&#252;ltig: {0}.
  </MsgText>
  <Explanation>
    Der angegebene Servicefilter ist nicht g&#252;ltig.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass der Servicefilter g&#252;ltig ist, und wiederholen Sie anschlie&#223;end den Befehl.
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: Es ist ein interner Fehler aufgetreten. Der Repositorygeneratorservice ist &#252;ber die OSGi-Serviceregistry nicht verf&#252;gbar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: Die Serviceinformationen k&#246;nnen nicht abgerufen werden, weil Sie keine Verbindung zu einem Framework hergestellt haben.
  </MsgText>
  <Explanation>
    Sie sind derzeit nicht mit einem Framework verbunden.
  </Explanation>
  <UserResponse>
    Verwenden Sie den Befehl connect, um eine Verbindung zu einem Framework herzustellen. Mit dem Befehl list() k&#246;nnen Sie eine Liste der verf&#252;gbaren Frameworks abrufen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: Das bundle {0} im Verbundbundlearchiv {1} enth&#228;lt kein g&#252;ltiges Bundlemanifest.
  </MsgText>
  <Explanation>
    Die angegebene Datei ist kein OSGi-Bundle.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen und korrigieren Sie das Bundlemanifest der angegebenen Datei.
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: Das Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} ist nicht g&#252;ltig. Von Bundles im CBA importierte Pakete fehlen im Header Import-Package der CBA-Manifestdatei. Die folgenden Probleme wurden gemeldet: {1}
  </MsgText>
  <Explanation>
    Wenn ein Bundle in einem Verbundbundlearchiv (CBA, Composite Bundle Archive) ein Paket verwendet, das nicht im Bundle enthalten ist oder von einem anderen Bundle im CBA exportiert wird, muss das CBA das Paket importieren.
  </Explanation>
  <UserResponse>
    Korrigieren Sie das Verbundmanifest COMPOSITEBUNDLE.MF so, dass das CBA alle Pakete importiert, die von Bundles im CBA verwendet werden und nicht im CBA verf&#252;gbar sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: Die Verbindung ist nicht mehr verf&#252;gbar. &#220;berpr&#252;fen Sie die verf&#252;gbaren Verbindungen, und stellen Sie die Verbindungen ggf. wieder her.
  </MsgText>
  <Explanation>
    Das Framework, mit dem Sie verbunden waren, ist nicht mehr verf&#252;gbar. M&#246;glicherweise wurde eine Anwendung gestoppt.
  </Explanation>
  <UserResponse>
    Pr&#252;fen Sie, ob das Framework noch verf&#252;gbar ist, und stellen Sie die Verbindung ggf. wieder her.
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: Die Zeichenfolge {0} hat nicht die erforderliche Syntax symbolischerName;Version.
  </MsgText>
  <Explanation>
    Die in der Liste der zu entfernenden Bundles angegebene Zeichenfolge konnte nicht verarbeitet werden, weil sie nicht die korrekte Syntax hat.
  </Explanation>
  <UserResponse>
    Korrigieren Sie die Syntax der angegebenen Zeichenfolge.
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: Die Headerinformationen k&#246;nnen nicht abgerufen werden, weil Sie keine Verbindung zu einem Framework hergestellt haben.
  </MsgText>
  <Explanation>
    Sie sind derzeit nicht mit einem Framework verbunden.
  </Explanation>
  <UserResponse>
    Verwenden Sie den Befehl connect, um eine Verbindung zu einem Framework herzustellen. Mit dem Befehl list() k&#246;nnen Sie eine Liste der verf&#252;gbaren Frameworks abrufen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: Es wurde kein Paket mit dem Paketnamen {0} gefunden.
  </MsgText>
  <Explanation>
    Der mit dem Befehl angegebene Paketname stimmt mit keinem der Pakete im Framework &#252;berein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass der Paketname g&#252;ltig ist, und wiederholen Sie anschlie&#223;end den Befehl.
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: Das angegebene Bundle {0} mit der Version {1} ist nicht im lokalen Bundle-Repository vorhanden.
  </MsgText>
  <Explanation>
    Das Bundle kann nicht angezeigt bzw. gel&#246;scht werden, da kein Bundle mit diesem Namen vorhanden ist.
  </Explanation>
  <UserResponse>
    Pr&#252;fen und korrigieren Sie die Version bzw. den symbolischen Namen des Bundles.
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: Die Bundleinformationen k&#246;nnen nicht abgerufen werden, weil Sie keine Verbindung zu einem Framework hergestellt haben.
  </MsgText>
  <Explanation>
    Sie sind derzeit nicht mit einem Framework verbunden.
  </Explanation>
  <UserResponse>
    Verwenden Sie den Befehl connect, um eine Verbindung zu einem Framework herzustellen. Mit dem Befehl list() k&#246;nnen Sie eine Liste der verf&#252;gbaren Frameworks abrufen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: Das Bundle-Repository {0} ist nicht vorhanden.
  </MsgText>
  <Explanation>
    Es wurde versucht, das Bundle-Repository zu &#228;ndern, aber es ist nicht vorhanden.
  </Explanation>
  <UserResponse>
    Erstellen Sie das Bundle-Repository.
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: Die angegebene Datei {0} kann nicht als Manifestdatei geparst werden, weil die folgende Ausnahme eingetreten ist: {1}
  </MsgText>
  <Explanation>
    Die angegebene Datei scheint keine g&#252;ltige Manifestdatei zu sein.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass die angegebene Datei eine g&#252;ltige Manifestdatei ist.
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: Es wurde kein Paket mit der Position {0} gefunden.
  </MsgText>
  <Explanation>
    Die mit dem Befehl angegebene Paketposition stimmt mit keiner der Paketpositionen im Framework &#252;berein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Paketposition g&#252;ltig ist, und wiederholen Sie anschlie&#223;end den Befehl.
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      OSGi-Anwendungskonsole
 
 Anzeigebefehle: Diese Befehle funktionieren nur, wenn eine Verbund zu einem Framework existiert.
 
     ss()                - Dieser Befehl zeigt &#220;bersichtsdaten zu den installierten Bundles an.
     bundles()           - Dieser Befehl zeigt umfassende Informationen zu den installierten Bundles an. 
     packages()          - Dieser Befehl zeigt Informationen zu den importierten/exportierten Bundles an. 
     services()          - Dieser Befehl zeigt Informationen zu den registrierten Services an. 
 
     bundle(&lt;Bundle-ID&gt;)  - Dieser Befehl zeigt Informationen zum angegebenen Bundle an.
     headers(&lt;Bundle-ID&gt;) - Dieser Befehl zeigt Informationen zu den Headern an, die dem angegebenen Bundle zugeordnet sind.
     packages(&lt;Bundle-ID&gt;) - Dieser Befehl zeigt Informationen zu den exportierten Paketen f&#252;r dieses Bundle an.
     packages(&lt;Paketname&gt;) - Dieser Befehl zeigt Informationen zum angegebenen Paket an.
     services(&lt;Service-ID&gt;) - Dieser Befehl zeigt Informationen zum angegebenen Service an.
     services(&lt;OSGI-Filter&gt;) - Dieser Befehl zeigt Informationen zu den Services an, die dem Filter entsprechen.
 
     refresh() - Dieser Befehl aktualisiert den internen Cache der OSGi-Anwendungskonsole mit den neuesten Informationen zum Status des Frameworks.
 
 Framework-Befehle:
 
     list() - Dieser Befehl listet die verf&#252;gbaren Frameworks auf, zu denen Sie eine Verbindung herstellen k&#246;nnen.
     connect(&lt;Framework-ID&gt;) - Dieser Befehl stellt eine Verbindung zum angegebenen Framework her.
     connect(&lt;Bundlename&gt;, &lt;Bundleversion&gt;, &lt;Knotenname&gt;, &lt;Servername&gt;) - Dieser Befehl stellt eine Verbindung zum angegebenen Framework her.
 
 Steuerbundles:
 
     start(&lt;Bundle-ID&gt;) - Dieser Befehl startet das angeforderte Bundle.
     stop(&lt;Bundle-ID&gt;   - Dieser Befehl stoppt das angeforderte Bundle.
  </MsgText>
  <Explanation>
    Ohne.
  </Explanation>
  <UserResponse>
    Ohne.
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: Die angegebene Datei {0} ist weder eine JAR-Datei noch ein Verbundbundlearchiv (CBA, Composite Bundle Archive).
  </MsgText>
  <Explanation>
    Der Name der angegebenen Datei endet weder mit der Dateierweiterung .jar noch mit der Dateierweiterung .cba.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen und korrigieren Sie den Namen der angegebenen Datei. Die angegebene Datei muss eine g&#252;ltige JAR- bzw. CBA-Datei (Composite Bundle Archive, Verbundbundlearchiv) sein.
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: Es wurde kein Paket mit der Paket-ID {0} gefunden.
  </MsgText>
  <Explanation>
    Die mit dem Befehl angegebene Paket-ID stimmt mit keinem der Pakete im Framework &#252;berein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Paket-ID g&#252;ltig ist, und wiederholen Sie anschlie&#223;end den Befehl.
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: Der Header CompositeBundle-Content im Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} darf nur Bundles mit der exakten Version enthalten. Die folgenden Eintr&#228;ge sind nicht g&#252;ltig: {1}.
  </MsgText>
  <Explanation>
    Ein CompositeBundle-Content-Eintrag muss ein Format wie &apos;bundle.name;version=&quot;[1.0.0,1.0.0]&quot;&apos; verwenden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass Eintr&#228;ge im Header CompositeBundle-Content der Manifestdatei f&#252;r Verbundbundles eine exakte Version angeben und das richtige Format haben.
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: Das Verbundbundlearchiv {0} kann nicht installiert werden, weil die folgenden Exportpakete von den Paketen abweichen, die im Verbundbundlearchiv (CBA, Composite Bundle Archive) {1} enthalten sind.
  </MsgText>
  <Explanation>
    Ein Verbundbundlearchiv (CBA, Composite Bundle Archive) kann nur Pakete exportieren, die auch von den im Verbundbundlearchiv enthaltenen Bundles exportiert werden k&#246;nnen. Die Attribute und Anweisungen m&#252;ssen ebenfalls &#252;bereinstimmen.
  </Explanation>
  <UserResponse>
    Korrigieren Sie das Verbundmanifest COMPOSITEBUNDLE.MF so, dass es Pakete exportiert, die auch von den im Verbundbundlearchiv (CBA, Composite Bundle Archive) enthaltenen Bundles exportiert werden.
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: Die Funktionalit&#228;t f&#252;r die Erweiterung von Anwendungen ist f&#252;r diese Kompositionseinheit nicht verf&#252;gbar, weil die Kompositionseinheit auf den folgenden Zielen implementiert ist, die die Erweiterung von Anwendungen nicht unterst&#252;tzen: {0}
  </MsgText>
  <Explanation>
    Einige der Ziele, auf denen die Kompositionseinheit implementiert ist, unterst&#252;tzen die Funktionalit&#228;t f&#252;r die Erweiterung von Anwendungen nicht.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Kompositionseinheit, der Sie Erweiterungen hinzuf&#252;gen m&#246;chten, auf Zielen implementiert ist, die die Funktionalit&#228;t f&#252;r die Erweiterung von Anwendungen unterst&#252;tzen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: Das Bundle {0} kann nicht gestoppt werden. Es hat derzeit den Status {1}.
  </MsgText>
  <Explanation>
    Das Bundle kann nicht gestoppt werden.
  </Explanation>
  <UserResponse>
    Suchen Sie in den begleitenden Fehlernachrichten nach Informationen zu den Ursachen f&#252;r das Fehlschlagen des Bundlestopps.
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: Der Parameter {0} wurde nicht angegeben, ist aber f&#252;r den Befehl {1} erforderlich.
  </MsgText>
  <Explanation>
    Dieser Befehl erfordert den angegebenen Parameter.
  </Explanation>
  <UserResponse>
    Wiederholen Sie den Befehl mit Angabe des erforderlichen Parameters.
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: Die g&#252;ltigen Frameworks sind:
  </MsgText>
  <Explanation>
    Diese Nachricht ist nur zu Informationszwecken bestimmt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: Die folgenden Bundles, die das Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} erfordert, wurden nicht im internen Bundle-Repository {1} gefunden.
  </MsgText>
  <Explanation>
    Das Verbundbundlearchiv (CBA, Composite Bundle Archive) kann nur implementiert werden, wenn alle Abh&#228;ngigkeiten im internen Bundle-Repository enthalten sind.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Abh&#228;ngigkeiten des Verbundbundlearchivs im Verbundbundlearchiv enthalten bzw. im internen Bundle-Repository installiert sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: Beim Hinzuf&#252;gen einer Erweiterung zur Kompositionseinheit {0} ist ein Aufl&#246;sungsproblem aufgetreten. Ausnahme: {1}
  </MsgText>
  <Explanation>
    Das System kann die ausgew&#228;hlte Erweiterung in Kombination mit der aktuellen Implementierung des Assets nicht aufl&#246;sen. Bundles weisen m&#246;glicherweise fehlende Abh&#228;ngigkeiten auf, sind inkompatibel oder sind nicht vorhanden.
  </Explanation>
  <UserResponse>
    Untersuchen Sie den Fehler. Nehmen Sie alle erforderlichen &#196;nderungen am Asset und an der Erweiterung vor, und wenden Sie anschlie&#223;end die Erweiterung erneut an.
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: Das Bundle-Repository unter {0} ist bereits mit dem Namen {1} definiert.
  </MsgText>
  <Explanation>
    Es wurde versucht, ein neues Bundle-Repository zu definieren, aber der angegebene URL wird bereits von einem anderen Bundle-Repository verwendet.
  </Explanation>
  <UserResponse>
    Geben Sie einen anderen URL an.
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: Es ist ein interner Fehler aufgetreten. Es wurde versucht, ein AriesApplicationModel-Objekt aus einem nicht dateibasierten URL {0} zu generieren.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: Das EBA-Asset {0} wurde nicht gefunden.
  </MsgText>
  <Explanation>
    Sie haben ein Implementierungsmanifest in ein Asset importiert, aber das EBA-Asset (Enterprise Bundle Archive, Unternehmensbundlearchiv) ist nicht vorhanden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das EBA-Asset installiert ist.
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: Das Bundle {0} wird gestoppt.
  </MsgText>
  <Explanation>
    Diese Nachricht ist nur zu Informationszwecken bestimmt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: Beim Entfernen einer Erweiterung aus der Kompositionseinheit {0} ist ein Aufl&#246;sungsproblem aufgetreten. Ausnahme: {1}
  </MsgText>
  <Explanation>
    Das System kann die ausgew&#228;hlte Erweiterung in Kombination mit der aktuellen Implementierung des Assets nicht aufl&#246;sen. Bundles weisen m&#246;glicherweise fehlende Abh&#228;ngigkeiten auf, sind inkompatibel oder sind nicht vorhanden.
  </Explanation>
  <UserResponse>
    Untersuchen Sie den Fehler. Nehmen Sie alle erforderlichen &#196;nderungen am Asset vor, und entfernen Sie anschlie&#223;end die Erweiterung gemeinsam mit allen anderen voneinander abh&#228;ngigen Erweiterungen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: Das zu importierende Implementierungsmanifest ist f&#252;r das Asset {0} nicht g&#252;ltig, weil es die im Anwendungsmanifest definierten Voraussetzungen nicht erf&#252;llt.
  </MsgText>
  <Explanation>
    Das Implementierungsmanifest DEPLOYMENT.MF ist mit dem Anwendungsmanifest APPLICATION.MF des Assets nicht kompatibel.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen Sie das neue Implementierungsmanifest auf Folgendes:
   1. Die Eintr&#228;ge Application-SymbolicName und Application-Version in der Datei DEPLOYMENT.MF m&#252;ssen mit den entsprechenden Eintr&#228;gen in der Datei APPLICATION.MF &#252;bereinstimmen.
   2. Die im Header Deployed-Content in der Datei DEPLOYMENT.MF aufgelisteten Bundles m&#252;ssen mit den im Header Application-Content in der Datei APPLICATION.MF aufgelisteten Bundles &#252;bereinstimmen.
   3. Die Bundleversion im Header Deployed-Content in der Datei DEPLOYMENT.MF muss innerhalb des g&#252;ltigen Versionsbereichs f&#252;r das entsprechende Bundle in der Datei APPLICATION.MF liegen.
   4. Die im Header Deployed-Use-Bundle in der Datei DEPLOYMENT.MF aufgelisteten Bundles m&#252;ssen auch im Header Use-Bundle in der Datei APPLICATION.MF aufgelistet sein.
   5. Die Bundleversion im Header Deployed-Use-Bundle in der Datei DEPLOYMENT.MF muss innerhalb des g&#252;ltigen Versionsbereichs f&#252;r das entsprechende Bundle im Header Use-Bundle in der Datei APPLICATION.MF liegen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: Das Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} weist eine Implementierungsabh&#228;ngigkeit von einem anderen Verbundbundlearchiv ({1}) auf.
  </MsgText>
  <Explanation>
    Die Verschachtelung von Verbundbundlearchiv (CBA, Composite Bundle Archive) wird nicht unterst&#252;tzt.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das Verbundbundlearchiv (CBA, Composite Bundle Archive) ausschlie&#223;lich von Bundles abh&#228;ngig ist, die im Header CompositeBundle-Content des Manifests des Verbundbundlearchivs angegeben sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: Es kann keine Verbindung zu einem Framework mit dem Framework-Namen {0}, dem Knotennamen {1} und dem Servernamen {2} hergestellt werden.
  </MsgText>
  <Explanation>
    Es wurde kein Framework mit den angegebenen Attributen gefunden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Framework-Attribute g&#252;ltig sind, und wiederholen Sie anschlie&#223;end den Befehl.
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: Es ist bereits ein Bundle-Repository mit dem Namen {0} vorhanden.
  </MsgText>
  <Explanation>
    Es wurde versucht, ein neues Bundle-Repository zu definieren, aber der angegebene Name ist bereits im Gebrauch.
  </Explanation>
  <UserResponse>
    Geben Sie einen anderen Namen an.
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: Es ist nicht m&#246;glich, die Aries-Anwendung {0} zu modellieren, da einige der erforderlichen Komponenten der Anwendung noch heruntergeladen werden.
  </MsgText>
  <Explanation>
    Mindestens ein Bundle, das die Anwendung ben&#246;tigt, wird gerade heruntergeladen. Die Anwendung kann erst modelliert werden, wenn alle Downloads abgeschlossen ist.
  </Explanation>
  <UserResponse>
    Warten Sie, bis alle erforderlichen Bundles heruntergeladen wurden, und wiederholen Sie anschlie&#223;end die Operation.
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: Es k&#246;nnen keine Erweiterungen hinzugef&#252;gt werden, weil die Kompositionseinheit auf den folgenden Zielen implementiert ist, die die Anwendungserweiterung nicht unterst&#252;tzen: {0}
  </MsgText>
  <Explanation>
    Einige der Ziele, auf denen die Kompositionseinheit implementiert ist, unterst&#252;tzen die Funktionalit&#228;t f&#252;r die Erweiterung von Anwendungen nicht.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Kompositionseinheit, der Sie Erweiterungen hinzuf&#252;gen m&#246;chten, auf Zielen implementiert ist, die die Funktionalit&#228;t f&#252;r die Erweiterung von Anwendungen unterst&#252;tzen.
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: Die Verzeichnisstruktur {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Das Verzeichnis kann nicht erstellt werden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass Speicherplatz vorhanden ist und das Produkt die erforderlichen Berechtigungen zum Erstellen des Verzeichnisses besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: Der symbolische Name {0} und die Version {1} entsprechen keiner vorhandenen Erweiterung.
  </MsgText>
  <Explanation>
    Es sind keine Erweiterungen in der Kompositionseinheit vorhanden, die dem angegebenen symbolischen Namen und der vom Benutzer angegebenen Version entsprechen.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: Das Bundle {0} kann nicht gestartet werden. Es hat derzeit den Status {1}.
  </MsgText>
  <Explanation>
    Das Bundle kann nicht gestartet werden.
  </Explanation>
  <UserResponse>
    Suchen Sie in den begleitenden Fehlernachrichten nach Informationen zu den Ursachen f&#252;r das Fehlschlagen des Bundlestarts.
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: Das zu importierende Implementierungsmanifest kann nicht aufgel&#246;st werden. Die folgenden Voraussetzungen sind nicht erf&#252;llt: {0}
  </MsgText>
  <Explanation>
    Das zu importierende Implementierungsmanifest DEPLOYMENT.MF hat eine Voraussetzung, die nicht erf&#252;llt werden kann.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das neue Implementierungsmanifest vollst&#228;ndig ist und die Bundles enth&#228;lt, die zum Aufl&#246;sen des EBA-Assets (Enterprise Bundle Archive, Unternehmensbundlearchiv) erforderlich sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: Bei der Verarbeitung des Manifests f&#252;r das Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} ist ein Problem aufgetreten.
  </MsgText>
  <Explanation>
    Entweder ist das Manifest nicht vorhanden, oder der Name bzw. das Format ist nicht korrekt.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das Manifest vorhanden ist und ein g&#252;ltiges Format und einen g&#252;ltigen Namen hat.
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: Es kann keine Verbindung zu einem Framework mit der ID {0} hergestellt werden.
  </MsgText>
  <Explanation>
    Es wurde kein Framework mit der angegebenen ID gefunden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Framework-ID g&#252;ltig ist, und wiederholen Sie anschlie&#223;end den Befehl.
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: Das Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} exportiert Services, die von den im CBA enthaltenen Bundles nicht bereitgestellt werden. Diese Services stehen Bundles au&#223;erhalb des CBA nicht zur Verf&#252;gung. Die folgenden Probleme wurden gemeldet: {1}
  </MsgText>
  <Explanation>
    Ein Das Verbundbundlearchiv (CBA, Composite Bundle Archive) kann keine Services exportieren, f&#252;r die es keine Blueprint-Deklaration bzw. keinen Header Bundle-ExportService: in einem der Bundles im CBA gibt.
  </Explanation>
  <UserResponse>
    F&#252;gen Sie dem CBA-Inhalt die fehlenden Blueprint-Servicedeklarationen hinzu, oder entfernen Sie die Details der nicht erf&#252;llten Exporte aus dem Verbundmanifest COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: Der Namensparameter wurde nicht angegeben, ist aber erforderlich.
  </MsgText>
  <Explanation>
    Der Befehl erfordert die Angabe des Namensparameters.
  </Explanation>
  <UserResponse>
    Setzen Sie den Befehl erneut ab, und geben Sie den Namen an.
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: Der URL-Parameter wurde nicht angegeben, ist aber erforderlich.
  </MsgText>
  <Explanation>
    Der URL-Parameter ist f&#252;r den Befehl addExternalBundleRepository erforderlich.
  </Explanation>
  <UserResponse>
    Setzen Sie den Befehl erneut ab, und geben Sie dabei den URL des externen Bundle-Repositorys an.
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: Die Verzeichnisstruktur {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Sie haben versucht, ein Implementierungsmanifest in ein Verzeichnis zu exportieren, das nicht vorhanden ist, und die Verzeichnisstruktur kann nicht erstellt werden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass Speicherplatz vorhanden ist und das Produkt die erforderlichen Berechtigungen zum Erstellen des Verzeichnisses besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: Der symbolische Name {0} und die Version {1} entsprechen keiner verf&#252;gbaren Erweiterung in einem verf&#252;gbaren Bundle-Repository.
  </MsgText>
  <Explanation>
    In keinem der der Umgebung zur Verf&#252;gung stehenden Repositorys ist ein Verbundbundle mit dem angegebenen symbolischen Namen und der angegebenen Version verf&#252;gbar.
  </Explanation>
  <UserResponse>
    F&#252;gen Sie das Verbundbundle einem verf&#252;gbaren Repository hinzu, oder w&#228;hlen Sie ein anderes Verbundbundle aus, das Sie als Erweiterung hinzuf&#252;gen m&#246;chten.
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: Das Bundle {0} wird gestartet.
  </MsgText>
  <Explanation>
    Diese Nachricht ist nur zu Informationszwecken bestimmt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: Es ist ein interner Fehler aufgetreten. Der Aufl&#246;sungsprozess generiert keine Liste zu installierender Bundles.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: Die Verbindung zum Framework {0} wurde erfolgreich hergestellt.
  </MsgText>
  <Explanation>
    Diese Nachricht ist nur zu Informationszwecken bestimmt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: Beim Extrahieren des Bundles {0} aus dem Verbundbundlearchiv (CBA, Composite Bundle Archive) {1} ist ein interner Fehler aufgetreten.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: Der Namensparameter wurde nicht angegeben, ist aber erforderlich.
  </MsgText>
  <Explanation>
    Der Namensparameter ist f&#252;r den Befehl addExternalBundleRepository erforderlich.
  </Explanation>
  <UserResponse>
    Setzen Sie den Befehl erneut ab, und geben Sie dabei den Namen des externen Bundle-Repositorys an.
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: Die Erweiterung mit dem symbolischen Namen {0} und der Version {1} wurde der Kompositionseinheit bereits hinzugef&#252;gt.
  </MsgText>
  <Explanation>
    Diese Erweiterung ist bereits in der Kompositionseinheit enthalten.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: Der Inhalt des Implementierungsmanifests ist nicht g&#252;ltig. Die folgenden Bundles sind redundant: {0}.
  </MsgText>
  <Explanation>
    Das zu importierende Implementierungsmanifest DEPLOYMENT.MF enth&#228;lt Bundles, die zum Aufl&#246;sen des EBA-Assets (Enterprise Bundle Archive, Unternehmensbundlearchiv) nicht erforderlich sind.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das neue Implementierungsmanifest keine Bundles enth&#228;lt, die in der Nachricht aufgelistet sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: Es wird eine Verbindung zum Framework {0} auf dem Knoten {1} und dem Server {2} hergestellt.
  </MsgText>
  <Explanation>
    Sie stellen momentan eine Verbindung zum Framework her.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: Es ist ein interner Fehler aufgetreten. Es wurde versucht, ein AriesApplicationModel-Objekt aus einem leeren Implementierungsmanifest zu generieren.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: Der Parameter version wurde nicht angegeben, ist aber erforderlich.
  </MsgText>
  <Explanation>
    Der Befehl erfordert die Angabe des Parameters version.
  </Explanation>
  <UserResponse>
    Setzen Sie den Befehl erneut mit dem erforderlichen Parameter version ab.
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: Der Inhalt des Implementierungsmanifests ist nicht g&#252;ltig. Die folgenden zus&#228;tzlichen Bundles sind erforderlich: {0}
  </MsgText>
  <Explanation>
    Das zu importierende Implementierungsmanifest DEPLOYMENT.MF enth&#228;lt nicht alle Bundles, die zum Aufl&#246;sen des EBA-Assets (Enterprise Bundle Archive, Unternehmensbundlearchiv) erforderlich sind.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das neue Implementierungsmanifest alle Bundles enth&#228;lt, die in der Nachricht aufgelistet sind.
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: Das Bundle {0} wurde erfolgreich gestoppt.
  </MsgText>
  <Explanation>
    Diese Nachricht ist nur zu Informationszwecken bestimmt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: Es ist ein interner Fehler aufgetreten. Es wurde versucht, ein AriesApplicationModel-Objekt aus einem leeren Anwendungsmanifest zu generieren.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
