<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAO0006E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_REMOVE_CONFIG_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_REMOVE_CONFIG_REPOSITORY_EXCEPTION=CWSAO0006E: Es ist ein interner Fehler aufgetreten. Das konfigurierte Repository mit dem URL {0} kann nicht aus dem RepositoryAdmin-Service entfernt werden. Ausnahme: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0001E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAO0001E: Es ist ein interner Fehler aufgetreten. Die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} kann nicht bereitgestellt werden, weil der Service {1} nicht verf&#252;gbar ist.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0014E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_LOCATE_RESOURCE" varFormat="Java">
    RESOLVER_UNABLE_TO_LOCATE_RESOURCE=CWSAO0014E: Die Ressource mit dem symbolischen Namen {0} und der Version {1} wurde nicht im Repository gefunden.
  </MsgText>
  <Explanation>
    Die Laufzeitumgebung hat versucht, eine Anwendung oder use-bundle-Inhalt zu identifizieren, konnte sie bzw. ihn aber nicht in den Bundle-Repositorys finden. Dieser Fehler ist gew&#246;hnlich darauf zur&#252;ckzuf&#252;hren, dass der Inhalt aus dem Repository entfernt wurde. Das bedeutet, dass die Anwendung nicht aufgel&#246;st werden kann.
  </Explanation>
  <UserResponse>
    F&#252;gen Sie das fehlende Bundle einem konfigurierten Bundle-Repository hinzu.
  </UserResponse>
</Message>
<Message ID="CWSAO0013W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_WARNING" varFormat="Java">
    RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_WARNING=CWSAO0013W: Das konfigurierte Bundle-Repository mit dem URL {0} kann dem Resolver nicht hinzugef&#252;gt werden. Ausnahme: {1}
  </MsgText>
  <Explanation>
    Ein Bundle-Repository konnte dem Resolver nicht hinzugef&#252;gt werden. Dieser Fehler ist h&#228;ufig darauf zur&#252;ckzuf&#252;hren, dass der Repository-URL nicht g&#252;ltig ist.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass der URL f&#252;r das Bundle-Repository g&#252;ltig ist und dass das Bundle-Repository ordnungsgem&#228;&#223; formatiert ist.
  </UserResponse>
</Message>
<Message ID="CWSAO0002E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_IOEXCEPTION" varFormat="Java">
    RESOLVER_IOEXCEPTION=CWSAO0002E: Es ist ein interner Fehler aufgetreten. Das EBA-Archiv {0} kann nicht bereitgestellt werden, da die lokale Repositorydatei {1} nicht erstellt werden kann.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0004E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_ADD_CONFIG_REPOSITORY_EXCEPTION=CWSAO0004E: Es ist ein interner Fehler aufgetreten. Das konfigurierte Repository mit dem URL {0} kann dem RepositoryAdmin-Service nicht hinzugef&#252;gt werden. Ausnahme: {1}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0003E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_ADD_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_ADD_REPOSITORY_EXCEPTION=CWSAO0003E: Es ist ein interner Fehler aufgetreten. Bei der Bereitstellung des EBA-Archivs {0} konnte das Repository {1} dem RepositoryAdmin-Service nicht hinzugef&#252;gt werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0007E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_RESOLVE" varFormat="Java">
    RESOLVER_UNABLE_TO_RESOLVE=CWSAO0007E: Das System kann das EBA (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} nicht bereitstellen, da die folgenden Probleme in der Abh&#228;ngigkeitskette gefunden wurden: {1}
  </MsgText>
  <Explanation>
    Es ist nicht m&#246;glich, den vollst&#228;nden Satz an Abh&#228;ngigkeiten f&#252;r ein EBA (Enterprise Bundle Archive, Unternehmensbundlearchiv) aufzul&#246;sen.
  </Explanation>
  <UserResponse>
    Suchen Sie in den Begleitnachrichten nach Informationen zu den Abh&#228;ngigkeiten, die nicht bereitgestellt werden k&#246;nnen. Beheben Sie die Probleme, installieren Sie das EBA erneut, und wiederholen Sie die Operation.
  </UserResponse>
</Message>
<Message ID="CWSAO0005E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_TO_REMOVE_REPOSITORY_EXCEPTION" varFormat="Java">
    RESOLVER_UNABLE_TO_REMOVE_REPOSITORY_EXCEPTION=CWSAO0005E: Es ist ein interner Fehler aufgetreten. Bei der Bereitstellung des EBA-Archivs {0} kann das Repository {1} nicht aus dem RepositoryAdmin-Service entfernt werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAO0008E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_UNABLE_HANDLE_FRAGMENT_HOST_WITH_EXTENSION" varFormat="Java">
    RESOLVER_UNABLE_HANDLE_FRAGMENT_HOST_WITH_EXTENSION=CWSAO0008E: Der Fragment-Host {0} kann nicht zugeordnet werden, da er eine Erweiterungsanweisung hat.
  </MsgText>
  <Explanation>
    Die Zuordnung eines Fragments, das eine definierte Erweiterungsanweisung hat, ist nicht m&#246;glich. Anwendungen d&#252;rfen diese Anweisung nicht definieren. Die Erweiterungsanweisung gilt nur, wenn der Fragment-Host das Systembundle ist.
  </Explanation>
  <UserResponse>
    Entfernen Sie die Erweiterungsanweisung aus der Anwendung.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
