<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: Bei der Aufl&#246;sung des Assets {0} wurden ung&#252;ltige Abh&#228;ngigkeiten gemeinsam genutzter Inhalte im Anwendungsinhalt gefunden: {1}
  </MsgText>
  <Explanation>
    Anwendungsbundles k&#246;nnen keine Pakete oder Services f&#252;r gemeinsam genutzte Bundles bereitstellen. Au&#223;erdem ist es nicht zul&#228;ssig, Bundles sowohl als gemeinsam genutzte Bundles als auch als Anwendungsbundles zu implementieren. Implementierungen, die Anwendungsbundles abh&#228;ngige gemeinsam genutzte Bundles erfordern, sind nicht g&#252;ltig.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass alle ung&#252;ltigen gemeinsam genutzten Bundles von der Anwendung ben&#246;tigt werden. Wenn ja, stellen Sie sicher, dass diese nicht vom Anwendungsinhalt abh&#228;ngig sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: Das Bundlemanifest f&#252;r die JAR-Datei {0} in der EBA-Datei {1} kann nicht gelesen werden.
  </MsgText>
  <Explanation>
    Es ist eine Ausnahme des Typs IOException beim Suchen des Manifests einer JAR-Datei in einer migrierten EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) aufgetreten. Die Datei kann besch&#228;digt oder nicht lesbar sein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Datei die erforderlichen Berechtigungen und das richtige Format besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: Es ist ein interner Fehler aufgetreten. Der Bereitstellungsservice {0} ist nicht verf&#252;gbar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: Die in der Kompositionseinheit {0} in der Gesch&#228;ftsanwendung {1} implementierte OSGi-Anwendung wurde nicht gestartet.
  </MsgText>
  <Explanation>
    W&#228;hrend der Startoperation ist eine Ausnahme eingetreten.
  </Explanation>
  <UserResponse>
    Untersuchen Sie f&#252;r eine genauere Problemdiagnose die Serverprotokolle, die vor dieser Ausnahme erstellt wurden.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: Die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {1} enth&#228;lt das Verzeichnis {0}, das nicht unterst&#252;tzt wird.
  </MsgText>
  <Explanation>
    Das angegebene Unternehmensbundlearchiv enth&#228;lt ein Verzeichnis mit dem Namen byValue oder byReference. Keiner dieser Verzeichnisnamen wird im Stammverzeichnis einer EBA-Datei unterst&#252;tzt.
  </Explanation>
  <UserResponse>
    Entfernen oder benennen Sie das entsprechende Verzeichnis um.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: Die angegebene Rolle {0} ist nicht vorhanden.
  </MsgText>
  <Explanation>
    Es wurde versucht, Benutzer oder Gruppen einer Sicherheitsrolle zuzuordnen, die nicht vorhanden ist.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die angegebene Sicherheitsrolle vorhanden ist, oder erstellen Sie die Rolle in der Anwendung.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: Das zu importierende Implementierungsmanifest ist f&#252;r das Asset {0} nicht g&#252;ltig, weil es die im Anwendungsmanifest definierten Voraussetzungen nicht erf&#252;llt.
  </MsgText>
  <Explanation>
    Das Implementierungsmanifest DEPLOYMENT.MF ist mit dem Anwendungsmanifest APPLICATION.MF des Assets nicht kompatibel.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen Sie das neue Implementierungsmanifest auf Folgendes:
   1. Die Eintr&#228;ge Application-SymbolicName und Application-Version in der Datei DEPLOYMENT.MF m&#252;ssen mit den entsprechenden Eintr&#228;gen in der Datei APPLICATION.MF &#252;bereinstimmen.
   2. Die im Header Deployed-Content in der Datei DEPLOYMENT.MF aufgelisteten Bundles m&#252;ssen mit den im Header Application-Content in der Datei APPLICATION.MF aufgelisteten Bundles &#252;bereinstimmen.
   3. Die Bundleversion im Header Deployed-Content in der Datei DEPLOYMENT.MF muss innerhalb des g&#252;ltigen Versionsbereichs f&#252;r das entsprechende Bundle in der Datei APPLICATION.MF liegen.
   4. Die im Header Deployed-Use-Bundle in der Datei DEPLOYMENT.MF aufgelisteten Bundles m&#252;ssen auch im Header Use-Bundle in der Datei APPLICATION.MF aufgelistet sein.
   5. Die Bundleversion im Header Deployed-Use-Bundle in der Datei DEPLOYMENT.MF muss innerhalb des g&#252;ltigen Versionsbereichs f&#252;r das entsprechende Bundle im Header Use-Bundle in der Datei APPLICATION.MF liegen.
 Editieren Sie das Implementierungsmanifest nicht manuell. Entfernen Sie gegebenenfalls das Implementierungsmanifest aus dem Unternehmensbundlearchiv. Dies bewirkt, dass beim Import des Unternehmensbundlearchivs eine neue Implementierungsmanifestdatei generiert wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: Die ausgew&#228;hlten Bundleversionen k&#246;nnen nicht aufgel&#246;st werden und sind nicht kompatibel.
  </MsgText>
  <Explanation>
    Das System kann die ausgew&#228;hlten Bundleversionen nicht aufl&#246;sen. Die Bundles weisen m&#246;glicherweise fehlende Abh&#228;ngigkeiten auf, sind inkompatibel oder sind nicht vorhanden.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die ausgew&#228;hlte Gruppe von Eingabebundles, und wiederholen Sie die Operation. Sie k&#246;nnen die Administrationskonsole verwenden, um den Status des Assets anzuzeigen bzw. voranzuzeigen.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: Der Benutzer {0} ist kein zugeordneter Benutzer bzw. kein Member einer zugeordneten Gruppe f&#252;r die Rolle {1}.
  </MsgText>
  <Explanation>
    Jeder angegebene Benutzer muss entweder ein der Sicherheitsrolle zugeordneter Benutzer oder Mitglied einer der Sicherheitsrolle zugeordneten Gruppe sein. Der angegebene Benutzer erf&#252;llt keine dieser Voraussetzungen.
  </Explanation>
  <UserResponse>
    Konfigurieren Sie die Zuordnungen von Sicherheitsrollen zu Benutzern/Gruppen, um den angegebenen Benutzer f&#252;r die angegebene Rolle zuzulassen, oder geben Sie einen anderen Benutzer an, der die erforderlichen Berechtigungen bereits besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: Die Anwendung {0} enth&#228;lt mindestens ein Verbundbundlearchiv (CBA, Composite Bundle Archives) {1} im Application-Content. Dies wird in WebSphere Application Server Version 7 OSGi Applications Feature Pack nicht unterst&#252;tzt.
  </MsgText>
  <Explanation>
    CBAs werden in Application-Content f&#252;r WebSphere Application Server Version 8 und h&#246;her unterst&#252;tzt.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich. Wenn die Anwendung in WebSphere Application Server Version 7 OSGi Applications Feature Pack ausgef&#252;hrt werden muss, schreiben Sie die Anwendung so um, dass in Application-Content keine CBAs enthalten sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: Beim Lesen der Anwendungsmanifestdatei des Unternehmensbundlearchivs (EBA, Enterprise Bundle Archive) ist eine E/A-Ausnahme eingetreten: {0}. Die Datei kann ung&#252;ltig, besch&#228;digt oder nicht lesbar sein.
  </MsgText>
  <Explanation>
    Es ist eine Ausnahme des Typs IOException beim Lesen einer EBA-Anwendungsmanifestdatei (Enterprise Bundle Archive, Unternehmensbundlearchiv) aufgetreten. Die Datei kann ung&#252;ltig, besch&#228;digt oder nicht lesbar sein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Anwendungsmanifestdatei APPLICATION.MF der Spezifikation f&#252;r Manifestdateien entspricht.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: Es ist ein interner Fehler aufgetreten. Der URI der Plug-in-Konfigurationsdatei hat nicht das erwartete Format {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: Es ist ein interner Fehler auftreten. W&#228;hrend der Bereitstellung der EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} wurde ein falsches Ergebnis zur&#252;ckgegeben. Es wurde wartet, dass die Maximalversion {1} mit der Mindestversion {2} identisch ist.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: Die Anwendung {0} konnte nicht f&#252;r alle Knoten in der Zelle bereitgestellt werden. Die Anwendung kann nur auf Knoten der Version 7 implementiert werden, auf denen OSGi Applications Feature Pack ausgef&#252;hrt wird. Aufl&#246;sungsfehler: {1}
  </MsgText>
  <Explanation>
    Die importierte Anwendung wurde erfolgreich f&#252;r WebSphere Application Server Version 7 OSGi Applications Feature Pack bereitgestellt, konnte aber nicht f&#252;r WebSphere Application Server Version 8 bereitgestellt werden.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich. Diese Warnung weist darauf hin, dass die Anwendung eine &#252;berm&#228;&#223;ig strikte Versionsvoraussetzung enthalten kann. Sie k&#246;nnen die Informationen im Aufl&#246;sungsfehler verwenden, um die Anwendung so zu &#228;ndern, dass sie auf Knoten der Version 8 implementiert werden kann.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: Es kann kein Cluster-Member auf dem Knoten {0} erstellt werden, weil die OSGi-Anwendungen {1} RunAs-Rollen definieren.
  </MsgText>
  <Explanation>
    Alle Cluster-Member m&#252;ssen in der Lage sein, dieselbe Anwendung auszuf&#252;hren, aber das neue Cluster-Member unterst&#252;tzt keine OSGi-Anwendungen mit definierten RunAs-Rollen.
  </Explanation>
  <UserResponse>
    W&#228;hlen Sie einen Knoten der Version 8 f&#252;r das Cluster-Member aus, oder &#228;ndern Sie die Anwendungskonfiguration so, dass sie keine definierten RunAs-Rollen mehr enth&#228;lt.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: Im Implementierungsmanifest f&#252;r die Anwendung {0} der Version {1} ist Inhalt mit dem symbolischen Namen und der Version der Anwendung enthalten.
  </MsgText>
  <Explanation>
    Anwendungen, Bundles und Verbundbundles nutzen alle denselben Namespace und m&#252;ssen deshalb eindeutige IDs im Namespace haben. Beim Validieren der Anwendungsimplementierung hat die Laufzeitumgebung eine Referenz auf ein Bundle gefunden, das denselben symbolischen Namen und dieselbe Version wie die Anwendung hat.
  </Explanation>
  <UserResponse>
    Korrigieren Sie den symbolischen Namen des Bundles, des Verbundbundles oder der Anwendung, so dass keine Namespace-Konflikte mehr auftreten.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: Das Asset {0} kann nicht aufgel&#246;st werden. Das Attribut {1} in einem Import f&#252;r das Paket {2} wurde w&#228;hrend der Implementierung nicht gefunden.
  </MsgText>
  <Explanation>
    F&#252;r Bundles, die im Header Application-Content des Manifests APPLICATION.MF aufgelistet sind, m&#252;ssen alle Paketimporte Attribute haben, die w&#228;hrend der Implementierung gefunden werden.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die Konfektionierung oder Konfiguration der Anwendung so, dass alle Bundles, die im Header Application-Content aufgelistet sind, Paketimporte haben, die w&#228;hrend der Implementierung aufgel&#246;st werden k&#246;nnen.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: Es ist ein interner Fehler aufgetreten. Die f&#252;r das Entpacken von {0} erforderlichen Konfigurationsdaten wurden nicht gefunden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: Beim Modellieren des Bundles {0} ist eine Ausnahme eingetreten: {1}
  </MsgText>
  <Explanation>
    Die angegebene Ausnahme ist beim Modellieren des angegebenen Bundles eingetreten.
  </Explanation>
  <UserResponse>
    Suchen Sie in der angegebenen Ausnahme nach Details zum Problem, und beheben Sie das Problem.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: Es ist ein interner Fehler auftreten. Der InputStream f&#252;r den ZIP-Eintrag f&#252;r web.xml in der WAR-Datei {0} kann nicht abgerufen werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: Der Authentifizierungsaliasname f&#252;r den MDB-Listener, {0}, wurde nicht auf dem Ziel {1} f&#252;r die Ressource, die von der Bean {2} im Bundle {3} der Version {4} verwendet wird, gefunden.
  </MsgText>
  <Explanation>
    Der angegebene Authentifizierungsalias ist nicht vorhanden oder f&#252;r diese Anwendung nicht sichtbar.
  </Explanation>
  <UserResponse>
    Konfigurieren Sie den erforderlichen Authentifizierungsalias, oder stellen Sie sicher, dass er im richtigen Geltungsbereich f&#252;r die Anwendung konfiguriert ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: Das Asset {0} kann nicht aufgel&#246;st werden. Es erfordert das Bundle {1}, das nicht im Header Application-Content des Anwendungsmanifests APPLICATION.MF aufgelistet ist. Dieses Bundle nutzt den Service {2} aus dem Bundle {3}, das im Header Application-Content aufgelistet ist.
  </MsgText>
  <Explanation>
    Die Anwendung ist nicht ordnungsgem&#228;&#223; konfiguriert. Ein gemeinsam genutztes Bundle kann keine Services aus isolierten Bundles nutzen. Im Header Application-Content aufgelistete Bundles sind isoliert und k&#246;nnen Services nur &#252;ber den Mechanismus Application-ExportService in andere Anwendungen exportieren.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die Konfektionierung oder Konfiguration der Anwendung so, dass Bundles, die im Header Use-Bundle aufgelistet sind oder vom Aufl&#246;ser hinzugef&#252;gt werden, keine Services erfordern, die von Bundles bereitgestellt werden, die im Header Application-Content aufgelistet sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: Das Asset {0} erfordert externe Downloads, bevor es in einer Kompositionseinheit implementiert werden kann.
  </MsgText>
  <Explanation>
    F&#252;r das neue bzw. aktualisierte Asset m&#252;ssen Bundles heruntergeladen werden, bevor das Asset einer Kompositionseinheit hinzugef&#252;gt bzw. in einer Kompositionseinheit aktualisiert werden kann.
  </Explanation>
  <UserResponse>
    Zum Starten des Bundle-Downloadprozesses speichern Sie Ihre &#196;nderungen in der Masterkonfiguration. Sie k&#246;nnen den Status des Bundle-Downloads f&#252;r das Asset in der Detailanzeige f&#252;r das Asset in der Administrationskonsole pr&#252;fen. Nach Abschluss der Bundle-Downloads versuchen Sie erneut, das Asset hinzuzuf&#252;gen bzw. in einer Kompositionseinheit zu aktualisieren.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: Die Konvertierung der WAR-Datei {0} in der EBA-Datei {1} in eine WAB-Datei wurde nicht erfolgreich durchgef&#252;hrt.
  </MsgText>
  <Explanation>
    WAR-Dateien (Web Application Archive, Webanwendungsarchiv) in einer EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) m&#252;ssen in WAB-Dateien (Webanwendungsbundle) konvertiert werden, bevor sie implementiert werden k&#246;nnen. Der Konvertierungsprozess wurde nicht erfolgreich ausgef&#252;hrt.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die WAR-Datei g&#252;ltig ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: Es ist ein interner Fehler aufgetreten. Der RepositoryAdminSupport-Service ist &#252;ber die OSGi-Serviceregistry nicht verf&#252;gbar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: Der Authentifizierungsalias {0} ist nicht in der Sicherheitsdom&#228;ne {2} des Ziels {1} vorhanden.
  </MsgText>
  <Explanation>
    Es muss ein Authentifizierungsalias in der globalen oder Zielsicherheitsdom&#228;ne vorhanden sein, wenn Blueprint-Ressourcenreferenzen gebunden werden.
  </Explanation>
  <UserResponse>
    W&#228;hlen Sie einen Authentifizierungsalias aus, der in der globalen oder Zielsicherheitsdom&#228;ne vorhanden ist, oder erstellen Sie einen geeigneten Authentifizierungsalias.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: Es kann kein Cluster-Member auf dem Knoten {0} erstellt werden, weil die OSGi-Anwendungen {1} Verbundbundlearchive (CBAs) in Application-Content enthalten.
  </MsgText>
  <Explanation>
    Alle Cluster-Member m&#252;ssen in der Lage sein, dieselbe Anwendung auszuf&#252;hren, aber das neue Cluster-Member unterst&#252;tzt keine OSGi-Anwendungen mit CBAs in Application-Content.
  </Explanation>
  <UserResponse>
    W&#228;hlen Sie einen Knoten der Version 8 f&#252;r das Cluster-Member aus, oder &#228;ndern Sie die Anwendungen so, dass sie keine CBAs mehr in Application-Content enthalten.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: Die Kompositionseinheit {0} entspricht keiner OSGi-Anwendung.
  </MsgText>
  <Explanation>
    Die aufgerufene Operation wird f&#252;r eine Kompositionseinheit f&#252;r eine OSGi-Anwendung ausgef&#252;hrt. Die ausgew&#228;hlte Kompositionseinheit enth&#228;lt keine OSGi-Anwendung.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass die ausgew&#228;hlte Kompositionseinheit durch ein Asset mit dem Typaspekt &quot;EBA,version=1.0&quot; gest&#252;tzt wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: Es ist ein interner Fehler aufgetreten. Das Implementierungsmanifest konnte nicht aus der Asset-Bin&#228;rdatei {0} extrahiert werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: Es ist ein interner Fehler aufgetreten. Der ModelledResourceManager-Service ist &#252;ber die OSGi-Serviceregistry nicht verf&#252;gbar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: Es ist ein interner Fehler aufgetreten. Das CBA-Bundle {0} der Version {1} kann nicht modelliert werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: Die Java-EE-Anwendungsdeskriptordatei wurde nicht in der EBA-Datei {0} gefunden. Wenn diese Deskriptordatei nicht vorhanden ist, werden die Kontextstammelemente f&#252;r WAR-Dateien auf die Standardwerte gesetzt.
  </MsgText>
  <Explanation>
    Das System verarbeitet eine WAR-Datei (Web Application Archive, Webanwendungsarchiv) ohne eine zugeordnete Anwendungsdeskriptordatei application.xml, in der die Kontextstammelemente definiert sind. Kontextstammelemente f&#252;r die migrierte WAR-Datei werden auf die Standardwerte gesetzt.
  </Explanation>
  <UserResponse>
    Wenn eine Anwendungsdeskriptordatei erforderlich ist, m&#252;ssen Sie sicherstellen, dass diese bereitgestellt wird und korrekt in die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) gepackt wurde.
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Die Implementierungsmanifestdatei, die von der Anwendung an der Position {0} bereitgestellt wird, kann nicht verarbeitet werden.
  </MsgText>
  <Explanation>
    Es wurde versucht, ein Unternehmensbundlearchiv zu importieren, das eine Implementierungsmanifestdatei enth&#228;lt. Die Verarbeitung dieser Datei war nicht erfolgreich.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass der Anwendungsserver berechtigt ist, auf die Datei zuzugreifen, und dass die Datei nicht besch&#228;digt ist. Editieren Sie das Implementierungsmanifest nicht manuell. Entfernen Sie gegebenenfalls das Implementierungsmanifest aus dem Unternehmensbundlearchiv. Dies bewirkt, dass beim Import des Unternehmensbundlearchivs eine neue Implementierungsmanifestdatei generiert wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: Es ist ein interner Fehler aufgetreten. Der Service {0} ist nicht in der OSGi-Serviceregistry verf&#252;gbar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: Das Verzeichnis {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Das angegebene Verzeichnis kann nicht erstellt werden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass Speicherplatz vorhanden ist und das Produkt die erforderlichen Berechtigungen zum Erstellen des Verzeichnisses besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: Es ist ein interner Fehler aufgetreten. Das Modul {0} hat einen nicht erwarteten Typ.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: Die EBA-Datei {0} wurde mit Fehlern installiert.
  </MsgText>
  <Explanation>
    Die Validierung und Installation der EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) wurde mit Fehlern durchgef&#252;hrt.
  </Explanation>
  <UserResponse>
    Suchen Sie in den begleitenden Fehlernachrichten in der Datei SystemOut.log nach weiteren Informationen.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Es konnte keine Standardbindung f&#252;r die EJB-Referenz {0} im Bundle {1} der Version {2} mit der Schnittstelle {3} erstellt werden, weil keine &#252;bereinstimmenden enterprise in der Anwendung vorhanden sind.
  </MsgText>
  <Explanation>
    F&#252;r nicht gebundene EJB-Referenzen m&#252;ssen Standardbindungen erstellt werden. Es wurde keine Enterprise-Bean gefunden, an die diese Referenz gebunden werden kann.
  </Explanation>
  <UserResponse>
    Binden Sie die fragliche Referenz an eine bekannte JNDI-Position, oder korrigieren Sie die Anwendung auf andere Weise.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: Es ist ein interner Fehler aufgetreten. Es wurde kein Konfigurations-Asset-Objekt f&#252;r das Asset {0} gefunden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: Die Ressourcenreferenz mit dem JNDI-Namen {0} und dem Typ {1} wurde nicht auf dem Ziel {2} f&#252;r die EJB-Ressourcenreferenz {3} gefunden, die im Bundle {4} mit der Version {5} definiert ist.
  </MsgText>
  <Explanation>
    Ein Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive), das Ressourcenreferenzen in einem EJB-Modul enth&#228;lt, gibt einen JNDI-Namen f&#252;r eine Ressourcenreferenz an, die nicht im JNDI-Namespace vorhanden ist.
  </Explanation>
  <UserResponse>
    Wenn die Ressourcenreferenz im JNDI-Namespace enthalten sein soll, binden Sie in Objekt an den Namen, oder korrigieren Sie die Ressourcenreferenz, und aktualisieren Sie das Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: Die in der Kompositionseinheit {0} in der Gesch&#228;ftsanwendung {1} implementierte OSGi-Anwendung wurde nicht gestoppt.
  </MsgText>
  <Explanation>
    W&#228;hrend der Stoppoperation ist eine Ausnahme eingetreten.
  </Explanation>
  <UserResponse>
    Untersuchen Sie f&#252;r eine genauere Problemdiagnose die Serverprotokolle, die vor dieser Ausnahme erstellt wurden.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: Die Rolle {0} ist keine g&#252;ltige Rolle.
  </MsgText>
  <Explanation>
    Die angegebene Rolle wurde nicht konfiguriert.
  </Explanation>
  <UserResponse>
    Konfigurieren Sie die angegebene Rolle.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: Das Cluster-Member {0} ist nicht mit den Features {2} erweitert, die von der OSGi-Anwendung {1} ben&#246;tigt werden.
  </MsgText>
  <Explanation>
    Damit eine OSGi-Anwendung in einem Cluster installiert werden kann, muss jedes Member des Clusters alle f&#252;r die Anwendung erforderlichen Features besitzen. Wenn Sie ein neues Cluster-Member hinzuf&#252;gen, muss dieses Member ebenfalls alle Features haben, die von allen OSGi-Anwendungen ben&#246;tigt werden, die im Cluster installiert sind.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass das f&#252;r den Cluster vorgesehene Member alle erforderlichen Features f&#252;r die in der Fehlernachricht angegebene OSGi-Anwendung besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: Das Verzeichnis {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Das angegebene Verzeichnis kann nicht erstellt werden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass Speicherplatz vorhanden ist und das Produkt die erforderlichen Berechtigungen zum Erstellen des Verzeichnisses besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: Der Inhalt des Implementierungsmanifests ist nicht g&#252;ltig. Die folgenden Bundles sind redundant: {0}.
  </MsgText>
  <Explanation>
    Das zu importierende Implementierungsmanifest enth&#228;lt Bundles, die zum Aufl&#246;sen des EBA-Assets (Enterprise Bundle Archive, Unternehmensbundlearchiv) nicht erforderlich sind.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das neue Implementierungsmanifest, DEPLOYMENT.MF, keine Bundles enth&#228;lt, die in der Ausnahmenachricht aufgelistet sind. Editieren Sie das Implementierungsmanifest nicht manuell. Entfernen Sie gegebenenfalls das Implementierungsmanifest aus dem Unternehmensbundlearchiv. Dies bewirkt, dass beim Import des Unternehmensbundlearchivs eine neue Implementierungsmanifestdatei generiert wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: Die angegebene Gruppe {0} ist nicht g&#252;ltig.
  </MsgText>
  <Explanation>
    Es wurde versucht, eine Sicherheitsrolle einer Gruppe zuzuordnen, die nicht g&#252;ltig ist.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die angegebene Gruppe vorhanden ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: Es ist ein interner Fehler aufgetreten. Der Admin-Service wurde nicht registriert.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: Eine Erweiterung f&#252;r die Kompositionseinheit {0} erfordert externe Downloads.
  </MsgText>
  <Explanation>
    Sie haben ein Verbundbundlearchiv (CBA, Composite Bundle Archive) erstellt oder aktualisiert, das Erweiterung f&#252;r eine Kompositionseinheit verwendet werden soll. Diese Erweiterung erfordert, dass Bundles aus einem Repository heruntergeladen werden, bevor Sie die Erweiterung der Kompositionseinheit hinzuf&#252;gen k&#246;nnen.
  </Explanation>
  <UserResponse>
    Zum Starten des Downloadprozesses speichern Sie Ihre &#196;nderungen in der Masterkonfiguration. Sie k&#246;nnen den Status des Bundle-Downloads in der Detailanzeige f&#252;r die Kompositionseinheit in der Administrationskonsole pr&#252;fen. Warten Sie, bis der Bundle-Download abgeschlossen ist, und f&#252;gen Sie die Erweiterung dann der Kompositionseinheit hinzu.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: Keiner der Server bzw. Cluster besitzt das erforderliche implementierte Feature {0} f&#252;r das Asset {1}.
  </MsgText>
  <Explanation>
    Das erforderliche Feature wurde auf keinem der Server gefunden.
  </Explanation>
  <UserResponse>
    Installieren Sie alle erforderlichen Features auf mindestens einem Server.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: Es ist ein interner Fehler aufgetreten. In der EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} fehlen die folgenden Bundles: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: Das Asset {0} kann dieser Gesch&#228;ftsanwendung (BLA, Business-Level Application) nicht hinzugef&#252;gt werden, weil es bereits der Gesch&#228;ftsanwendung {1} hinzugef&#252;gt wurde.
  </MsgText>
  <Explanation>
    Ein EBA-Asset (Enterprise Bundle Archive, Unternehmensbundlearchiv) kann nur zu einer einzigen Gesch&#228;ftsanwendung (BLA, Business-Level Application) geh&#246;ren.
  </Explanation>
  <UserResponse>
    Erstellen Sie eine neue Anwendung mit demselben Inhalt, aber mit einem anderen symbolischen Anwendungsnamen. Importieren Sie die neue Anwendung als EBA-Asset, und f&#252;gen Sie sie anschlie&#223;end dieser Gesch&#228;ftsanwendung (BLA, Business-Level Application) hinzu.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: Die Bereitstellung der Anwendung {0} hat f&#252;r WebSphere Application Server Version 8 und f&#252;r WebSphere Application Server Version 7 OSGi Applications Feature Pack jeweils andere Ergebnisse geliefert. Das Ergebnis der Version 8 wird verwendet.
  </MsgText>
  <Explanation>
    Die importierte Anwendung wurde erfolgreich f&#252;r WebSphere Application Server Version 8 und WebSphere Application Server Version 7 OSGi Applications Feature Pack bereitgestellt. Die beiden Bereitstellungsoperationen haben jedoch unterschiedliche Ergebnisse geliefert. Es ist nicht m&#246;glich, dieselbe Anwendung mit verschiedenen Implementierungen auszuf&#252;hren.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1} wurde dem Verzeichnis {0} zugeordnet.
  </MsgText>
  <Explanation>
    Ein EBA-Asset (Enterprise Bundle Archive, Unternehmensbundlearchiv) wird einer Kompositionseinheit hinzugef&#252;gt. Zum Konfigurieren der im EBA enthaltenen Webanwendung wurde der Webanwendung ein Verzeichnis zugeordnet.
  </Explanation>
  <UserResponse>
    Keine.
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: Es ist ein interner Fehler aufgetreten. Das Anwendungsmanifest oder Implementierungsmanifest f&#252;r die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} kann nicht gelesen werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: Es ist ein interner Fehler aufgetreten. Der Schritt {0} wurde nicht gefunden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: Das Asset {0} enth&#228;lt eine JAR-Datei {1}, die kein Bundle ist und nicht konvertiert wird. Falls andere Komponenten der Anwendung von dieser Datei abh&#228;ngig sind, schl&#228;gt die Ausf&#252;hrung der Anwendung zur Laufzeit fehl.
  </MsgText>
  <Explanation>
    Die Konvertierung von JAR-Dateien (Java-Archiv) f&#252;r Dienstprogramme und EJBs wird nicht unterst&#252;tzt.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, das keine Bundles oder WAB-Dateien (Web Application Bundle, Webanwendungsbundle) von Klassen aus dieser JAR-Datei abh&#228;ngig sind. Damit diese Warnung nicht mehr angezeigt wird, entfernen Sie die JAR-Datei aus dem Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: Es ist ein interner Fehler auftreten. Das Anwendungsmanifest oder Implementierungsmanifest f&#252;r die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} kann nicht gelesen werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: Die EJB-Schnittstelle {0} f&#252;r die Enterprise-Bean {1} im Bundle {2} der Version {3} kann nicht an die Position {4} gebunden werden. Lokal zug&#228;ngliche EJB-Schnittstellen m&#252;ssen an den Namespace ejblocal: gebunden werden.
  </MsgText>
  <Explanation>
    Ansichten des Typs Lokal, Ohne Schnittstellen und Lokale Ausgangsposition einer Enterprise-Bean k&#246;nnen nur an die lokal zug&#228;ngliche JNDI gebunden werden, d. h., ihre Bindungsnamen m&#252;ssen mit &quot;ejblocal:&quot; beginnen.
  </Explanation>
  <UserResponse>
    Passen Sie die Bindungsnamen aller lokal zug&#228;nglichen EJB-Ansichten so an, dass sie das Namespacepr&#228;fix ejblocal: namespace verwenden.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: CompUnitStatusStep zeigt an, dass die Kompositionseinheit {0} auf die neueste verf&#252;gbare Implementierungsversion im Asset {1} aktualisiert werden muss, aber die Kompositionseinheit {0} ist bereits auf dem neusten Stand.
  </MsgText>
  <Explanation>
    Bevor Sie ein Upgrade des in einer Kompositionseinheit implementierten Assets durchf&#252;hren k&#246;nnen, muss eine aktualisierte Version des Assets verf&#252;gbar sein, und alle vom aktualisierten Asset ben&#246;tigten Bundles m&#252;ssen heruntergeladen worden sein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass eine neuere Version des Assets verf&#252;gbar ist und dass alle Bundle-Downloads f&#252;r das Asset abgeschlossen sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: Es ist ein interner Fehler aufgetreten. Die Kompositionseinheit f&#252;r das Asset {0} kann nicht abgerufen werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: Es kann kein Cluster-Member auf dem Knoten {0} erstellt werden, weil die OSGi-Anwendungen {1} erweitert wurden.
  </MsgText>
  <Explanation>
    Alle Cluster-Member m&#252;ssen in der Lage sein, dieselbe Anwendung auszuf&#252;hren, aber das neue Cluster-Member unterst&#252;tzt keine OSGi-Anwendungserweiterungen.
  </Explanation>
  <UserResponse>
    W&#228;hlen Sie einen Knoten der Version 8 f&#252;r das Cluster-Member aus, oder entfernen Sie die Erweiterungen aus den Anwendungen, so dass sie auf dem ausgew&#228;hlten Knoten ausgef&#252;hrt werden k&#246;nnen.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: Das Bundle {0} in der Kompositionseinheit {1} konnte nicht aktualisiert werden, weil es eine widerspr&#252;chliche Erweiterung mit demselben symbolischen Namen gibt.
  </MsgText>
  <Explanation>
    Es ist nicht m&#246;glich, ein CBA-Bundle auf die angeforderte Version zu aktualisieren, weil es bereits eine Erweiterung mit demselben symbolischen Namen mit dieser Version gibt.
  </Explanation>
  <UserResponse>
    Entfernen Sie die Erweiterung, oder &#228;ndern Sie die Zielbundleversion.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: Der JNDI-Name f&#252;r die MDB-Aktivierungsspezifikation, {0}, wurde nicht auf dem Ziel {1} f&#252;r die Ressource, die von der Bean {2} im Bundle {3} der Version {4} verwendet wird, gefunden.
  </MsgText>
  <Explanation>
    Der angegebene Referenz-JNDI-Name f&#252;r die MDB-Listenerbindung ist nicht vorhanden.
  </Explanation>
  <UserResponse>
    Wenn die Referenz im JNDI-Namespace enthalten sein soll, binden Sie in Objekt an den Namen, oder korrigieren Sie die Referenz, und aktualisieren Sie dann das Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: Es ist ein interner Fehler aufgetreten. Das Asset {0} konnte nicht nach Inhalten abgefragt werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: Die Anwendung {0} enth&#228;lt ein Verbundbundle {1} in ihrem Anwendungsinhalt. Dies wird nicht unterst&#252;tzt.
  </MsgText>
  <Explanation>
    Der Header Application-Content kann nicht verwendet werden, um Verbundbundlearchive direkt in ein Unternehmensbundlearchiv einzuschlie&#223;en.
  </Explanation>
  <UserResponse>
    Entfernen Sie das Verbundbundle aus dem Anwendungsinhalt. Sie k&#246;nnen die einzelnen Bundles in den Header Application-Content einschlie&#223;en oder das Verbundbundle zur gemeinsamen Nutzung in einem Bundle-Repository installieren.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: Es ist ein interner Fehler auftreten. Es ist zwar eine Datei mit dem richtigen Namen im Bundle-Cache vorhanden, aber sie enth&#228;lt nicht das erwartete Bundle {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: Die Nachrichtenzielreferenz bzw. Ressourcenumgebungsreferenz mit dem JNDI-Namen {0} und dem Typ {1} auf dem Ziel {2} f&#252;r die EJB-Nachrichtenzielreferenz bzw. Ressourcenumgebungsreferenz {3}, die im Bundle {4} mit der Version {5} definiert ist, wurde nicht gefunden.
  </MsgText>
  <Explanation>
    Ein Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive), das Nachrichtenzielreferenzen bzw. Ressourcenumgebungsreferenzen in einem EJB-Modul enth&#228;lt, gibt einen JNDI-Namen f&#252;r eine Nachrichtenzielreferenz bzw. Ressourcenumgebungsreferenz an, die nicht im JNDI-Namespace vorhanden ist.
  </Explanation>
  <UserResponse>
    Wenn die Nachrichtenzielreferenz bzw. Ressourcenumgebungsreferenz im JNDI-Namespace enthalten sein sollte, binden Sie ein Objekt an den Namen, oder korrigieren Sie die Nachrichtenzielreferenz bzw. Ressourcenumgebungsreferenz, und aktualisieren Sie das EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: Die OSGi-Anwendung {0} ist ung&#252;ltig, weil ihr symbolischer Name zwei aufeinanderfolgende Punkte enth&#228;lt.
  </MsgText>
  <Explanation>
    Der symbolische Name einer OSGi-Anwendung darf die Zeichenfolge &quot;..&quot;, d. h. zwei aufeinanderfolgende Punkte, nicht enthalten.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie den symbolischen Namen der OSGi-Anwendung.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: Die EBA-Datei {0} kann nicht gelesen werden.
  </MsgText>
  <Explanation>
    Es ist eine Ausnahme des Typs IOException beim Lesen einer EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) aufgetreten. Die Datei kann besch&#228;digt oder nicht lesbar sein.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Datei die erforderlichen Berechtigungen und das richtige Format besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: Es ist ein interner Fehler auftreten. Die MBean SecurityAdmin wurde nicht registriert.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: Servicereferenzen im Inhalt des Verbundbundlearchivs (CBA, Composite Bundle Archive) {0} k&#246;nnen nicht aufgel&#246;st werden. Wenn diese Services von Bundles bereitgestellt werden, die nicht im Verbundbundlearchiv (CBA, Composite Bundle Archive) enthalten sind, m&#252;ssen Sie vom CBA importiert werden. Die folgenden Serviceabh&#228;ngigkeiten wurden nicht aufgel&#246;st: {1}
  </MsgText>
  <Explanation>
    Wenn ein Bundle in einem Verbundbundlearchiv (CBA, Composite Bundle Archive) einen Service verwendet, der nicht im Bundle enthalten ist oder von einem anderen Bundle im CBA exportiert wird, muss der Service vom CBA importiert werden.
  </Explanation>
  <UserResponse>
    Korrigieren Sie das Verbundmanifest COMPOSITEBUNDLE.MF so, dass das CBA alle Services importiert, die von Bundles im CBA verwendet werden und nicht im CBA verf&#252;gbar sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: Die migrierte EBA-Datei {0} kann nicht geschrieben werden.
  </MsgText>
  <Explanation>
    Es ist eine Ausnahme des Typs IOException beim Schreiben einer migrierten EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) aufgetreten.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das Produkt die erforderlichen Berechtigungen zum Schreiben in das relevante Verzeichnis besitzt, dass die Zieldatei nicht gesperrt ist und dass Speicherbereich verf&#252;gbar ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: Die Anwendung {0} konnte nicht f&#252;r alle Knoten in der Zelle bereitgestellt werden. Die Anwendung kann nur auf Knoten der Version 8 implementiert werden. Aufl&#246;sungsfehler: {1}
  </MsgText>
  <Explanation>
    Die importierte Anwendung wurde erfolgreich f&#252;r WebSphere Application Server Version 8 bereitgestellt, konnte aber nicht f&#252;r OSGi Applications Feature Pack in WebSphere Application Server Version 7 bereitgestellt werden.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich. Sie k&#246;nnen jedoch die Informationen im Aufl&#246;sungsfehler verwenden, um die Anwendung so zu &#228;ndern, dass sie f&#252;r WebSphere Application Server Version 7 OSGi Applications Feature Pack implementiert werden kann.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: localhost wird als Hostname f&#252;r den Transport f&#252;r den Server {0}.{1} verwendet. Die Anforderungsweiterleitung funktioniert, solange sich der Webserver und der Anwendungsserver auf demselben Knoten befinden.
  </MsgText>
  <Explanation>
    Der Hostname des im Transport angegebenen Anwendungsservers wurde als localhost aufgel&#246;st.
  </Explanation>
  <UserResponse>
    Wenn sich der Webserver und der Anwendungsserver auf verschiedenen Hosts befinden, pr&#252;fen Sie, warum der Hostname des Anwendungsservers als localhost aufgel&#246;st wurde.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: Die EBA-Datei {0} kann nicht deinstalliert werden. Der Application-SymbolicName {1} der EBA-Datei wird bereits vom Asset {2} verwendet.
  </MsgText>
  <Explanation>
    Sie versuchen gerade, eine EBA-Datei zu installieren, aber es gibt bereits ein Asset mit diesem symbolischen Namen.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie den symbolischen Namen der EBA-Datei, die Sie installieren m&#246;chten, oder deinstallieren Sie das vorhandene Asset.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: Es kann kein Cluster-Member auf dem Knoten {0} erstellt werden, weil die OSGi-Anwendungen {1} nicht auf diesem Cluster-Member bereitgestellt werden k&#246;nnen. Aufl&#246;sungsfehler: {2}
  </MsgText>
  <Explanation>
    Alle Cluster-Member m&#252;ssen in der Lage sein, dieselbe Anwendung auszuf&#252;hren, aber die angegebene OSGi-Anwendung kann nicht auf dem neuen Cluster-Member ausgef&#252;hrt werden.
  </Explanation>
  <UserResponse>
    W&#228;hlen Sie einen anderen kompatiblen Knoten f&#252;r das Cluster-Member aus, oder &#228;ndern Sie die Anwendungen so, dass sie auf dem ausgew&#228;hlten Knoten ausgef&#252;hrt werden k&#246;nnen.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: Die Datei {0} f&#252;r die EBA-Datei {1} kann nicht syntaktisch analysiert werden.
  </MsgText>
  <Explanation>
    Die angegebene Datei kann nicht syntaktisch analysiert werden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Datei ordnungsgem&#228;&#223; formatiert und nicht besch&#228;digt ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: Es ist ein interner Fehler aufgetreten. Das Anwendungsmanifest oder Implementierungsmanifest f&#252;r die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} kann nicht gelesen werden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: Die Datei {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Beim Erstellen des erforderlichen Pfadnamens w&#228;hrend des Exports des Assets ist ein Problem aufgetreten.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass der Anwendungsserver berechtigt ist, diesen Pfadnamen zu erstellen.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: Der Befehl UpdateAppContentVersionStep aus WAS Version 7 wurde in Version 8 durch den Befehl UpdateAppContentVersions ersetzt.
  </MsgText>
  <Explanation>
    Der Befehl UpdateAppContentVersionStep aus WAS Version 7 wurde in Version 8 durch den Befehl UpdateAppContentVersions ersetzt. Weitere Informationen finden Sie im Information Center.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie das Script so, dass der Befehl UpdateAppContentVersions verwendet wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: Es ist ein interner Fehler aufgetreten. Die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} nach Aufl&#246;sung keinen Inhalt, der implementiert werden kann.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: Die EBA-Datei kann nicht aufgel&#246;st werden. Ausnahme: {0}
  </MsgText>
  <Explanation>
    Das System kann die Positionen der einzelnen Anwendungsbundles mit den entsprechenden Versionen der EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) nicht aufl&#246;sen.
  </Explanation>
  <UserResponse>
    Suchen Sie in der Ausnahme nach weiteren Informationen.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: Es ist ein interner Fehler auftreten. Die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} kann nicht aufgel&#246;st werden, weil der Service {1} nicht verf&#252;gbar ist.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: Der angegebene Benutzer {0} ist nicht g&#252;ltig.
  </MsgText>
  <Explanation>
    Es wurde versucht, eine Sicherheitsrolle einem Benutzer zuzuordnen, der nicht g&#252;ltig ist.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass der angegebene Benutzer vorhanden ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: Es ist ein interner Fehler aufgetreten. Es wurde keine MBean f&#252;r den BundleCacheManager f&#252;r das Profil {0} gefunden.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: Die Bindung {0} f&#252;r die EJB-Referenz {1} im Bundle {2} der Version {3} mit der Schnittstelle {4} kann dazu f&#252;hren, dass die Anwendung nach einer Aktualisierung nicht ordnungsgem&#228;&#223; funktioniert.
  </MsgText>
  <Explanation>
    Die Bestandteile der Lookupreferenzen java:global/Anwendungsname/Modulname/EJB-Name oder java:app/Modulname/EJB-Name k&#246;nnen sich nach der Aktualisierung einer OSGi-Anwendung &#228;ndern, so dass die Referenzen entsprechend ge&#228;ndert werden m&#252;ssen, was diesen Ansatz untauglich macht.
  </Explanation>
  <UserResponse>
    Verwenden Sie OSGi-Services, um EJB-Abh&#228;ngigkeiten zu konfigurieren, oder deklarieren Sie eine EJB-Referenz, und ordnen Sie sie dem EJB-JNDI-Namen zu.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} kann das Verzeichnis {1} nicht erstellen.
  </MsgText>
  <Explanation>
    Beim Versuch, die angegebene EBA-Datei zu entpacken, konnte ein erforderliches Verzeichnis nicht erstellt werden.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass der Anwendungsserver berechtigt ist, das angegebene Verzeichnis zu erstellen.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: Das Asset {0} kann nicht aufgel&#246;st werden. Die Versionsvoraussetzungen dieses Assets f&#252;r die folgenden Pakete sind nicht kompatibel: {1}.
  </MsgText>
  <Explanation>
    F&#252;r Bundles, die im Header Application-Content des Manifests APPLICATION.MF aufgelistet sind, m&#252;ssen alle Importe f&#252;r ein bestimmtes Paket kompatible Versionsvoraussetzungen haben.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die Konfektionierung oder Konfiguration der Anwendung so, dass alle Bundles, die im Header Application-Content aufgelistet sind, kompatible Paketversionsvoraussetzungen haben.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: RunAs-Rollen k&#246;nnen f&#252;r Knoten einer Version vor WebSphere Application Server Version 8 nicht konfiguriert werden. Diese Konfiguration wird ignoriert.
  </MsgText>
  <Explanation>
    RunAs-Rollen k&#246;nnen nur f&#252;r WebSphere Application Server Version 8 und h&#246;her konfiguriert werden. Sie k&#246;nnen nicht f&#252;r Kompositionseinheiten konfiguriert werden, die in Zielen des Typs WebSphere Application Server Version 7 OSGi Applications Feature Pack implementiert sind.
  </Explanation>
  <UserResponse>
    Es ist keine Aktion erforderlich. Wenn RunAs-Rollen konfiguriert werden m&#252;ssen, entfernen Sie alle Zielzuordnungen f&#252;r Knoten mit WebSphere Application Server Version 7 OSGi Applications Feature Pack.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: Ung&#252;ltige Benutzer-ID und/oder ung&#252;ltiges Kennwort
  </MsgText>
  <Explanation>
    Sie haben eine ung&#252;ltige Benutzer-ID und/oder ein ung&#252;ltiges Kennwort angegeben.
  </Explanation>
  <UserResponse>
    Wiederholen Sie die Aktion mit einer g&#252;ltigen Benutzer-ID und einem g&#252;ltigen Kennwort.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: Die Aktualisierungsoperation ist f&#252;r die in der Kompositionseinheit {0} in der Gesch&#228;ftsanwendung {1} implementierte OSGi-Anwendung fehlgeschlagen.
  </MsgText>
  <Explanation>
    W&#228;hrend der Aktualisierungsoperation ist eine Ausnahme eingetreten.
  </Explanation>
  <UserResponse>
    Untersuchen Sie f&#252;r eine genauere Problemdiagnose die Serverprotokolle, die vor dieser Ausnahme erstellt wurden.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: Es ist ein interner Fehler aufgetreten. Der Application-Content-Eintrag im Anwendungsmanifest in der EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {0} ist leer. Deshalb wird kein Bundle installiert.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: Die Java-EE-Anwendungsdeskriptordatei in der EBA-Datei {0} kann nicht gelesen werden.
  </MsgText>
  <Explanation>
    Es ist eine Ausnahme des Typs IOException beim Lesen der Java-EE-Anwendungsdeskriptordatei in einer EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) aufgetreten.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die Anwendungsdeskriptordatei nicht besch&#228;digt ist, dass sie lesbar ist und dass sie die erforderlichen Berechtigungen besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: Die Ressourcenreferenz mit dem JNDI-Namen {0} und dem Typ {1} wurde nicht auf dem Ziel {2} f&#252;r die Webmodulressourcenreferenz {3} gefunden, die im Bundle {4} mit der Version {5} definiert ist.
  </MsgText>
  <Explanation>
    Ein Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive), das Ressourcenreferenzen in einer WAR-Datei (Web Application Archive, Webanwendungsarchiv) enth&#228;lt, gibt einen JNDI-Namen f&#252;r eine Ressourcenreferenz an, die nicht im JNDI-Namespace vorhanden ist.
  </Explanation>
  <UserResponse>
    Wenn die Ressourcenreferenz im JNDI-Namespace enthalten sein soll, binden Sie in Objekt an den Namen, oder korrigieren Sie die Ressourcenreferenz, und aktualisieren Sie das Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Es konnte keine Standardbindung f&#252;r die EJB-Referenz {0} im Bundle {1} der Version {2} mit der Schnittstelle {3} erstellt werden, weil es mindestens zwei m&#246;gliche Bindungen gibt. Die Referenz konnte an keine der folgenden Enterprise-Beans gebunden werden: {4}.
  </MsgText>
  <Explanation>
    F&#252;r nicht gebundene EJB-Referenzen m&#252;ssen Standardbindungen erstellt werden. Es wurden mehrere m&#246;gliche Enterprise-Beans gefunden, an die diese Referenz gebunden werden k&#246;nnte.
  </Explanation>
  <UserResponse>
    Binden Sie die fragliche Referenz an eine bestimmte Enterprise-Bean, oder korrigieren Sie die Anwendung auf andere Weise.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: Der Authentifizierungsalias {0} ist nicht ordnungsgem&#228;&#223; konfiguriert. Es ist nicht zul&#228;ssig, einen Alias mit dem Authentifizierungstyp Anwendung an Referenzen zu binden.
  </MsgText>
  <Explanation>
    Authentifizierungsaliase mit dem Authentifizierungstyp Anwendung k&#246;nnen nicht an Blueprint-Ressourcenreferenzen gebunden werden.
  </Explanation>
  <UserResponse>
    Entfernen Sie den Authentifizierungsalias aus der relevanten Ressourcenreferenz.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: Der virtuelle Host {0}, der f&#252;r das Bundle {1} angegeben wurde, ist nicht vorhanden.
  </MsgText>
  <Explanation>
    Es wurde versucht, eine WAB-Datei (web Application Bundle, Webanwendungsbundle) einem virtuellen Host zuzuordnen, der nicht g&#252;ltig ist.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass der angegebene virtuelle Host vorhanden ist.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: Im Anwendungsmanifest der EBA-Datei {0} sind Bundles im Header Application-Content aufgelistet, die auch im Header Use-Bundle aufgelistet sind.
  </MsgText>
  <Explanation>
    Bundlenamen, die im Header Application-Content des Manifests APPLICATION.MF aufgelistet sind, d&#252;rfen nicht gleichzeitig im Header Use-Bundle aufgelistet sein. Dies gilt unabh&#228;ngig von den Bundleversionen.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die Konfektionierung des Unternehmensbundlearchivs (EBA, Enterprise Bundle Archive) so, dass Bundlenamen nicht gleichzeitig im Header Application-Content und im Header Use-Bundle aufgelistet werden.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: Das Verbundbundlearchiv (CBA, Composite Bundle Archive) {0} ist nicht g&#252;ltig. Von Bundles im CBA importierte Pakete fehlen im Header Import-Package der CBA-Manifestdatei. Die folgenden Probleme wurden gemeldet: {1}
  </MsgText>
  <Explanation>
    Wenn ein Bundle in einem Verbundbundlearchiv (CBA, Composite Bundle Archive) ein Paket verwendet, das nicht im Bundle enthalten ist oder von einem anderen Bundle im CBA exportiert wird, muss das CBA das Paket importieren.
  </Explanation>
  <UserResponse>
    Korrigieren Sie das Verbundmanifest COMPOSITEBUNDLE.MF so, dass das CBA alle Pakete importiert, die von Bundles im CBA verwendet werden und nicht im CBA verf&#252;gbar sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: Die Enterprise-Bean {0} im Bundle {1} der Version {2} hat mehrere Zuordnungen f&#252;r die Schnittstelle {3} in der Bindungsdatei. Die Zuordnungen sind {4} und {5}.
  </MsgText>
  <Explanation>
    Die im Bundle enthaltene EJB-Bindungsdatei enth&#228;lt mehrdeutige Zuordnungskonfigurationsdaten f&#252;r eine EJB-Schnittstelle.
  </Explanation>
  <UserResponse>
    Korrigieren Sie die Bindungsdatei so, dass es nur eine einzige konfigurierte Zuordnung f&#252;r jede EJB-Schnittstelle gibt.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: Es wurde keine Kompositionseinheit mit dem Namen {0} in der aktuellen Zelle gefunden.
  </MsgText>
  <Explanation>
    Der angegebene Name entspricht keiner vorhandenen Kompositionseinheit.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen Sie den Namen der Kompositionseinheit.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: Die EBA-Datei {0} enth&#228;lt eine Datei MANIFEST.MF mit dem Header Extension-List. Die Konvertierung dieses Headers wird nicht unterst&#252;tzt.
  </MsgText>
  <Explanation>
    Sie haben versucht, eine EAR-Datei (Enterprise Archive, Unternehmensarchiv) in eine EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) zu konvertieren, aber die EAR-Datei enth&#228;lt eine Datei MANIFEST.MF mit einem Header Extension-List. Die Konvertierung dieses Headers wird nicht unterst&#252;tzt. Eine EAR-Datei verwendet den Header Extension-List, um externe JAR-Dateien zu identifizieren, die die Anwendung zur Laufzeit ben&#246;tigt.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass die im Header Extension-List aufgelisteten externen JAR-Dateien als Bundles im Bundle-Repository verf&#252;gbar sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: Das Asset {0} kann nicht aufgel&#246;st werden. Es erfordert das Bundle {1}, das nicht im Header Application-Content des Anwendungsmanifests APPLICATION.MF aufgelistet ist. Dieses Bundle importiert das Paket {2} aus dem Bundle {3}, das im Header Application-Content aufgelistet ist.
  </MsgText>
  <Explanation>
    Die Anwendung ist nicht ordnungsgem&#228;&#223; konfiguriert. Ein gemeinsam genutztes Bundle kann kein Paket aus einem isolierten Bundle importieren. Im Header Application-Content aufgelistete Bundles sind isoliert und k&#246;nnen Pakete nur f&#252;r andere Bundles bereitstellen, die in diesem Header aufgelistet sind.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die Konfektionierung oder Konfiguration der Anwendung so, dass Bundles, die im Header Use-Bundle aufgelistet sind oder vom Aufl&#246;ser hinzugef&#252;gt werden, keine Pakete aus Bundles erfordern, die im Header Application-Content aufgelistet sind.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep wurde nicht ausgef&#252;hrt, obwohl dieser Schritt erforderlich ist.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: Das Asset {0} kann nicht gleichzeitig auf dem Ziel {1} in der Sicherheitsdom&#228;ne {2} und auf dem Ziel {3} in der Sicherheitsdom&#228;ne {4} implementiert werden.
  </MsgText>
  <Explanation>
    Damit ein Asset auf mehreren Zielen implementiert werden kann, m&#252;ssen alle Ziele in derselben Sicherheitsdom&#228;ne enthalten sein.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die Gruppe der Implementierungsziele so, dass sie alle zu derselben Sicherheitsdom&#228;ne geh&#246;ren.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: Das Verbundmanifest des Verbundbundlearchivs (CBA, Composite Bundle Archive) {0} enth&#228;lt einen Header CompositeBundle-ExportService, aber es sind keine Services im CBA definiert, die diesem Filter entsprechen.
  </MsgText>
  <Explanation>
    Das Verbundbundlemanifest definiert einen Header CompositeBundle-ExportService, aber es sind keine Blueprint-Service-Deklarationen vorhanden, die diesem Filter entsprechen.
  </Explanation>
  <UserResponse>
    F&#252;gen Sie dem CBA-Inhalt die fehlenden Blueprint-Service-Deklarationen hinzu, oder korrigieren Sie den Header CompositeBundle-ExportService im Verbundmanifest COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: F&#252;r die Enterprise-Bean {0} im Bundle {1} der Version {2} ist ein einfacher Zuordnungsname definiert. Die EJB hat aber auch bestimmte Zuordnungen in ihrer Bindungsdatei.
  </MsgText>
  <Explanation>
    Die im Bundle enthaltene EJB-Bindungsdatei enth&#228;lt eine ung&#252;ltige Zuordnungskonfiguration f&#252;r eine Enterprise-Bean.
  </Explanation>
  <UserResponse>
    Korrigieren Sie die Bindungsdatei so, dass sie entweder einen einfachen Zuordnungsnamen oder eine bestimmte Zuordnungskonfiguration enth&#228;lt.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: Es ist ein interner Fehler aufgetreten. Das Blattverzeichnis {0} konnte nicht gel&#246;scht werden, damit das Umbenennen eines Verzeichnisses fortgesetzt werden kann.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: Es ist ein interner Fehler aufgetreten. Das Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive) kann nicht entpackt werden. In der Konfiguration f&#252;r {0} wurde kein Verzeichnis zum Entpacken angegeben.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: Es wurde versucht, ein OSGi-Anwendungs-Asset zu aktualisieren. Dies wird nicht unterst&#252;tzt. Die Aktualisierung von OSGi-Anwendungs-Assets kann &#252;ber die Anzeige &quot;Bundleversionen in dieser Anwendung aktualisieren&quot; auf der Konfigurationsseite f&#252;r das OSGi-Anwendungs-Asset vorgenommen werden.
  </MsgText>
  <Explanation>
    Die Aktualisierung eines OSGi-Anwendungs-Assets mit einer neuen Bin&#228;rdatei wird nicht unterst&#252;tzt.
  </Explanation>
  <UserResponse>
    Wenn Sie au&#223;er der Aktualisierung der Bundleversionen noch weitere &#196;nderungen im vorhandenen Asset vornehmen m&#252;ssen, deinstallieren Sie das Asset, bevor Sie das Ersatz-Asset importieren. Alternativ k&#246;nnen Sie einer vorhandenen Anwendung neue Bundles hinzuf&#252;gen, indem Sie sie in ein Verbundbundlearchiv (CBA, Composite Bundle Archive) packen und das CBA als Erweiterung der Kompositionseinheit hinzuf&#252;gen.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Es wurde kein JNDI-Name f&#252;r die MDB-Aktivierungsspezifikation f&#252;r die Bean {0} im Bundle {1} der Version {2} auf dem Ziel {3} konfiguriert.
  </MsgText>
  <Explanation>
    Der JNDI-Name der Aktivierungsspezifikation der MDB-Listenerbindung wurde nicht konfiguriert.
  </Explanation>
  <UserResponse>
    Sie m&#252;ssen eine JNDI-Referenz f&#252;r die Aktivierungsspezifikation f&#252;r die MDB konfigurieren.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Das Umbenennen der Datei {0} in {1} im Rahmen des Entpackens der EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) {2} ist nicht m&#246;glich.
  </MsgText>
  <Explanation>
    F&#252;r das Entpacken der angegebenen EBA-Datei muss ein Datei umbenannt werden. Diese Umbenennung war nicht erfolgreich.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass der Anwendungsserver berechtigt ist, die Datei umzubenennen.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: Das Verbundbundlearchiv (CBA, Composite Bundle Archive)  {0} ist nicht g&#252;ltig. Die folgenden exportierten Pakete, die im Verbundmanifest aufgelistet sind, werden nicht von Bundles im Verbundbundlearchiv (CBA, Composite Bundle Archive) exportiert: {1}
  </MsgText>
  <Explanation>
    Ein Verbundbundlearchiv (CBA, Composite Bundle Archive) kann nur Pakete exportieren, die von den Bundles im CBA exportiert werden.
  </Explanation>
  <UserResponse>
    F&#252;gen Sie den Bundles im CBA die fehlenden Pakete hinzu, oder entfernen Sie die Details der nicht erf&#252;llten Exporte aus dem Verbundmanifest COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: Das Asset {0} kann nicht hinzugef&#252;gt werden, weil f&#252;r das Asset erforderliche Bundles nicht heruntergeladen wurden. Zum Starten des Bundle-Downloads speichern Sie die &#196;nderungen nach dem Import des Assets in der Masterkonfiguration.
  </MsgText>
  <Explanation>
    Sie haben versucht, ein Asset hinzuzuf&#252;gen, das den Download eines oder mehrerer Bundles aus einem Repository erfordert. Entweder wurde der Download noch nicht gestartet, oder der Download ist noch nicht abgeschlossen.
  </Explanation>
  <UserResponse>
    Wenn Sie die &#196;nderungen nach dem Import des Assets nicht gespeichert haben, speichern Sie die &#196;nderungen jetzt. Warten Sie, bis der Download der Bundles abgeschlossen ist, und versuchen Sie anschlie&#223;end erneut, das Asset der Gesch&#228;ftsanwendung (BLA, Business-Level Application) hinzuzuf&#252;gen. Sie k&#246;nnen den Status des Bundle-Downloads f&#252;r das Asset in der Detailanzeige f&#252;r das Asset in der Administrationskonsole pr&#252;fen.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: Der Inhalt des Implementierungsmanifests ist nicht g&#252;ltig. Die folgenden zus&#228;tzlichen Bundles sind erforderlich: {0}
  </MsgText>
  <Explanation>
    Das zu importierende Implementierungsmanifest enth&#228;lt nicht alle Bundles, die zum Aufl&#246;sen des EBA-Assets (Enterprise Bundle Archive, Unternehmensbundlearchiv) erforderlich sind.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass das neue Implementierungsmanifest, DEPLOYMENT.MF, alle Bundles enth&#228;lt, die in der Ausnahmenachricht aufgelistet sind. Editieren Sie das Implementierungsmanifest nicht manuell. Entfernen Sie gegebenenfalls das Implementierungsmanifest aus dem Unternehmensbundlearchiv. Dies bewirkt, dass beim Import des Unternehmensbundlearchivs eine neue Implementierungsmanifestdatei generiert wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: Das Verzeichnis {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Das angegebene Verzeichnis kann nicht erstellt werden.
  </Explanation>
  <UserResponse>
    Stellen Sie sicher, dass Speicherplatz vorhanden ist und das Produkt die erforderlichen Berechtigungen zum Erstellen des Verzeichnisses besitzt.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: Das Asset {0} kann nicht exportiert werden, weil das erforderliche Bundle {1} nicht vollst&#228;ndig heruntergeladen wurde.
  </MsgText>
  <Explanation>
    Sie haben versucht, ein Asset zu exportieren, das den Download eines oder mehrerer Bundles aus einem Repository erfordert. Entweder wurde der Download noch nicht gestartet, oder der Download ist noch nicht abgeschlossen.
  </Explanation>
  <UserResponse>
    Wenn Sie die &#196;nderungen nach dem Import des Assets nicht gespeichert haben, speichern Sie die &#196;nderungen jetzt. Warten Sie, bis der Download der Bundles abgeschlossen ist, und versuchen Sie anschlie&#223;end erneut, das Asset zu exportieren.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: Es ist ein interner Fehler aufgetreten. Der DeploymentManifestManager-Service ist &#252;ber die OSGi-Serviceregistry nicht verf&#252;gbar.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: Die EBA-Datei kann nicht aufgel&#246;st werden. Das enthaltene Implementierungsmanifest ist auf diesem System nicht g&#252;ltig. Ausnahme: {0}
  </MsgText>
  <Explanation>
    Im Implementierungsmanifest sind die genauen Versionen der erforderlichen Bundles aufgelistet. Das System kann diese Bundleversionen nicht aufl&#246;sen. Wenn ein Implementierungsmanifest in einer EAR-Datei enthalten ist, verwendet der Resolver nur die Bundleversionen, die im Manifest angegeben sind. Es k&#246;nnen andere g&#252;ltige Bundleversionen auf dem System verf&#252;gbar seion, aber sie werden nicht verwendet, weil sie nicht im Implementierungsmanifest angegeben sind.
  </Explanation>
  <UserResponse>
    Wenn Ihre Anwendung ein Implementierungsmanifest verwenden muss, um beispielsweise sicherzustellen, dass in mehreren verschiedenen Umgebungen genau dieselbe Bundlekonfiguration ausgef&#252;hrt wird, verwenden Sie die in der Ausnahme enthaltenen Informationen, um die erforderlichen Bundleversionen zu bestimmen und diese auf dem System verf&#252;gbar zu machen. Wenn Ihre Anwendung diese spezielle Steuerungsebene nicht ben&#246;tigt, entfernen Sie das Implementierungsmanifest. Editieren Sie das Implementierungsmanifest nicht manuell.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: Der f&#252;r die Anwendungsmanifestversion angegebene Wert, {0}, wird nicht unterst&#252;tzt. Die unterst&#252;tzte Version ist {1}.
  </MsgText>
  <Explanation>
    Der f&#252;r den Header Application-ManifestVersion in APPLICATION.MF angegebene Wert ist nicht g&#252;ltig.
  </Explanation>
  <UserResponse>
    Korrigieren Sie den Wert von Application-ManifestVersion in APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Die im Implementierungsmanifest im Unternehmensbundlearchiv angegebenen Anforderungen k&#246;nnen nicht erf&#252;llt werden. Generierte Ausnahme: {0}
  </MsgText>
  <Explanation>
    Es wurde versucht, ein Unternehmensbundlearchiv zu importieren, das eine Implementierungsmanifestdatei enth&#228;lt. Die in dieser Datei angegebenen Anforderungen konnten nicht erf&#252;llt werden.
  </Explanation>
  <UserResponse>
    &#220;berpr&#252;fen Sie den Inhalt der Implementierungsmanifestdatei, und vergewissern Sie sich, dass das System, auf dem dieses Unternehmensbundlearchiv implementiert werden soll, kompatibel ist. Stellen Sie sicher, dass alle erforderlichen internen und externen Bundle-Repositorys konfiguriert sind. Editieren Sie das Implementierungsmanifest nicht manuell. Entfernen Sie gegebenenfalls das Implementierungsmanifest aus dem Unternehmensbundlearchiv. Dies bewirkt, dass beim Import des Unternehmensbundlearchivs eine neue Implementierungsmanifestdatei generiert wird.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: Die EBA-Datei {0} enth&#228;lt einen Header Application-Content in ihrem Anwendungsmanifest, aber der Eintrag ist leer.
  </MsgText>
  <Explanation>
    Die EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) enth&#228;lt einen leeren Header Application-Content in ihrem Anwendungsmanifest application.mf. Wenn der Header angegeben ist, muss dieser Eintrag mindestens ein g&#252;ltiges Bundle auflisten.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie den Header Application-Content in der Datei application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: Der JNDI-Name f&#252;r das MDB-Ziel, {0}, wurde nicht auf dem Ziel {1} f&#252;r die Ressource, die von der Bean {2} im Bundle {3} der Version {4} verwendet wird, gefunden.
  </MsgText>
  <Explanation>
    Der angegebene Zielreferenz-JNDI-Name f&#252;r die MDB-Listenerbindung ist nicht vorhanden.
  </Explanation>
  <UserResponse>
    Wenn die Referenz im JNDI-Namespace enthalten sein soll, binden Sie in Objekt an den Namen, oder korrigieren Sie die Referenz, und aktualisieren Sie dann das Unternehmensbundlearchiv (EBA, Enterprise Bundle Archive).
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: Die EBA-Datei {0} enth&#228;lt keine Angabe zum Application-Content und keine g&#252;ltigen Bundles.
  </MsgText>
  <Explanation>
    Eine EBA-Datei (Enterprise Bundle Archive, Unternehmensbundlearchiv) muss mindestens ein g&#252;ltiges OSGi-Bundle oder mindestens eine WAR-Datei (Web Application Archive, Webanwendungsarchiv) oder mindestens ein OSGi-Bundle im Header Application-Content ihrer Anwendungsmanifestdatei auflisten.
  </Explanation>
  <UserResponse>
    &#196;ndern Sie die EBA-Datei so, dass sie mindestens ein g&#252;ltiges Bundle oder eine g&#252;ltige WAR-Datei (Einschluss nach Wert) enth&#228;lt oder mindestens ein Bundle im Header Application-Content ihrer Anwendungsmanifestdatei application.mf (Einschluss nach Referenz) auflistet.
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: Das Verzeichnis {0} kann nicht erstellt werden.
  </MsgText>
  <Explanation>
    Beim Erstellen des erforderlichen Pfadnamens w&#228;hrend des Exports des Assets ist ein Problem aufgetreten.
  </Explanation>
  <UserResponse>
    Vergewissern Sie sich, dass der Anwendungsserver berechtigt ist, diesen Pfadnamen zu erstellen.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
