<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.obr.provisioner/src/com/ibm/ws/eba/provisioning/exception/nls/resolver.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ1003E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_CB_SYM_NAMES" varFormat="Java">
    TOO_MANY_CB_SYM_NAMES=CWSAJ1003E: S-a produs o eroare intern&#259;. Un manifest bundle compus trebuie s&#259; con&#355;in&#259; exact o intrare Bundle-SymbolicName. A fost g&#259;sit&#259; urm&#259;toarea intrare: {0}.
  </MsgText>
  <Explanation>
    Mediul runtime a &#238;ncercat s&#259; proceseze metadatele pentru un bundle compus &#351;i nu a putut determina numele simbolic al bundle-ului.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1006E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_STRING" varFormat="Java">
    INVALID_FILTER_STRING=CWSAJ1006E: O eroare de sintax&#259; a survenit &#238;ncerc&#226;nd parsarea &#351;irului filtru plan &apos;&apos;{0}&apos;&apos; pentru element cu id {1}: {2}
  </MsgText>
  <Explanation>
    O InvalidSyntaxException a fost aruncat&#259; &#238;n timpul &#238;ncerc&#259;rii de parsare a &#351;irului filtru pentru elementul cu id specificat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; &#351;irul de filtru pentru id-ul specificat este sintactic corect.
  </UserResponse>
</Message>
<Message ID="CWSAJ1001E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_SYM_NAMES" varFormat="Java">
    TOO_MANY_SYM_NAMES=CWSAJ1001E: S-a produs o eroare intern&#259;. Un manifest bundle trebuie s&#259; con&#355;in&#259; exact o intrare Bundle-SymbolicName. A fost g&#259;sit&#259; urm&#259;toarea intrare: {0}.
  </MsgText>
  <Explanation>
    Runtime-ul a &#238;ncercat s&#259; proceseze metadatele pentru un bundle &#351;i nu a putut determina numele simbolic al bundle-ului.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1005E" severity="E" prefix="yes">
  <MsgText pgmKey="TOO_MANY_FRAG_HOSTS" varFormat="Java">
    TOO_MANY_FRAG_HOSTS=CWSAJ1005E: S-a produs o eroare intern&#259;. Un manifest fragment de bundle trebuie s&#259; defineasc&#259; exact o intrare Fragment-Host. A fost g&#259;sit&#259; urm&#259;toarea intrare: {0}.
  </MsgText>
  <Explanation>
    Mediul runtime a &#238;ncercat s&#259; proceseze metadatele pentru un bundle fragment &#351;i nu a putut determina bundle-ul gazd&#259; al fragmentului.
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ1004E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_CB_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_CB_MANDATORY_HEADERS=CWSAJ1004E: S-a produs o eroare intern&#259;. Un bundle compus cu nume simbolic {0} &#351;i versiune manifest {1} nu a putut fi procesat.
  </MsgText>
  <Explanation>
    Un manifest de bundle compus trebuie s&#259; con&#355;in&#259; o intrare Bundle-SymbolicName &#351;i una CompositeBundle-ManifestVersion valid&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; toate bundle-urile con&#355;in o intrare Bundle-SymbolicName &#351;i una CompositeBundle-ManifestVersion valid&#259; &#238;n fi&#351;ierele de manifest.
  </UserResponse>
</Message>
<Message ID="CWSAJ1002E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_MANDATORY_HEADERS" varFormat="Java">
    INCORRECT_MANDATORY_HEADERS=CWSAJ1002E: S-a produs o eroare intern&#259;. Un bundle cu nume simbolic {0} &#351;i versiune manifest {1} nu a putut fi procesat.
  </MsgText>
  <Explanation>
    Un manifest bundle trebuie s&#259; con&#355;in&#259; o intrare Bundle-SymbolicName &#351;i una Bundle-ManifestVersion valid&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; toate bundle-urile con&#355;in o intrare Bundle-SymbolicName &#351;i una Bundle-ManifestVersion valid&#259; &#238;n fi&#351;ierele de manifest.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
