<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.admin/src/com/ibm/ws/eba/admin/messages/EBAADMINMessages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAJ0073E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0073E" varFormat="Java">
    EBAADMIN0073E=CWSAJ0073E: Parametrul symbolicName nu a fost specificat &#351;i este cerut.
  </MsgText>
  <Explanation>
    Comanda necesit&#259; ca parametrul symbolicName s&#259; fie specificat.
  </Explanation>
  <UserResponse>
    Relansa&#355;i comanda specific&#226;nd symbolicName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0053E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0053E" varFormat="Java">
    EBAADMIN0053E=CWSAJ0053E: Nu poate s&#259; g&#259;seasc&#259; manifestul de implementare din loca&#355;ia {0}.
  </MsgText>
  <Explanation>
    Nu exist&#259; manifestul de implementare, DEPLOYMENT.MF, care trebuie importat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; calea manifestului de implementare este corect&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0069E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0069E" varFormat="Java">
    EBAADMIN0069E=CWSAJ0069E: Bundle-urile {0} nu au putut fi &#238;nl&#259;turate din magazia intern&#259; de bundle-uri. Toate celelalte bundle-uri {1} au fost &#238;nl&#259;turate cu succes.
  </MsgText>
  <Explanation>
    Unele bundle-uri nu au putut fi &#351;terse din magazia intern&#259; de bundle-uri.
  </Explanation>
  <UserResponse>
    Opri&#355;i orice aplica&#355;ii care ar putea utiliza bundle-urile care nu au putut fi &#351;terse, apoi &#238;ncerca&#355;i s&#259; le &#238;nl&#259;tura&#355;i din nou.
  </UserResponse>
</Message>
<Message ID="CWSAJ0033E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0033E" varFormat="Java">
    EBAADMIN0033E=CWSAJ0033E: Bundle-ul {0} este deja oprit.
  </MsgText>
  <Explanation>
    Nu pute&#355;i opri bundle-ul pentru c&#259; este deja oprit.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0049E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0049E" varFormat="Java">
    EBAADMIN0049E=CWSAJ0049E: Nu poate &#351;terge bundle-ul {0} deoarece urm&#259;toarele Composite Bundle Archives au o dependen&#355;&#259; de bundle-ul: {1}.
  </MsgText>
  <Explanation>
    Un bundle nu poate fi &#351;ters din magazia bundle intern&#259; dac&#259; un Composite Bundle Archive depinde de acel bundle.
  </Explanation>
  <UserResponse>
    Pentru a &#351;terge bundle-ul, &#351;terge&#355;i mai &#238;nt&#226;i Composite Bundle Archives listate, apoi &#351;terge&#355;i bundle-ul.
  </UserResponse>
</Message>
<Message ID="CWSAJ0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0013E" varFormat="Java">
    EBAADMIN0013E=CWSAJ0013E: Nu poate s&#259; ob&#355;in&#259; capabilit&#259;&#355;i ale caracteristicii cerute pentru caracteristici precum caracteristica JPA2.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0029E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0029E" varFormat="Java">
    EBAADMIN0029E=CWSAJ0029E: Nu poate s&#259; g&#259;seasc&#259; serviciul cu ID-ul serviciu {0}.
  </MsgText>
  <Explanation>
    ID-ul serviciu care a fost livrat comenzii nu se potrive&#351;te cu nici un serviciu din registru.
  </Explanation>
  <UserResponse>
    Re&#238;ncerca&#355;i comanda cu un ID serviciu valid.
  </UserResponse>
</Message>
<Message ID="CWSAJ0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0009E" varFormat="Java">
    EBAADMIN0009E=CWSAJ0009E: Bundle-ul {1} cu versiunea {2}, definit &#238;n fi&#351;ierul {0} exist&#259; deja &#238;n magazie.
  </MsgText>
  <Explanation>
    Bundle-ul nu poate fi ad&#259;ugat &#238;n magazie pentru c&#259; bundle-ul exist&#259; deja &#238;n magazie.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; bundle-ul din magazie este cel corect. Dac&#259; bundle-ul din magazie nu este corect, &#238;nl&#259;tura&#355;i-l din magazie &#238;nainte de a ad&#259;uga bundle-ul corect.
  </UserResponse>
</Message>
<Message ID="CWSAJ0072E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0072E" varFormat="Java">
    EBAADMIN0072E=CWSAJ0072E: Parametrul cuName nu a fost specificat &#351;i este cerut.
  </MsgText>
  <Explanation>
    Comanda necesit&#259; ca parametrul cuName s&#259; fie specificat.
  </Explanation>
  <UserResponse>
    Relansa&#355;i comanda specific&#226;nd cuName.
  </UserResponse>
</Message>
<Message ID="CWSAJ0084W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAJ0084W: Referin&#355;ele de servicii din con&#355;inutul arhivei CBA (Composite Bundle Archive) {0} nu pot fi rezolvate. Dac&#259; aceste servicii sunt furnizate de bundle-uri care nu sunt incluse &#238;n CBA, atunci CBA trebuie s&#259; le importe. Urm&#259;toarele dependen&#355;e de servicii nu au fost rezolvate: {1}
  </MsgText>
  <Explanation>
    Dac&#259; un bundle dintr-o arhiv&#259; CBA (Composite Bundle Archive) folose&#351;te un serviciu care nu este con&#355;inut &#238;n bundle sau nu este exportat de alt bundle &#238;n CBA, atunci CBA trebuie s&#259; importe serviciul.
  </Explanation>
  <UserResponse>
    Corecta&#355;i manifestul compozi&#355;iei, COMPOSITEBUNDLE.MF, astfel &#238;nc&#226;t CBA s&#259; importe toate serviciile care sunt folosite de bundle-uri &#238;n CBA &#351;i care nu sunt &#238;n alt fel disponibile &#238;n CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0052E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0052E" varFormat="Java">
    EBAADMIN0052E=CWSAJ0052E: A survenit o eroare intern&#259;. Nu se poate g&#259;si manifestul de implementare din asetul EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0001
  </UserResponse>
</Message>
<Message ID="CWSAJ0068E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0068E" varFormat="Java">
    EBAADMIN0068E=CWSAJ0068E: S-a produs o eroare intern&#259;. Metadatele pentru bundle-urile {0} nu au putut fi &#238;nl&#259;turate din magazia intern&#259; de bundle-uri. De asemena, bundle-urile {1} nu au putut fi &#351;terse din magazie. Excep&#355;ia a fost {2}
  </MsgText>
  <Explanation>
    Unele bundle-uri nu au putut fi &#351;terse din magazia intern&#259; de bundle-uri &#351;i metadatele altora nu au putut fi &#238;nl&#259;turate. Sistemul ar putea fi acum &#238;ntr-o stare contradictorie.
  </Explanation>
  <UserResponse>
    Ignora&#355;i modific&#259;rile din spa&#355;iul de lucru curent &#351;i &#238;ncerca&#355;i s&#259; &#238;nl&#259;tura&#355;i c&#226;te un bundle o dat&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0032I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0032I" varFormat="Java">
    EBAADMIN0032I=CWSAJ0032I: Bundle-ul {0} a pornit cu succes.
  </MsgText>
  <Explanation>
    Acest mesaj este doar cu scop informativ.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0048E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0048E" varFormat="Java">
    EBAADMIN0048E=CWSAJ0048E: Nu poate s&#259; ob&#355;in&#259; informa&#355;ii despre pachet deoarece nu a&#355;i conectat la un cadru de lucru.
  </MsgText>
  <Explanation>
    Nu sunte&#355;i momentan conectat la un cadru de lucru.
  </Explanation>
  <UserResponse>
    Folosi&#355;i comanda de conectare pentru conectarea la un cadru de lucru. Pentru o list&#259; de cadre de lucru disponibile, folosi&#355;i comanda list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0012E" varFormat="Java">
    EBAADMIN0012E=CWSAJ0012E: S-a produs o eroare intern&#259;. Nu se poate g&#259;si serviciul Lansator.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0028E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0028E" varFormat="Java">
    EBAADMIN0028E=CWSAJ0028E: Nu poate s&#259; g&#259;seasc&#259; bundle-ul cu ID-ul de bundle {0}.
  </MsgText>
  <Explanation>
    ID-ul bundle care a fost livrat comenzii nu se potrive&#351;te cu nici un bundle din cadrul de lucru.
  </Explanation>
  <UserResponse>
    Re&#238;ncerca&#355;i comanda cu un ID bundle valid.
  </UserResponse>
</Message>
<Message ID="CWSAJ0008E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0008E" varFormat="Java">
    EBAADMIN0008E=CWSAJ0008E: Fi&#351;ierul specificat {0} nu con&#355;ine un manifest de bundle valid.
  </MsgText>
  <Explanation>
    Fi&#351;ierul specificat nu este un bundle OSGi.
  </Explanation>
  <UserResponse>
    Verifica&#355;i &#351;i corecta&#355;i manifestul bundle al fi&#351;ierului livrat.
  </UserResponse>
</Message>
<Message ID="CWSAJ0071E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0071E" varFormat="Java">
    EBAADMIN0071E=CWSAJ0071E: S-a produs o eroare intern&#259;. Nu este disponibil un serviciu runtime de la registrul serviciului OSGi: {0}
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0051E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0051E" varFormat="Java">
    EBAADMIN0051E=CWSAJ0051E: Asetul {0} livrat nu este un aset EBA.
  </MsgText>
  <Explanation>
    Asetul livrat nu este un aset EBA.
  </Explanation>
  <UserResponse>
    Asigura&#355;i-v&#259; c&#259; asetul livrat este un aset EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0067E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0067E" varFormat="Java">
    EBAADMIN0067E=CWSAJ0067E: S-a produs o eroare intern&#259;. Metadatele pentru bundle-urile {0} nu au putut fi &#238;nl&#259;turate din magazia intern&#259; de bundle-uri. Excep&#355;ia a fost {1}
  </MsgText>
  <Explanation>
    Bundle-urile  nu au putut fi &#238;nl&#259;turate din magazia intern&#259; de bundle-uri. Sistemul ar putea fi acum &#238;ntr-o stare contradictorie.
  </Explanation>
  <UserResponse>
    Ignora&#355;i modific&#259;rile din spa&#355;iul de lucru curent &#351;i &#238;ncerca&#355;i s&#259; &#238;nl&#259;tura&#355;i c&#226;te un bundle o dat&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0031E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0031E" varFormat="Java">
    EBAADMIN0031E=CWSAJ0031E: Bundle-ul {0} este pornit deja.
  </MsgText>
  <Explanation>
    Nu pute&#355;i porni bundle-ul pentru c&#259; este deja pornit.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0047E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0047E" varFormat="Java">
    EBAADMIN0047E=CWSAJ0047E: Filtrul serviciul nu este valid: {0}.
  </MsgText>
  <Explanation>
    Filtrul de servicii livrat nu este valid.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; filtrul de servicii este valid &#351;i re&#238;ncerca&#355;i comanda.
  </UserResponse>
</Message>
<Message ID="CWSAJ0011E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0011E" varFormat="Java">
    EBAADMIN0011E=CWSAJ0011E: S-a produs o eroare intern&#259;. Generatorul de servicii al magaziei nu este disponibil din registrul de servicii OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0027E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0027E" varFormat="Java">
    EBAADMIN0027E=CWSAJ0027E: Nu poate s&#259; ob&#355;in&#259; informa&#355;ii despre serviciu deoarece nu a&#355;i conectat la un cadru de lucru.
  </MsgText>
  <Explanation>
    Nu sunte&#355;i momentan conectat la un cadru de lucru.
  </Explanation>
  <UserResponse>
    Folosi&#355;i comanda de conectare pentru conectarea la un cadru de lucru. Pentru o list&#259; de cadre de lucru disponibile, folosi&#355;i comanda list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0070E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0070E" varFormat="Java">
    EBAADMIN0070E=CWSAJ0070E: Bundle-ul {0} con&#355;inut &#238;n arhiva de bundle-uri compus&#259; {1} nu con&#355;ine un manifest bundle valid.
  </MsgText>
  <Explanation>
    Fi&#351;ierul specificat nu este un bundle OSGi.
  </Explanation>
  <UserResponse>
    Verifica&#355;i &#351;i corecta&#355;i manifestul bundle al fi&#351;ierului livrat.
  </UserResponse>
</Message>
<Message ID="CWSAJ0080E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAJ0080E: Arhiva CBA (Composite Bundle Archive) {0} nu este valid&#259;. Pachete importate ca bundle-uri &#238;n CBA lipsesc din antetul Import-Pachete al fi&#351;ierului manifest CBA. Urm&#259;toarele probleme au fost raportate {1}
  </MsgText>
  <Explanation>
    Dac&#259; un bundle dintr-o arhiv&#259; CBA (Composite Bundle Archive) folose&#351;te un pachet care nu este con&#355;inut &#238;n bundle sau nu este exportat de alt bundle &#238;n CBA, atunci CBA trebuie s&#259; importe pachetul.
  </Explanation>
  <UserResponse>
    Corecta&#355;i manifestul compozi&#355;iei, COMPOSITEBUNDLE.MF, astfel &#238;nc&#226;t CBA s&#259; importe toate pachetele care sunt folosite de bundle-uri &#238;n CBA &#351;i care nu sunt &#238;n alt fel disponibile &#238;n CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0050E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0050E" varFormat="Java">
    EBAADMIN0050E=CWSAJ0050E: Conexiunea nu mai este disponibil&#259;. V&#259; rug&#259;m s&#259; verifica&#355;i conexiunile disponibile &#351;i s&#259; v&#259; reconecta&#355;i dac&#259; este necesar.
  </MsgText>
  <Explanation>
    Cadrul de lucru la care era&#355;i conectat nu mai este disponibil. Aceasta poate fi pentru c&#259; o aplica&#355;ie s-a oprit.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; cadrul de lucru mai este disponibil &#351;i reconecta&#355;i-v&#259; dac&#259; este necesar.
  </UserResponse>
</Message>
<Message ID="CWSAJ0066E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0066E" varFormat="Java">
    EBAADMIN0066E=CWSAJ0066E: &#350;irul {0} nu se potrive&#351;te cu sintaxa corect&#259; a symbolicname;version.
  </MsgText>
  <Explanation>
    &#350;irul livrat &#238;n lista de bundle-uri de &#238;nl&#259;turat nu a putut fi procesat deoarece nu se potrive&#351;te cu sintaxa a&#351;teptat&#259;.
  </Explanation>
  <UserResponse>
    Corecta&#355;i sintaxa &#351;irului livrat.
  </UserResponse>
</Message>
<Message ID="CWSAJ0030E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0030E" varFormat="Java">
    EBAADMIN0030E=CWSAJ0030E: Nu poate s&#259; ob&#355;in&#259; informa&#355;ii despre antet deoarece nu a&#355;i conectat la un cadru de lucru.
  </MsgText>
  <Explanation>
    Nu sunte&#355;i momentan conectat la un cadru de lucru.
  </Explanation>
  <UserResponse>
    Folosi&#355;i comanda de conectare pentru conectarea la un cadru de lucru. Pentru o list&#259; de cadre de lucru disponibile, folosi&#355;i comanda list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0046E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0046E" varFormat="Java">
    EBAADMIN0046E=CWSAJ0046E: Nu poate s&#259; g&#259;seasc&#259; pachetul cu numele pachetului {0}.
  </MsgText>
  <Explanation>
    Numele pachetului care a fost livrat comenzii nu se potrive&#351;te cu nici un pachet din cadrul de lucru.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; numele pachetuli este valid &#351;i re&#238;ncerca&#355;i comanda.
  </UserResponse>
</Message>
<Message ID="CWSAJ0010E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0010E" varFormat="Java">
    EBAADMIN0010E=CWSAJ0010E: Bundle-ul specificat {0} cu versiunea {1} nu exist&#259; &#238;n magazia local&#259; de bundle-uri.
  </MsgText>
  <Explanation>
    Bundle-ul nu poate fi afi&#351;at sau &#351;ters pentru c&#259; nici un bundle cu acel nume nu exist&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i &#351;i corecta&#355;i versiunea sau numele simbolic al bundle-ului.
  </UserResponse>
</Message>
<Message ID="CWSAJ0026E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0026E" varFormat="Java">
    EBAADMIN0026E=CWSAJ0026E: Nu poate s&#259; ob&#355;in&#259; informa&#355;ii despre bundle deoarece nu a&#355;i conectat la un cadru de lucru.
  </MsgText>
  <Explanation>
    Nu sunte&#355;i momentan conectat la un cadru de lucru.
  </Explanation>
  <UserResponse>
    Folosi&#355;i comanda de conectare pentru conectarea la un cadru de lucru. Pentru o list&#259; de cadre de lucru disponibile, folosi&#355;i comanda list().
  </UserResponse>
</Message>
<Message ID="CWSAJ0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0006E" varFormat="Java">
    EBAADMIN0006E=CWSAJ0006E: Magazia de bundle-uri {0} nu exist&#259;.
  </MsgText>
  <Explanation>
    O &#238;ncercare de a modifica magazia bundle a fost f&#259;cut&#259;, dar aceasta nu exist&#259;.
  </Explanation>
  <UserResponse>
    Crea&#355;i magazia bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0065E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0065E" varFormat="Java">
    EBAADMIN0065E=CWSAJ0065E: Fi&#351;ierul specificat {0} nu poate fi parsat ca fi&#351;ier manifest din cauza excep&#355;iei {1}
  </MsgText>
  <Explanation>
    Fi&#351;ierul specificat nu pare s&#259; fie un fi&#351;ier manifest valid.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; fi&#351;ierul furnizat este un fi&#351;ier manifest valid.
  </UserResponse>
</Message>
<Message ID="CWSAJ0045E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0045E" varFormat="Java">
    EBAADMIN0045E=CWSAJ0045E: Nu poate s&#259; g&#259;seasc&#259; pachetul cu loca&#355;ia {0}.
  </MsgText>
  <Explanation>
    Loca&#355;ia pachetului care a fost livrat comenzii nu se potrive&#351;te cu nici o loca&#355;ie a pachetelor din cadrul de lucru.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; loca&#355;ia pachetului este valid&#259; &#351;i re&#238;ncerca&#355;i comanda.
  </UserResponse>
</Message>
<Message ID="CWSAJ0025I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0025I" varFormat="Java">
    EBAADMIN0025I=CWSAJ0025I:      Consol&#259; aplica&#355;ie OSGi
 
 Afi&#351;are comenzi: Aceste comenzi func&#355;ioneaz&#259; doar dac&#259; au fost conectate la un cadru de lucru
 
     ss()                - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii sumar despre bundle-urile instalate.
     bundles()           - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii complete despre bundle-urile instalate.
     packages()          - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre pachetele importate/exportate.
     services()          - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre serviciile &#238;nregistrate.
 
     bundle(&lt;ID bundle&gt;)  - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre bundle-ul specificat.
     headers(&lt;ID bundle&gt;) - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre anteturile asociate cu bundle-ul specificat.
     packages(&lt;ID bundle&gt;) - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre pachetele exportate pentru acest bundle.
     packages(&lt;Nume pachet&gt;) - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre pachetul specificat.
     services(&lt;ID serviciu&gt;) - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre serviciul specificat.
     services(&lt;Filtru OSGI&gt;) - Aceast&#259; comand&#259; ofer&#259; informa&#355;ii despre serviciile potrivite filtrului.
 
     refresh() - Aceast&#259; comand&#259; re&#238;mprosp&#259;teaz&#259; memoria cache a consolei aplica&#355;iei interne OSGi cu cele mai noi informa&#355;ii despre starea cadrului de lucru.
 
 Comenzile cadrului de lucru:
 
     list() - Aceast&#259; comand&#259; listeaz&#259; cadrele de lucru disponibile la care v&#259; pute&#355;i conecta.
     connect(&lt;Framework id&gt;) - Aceast&#259; comand&#259; conecteaz&#259; la cadrul de lucru specificat.
     connect(&lt;Nume bundle&gt;, &lt;Versiune bundle&gt;, &lt;Nume nod&gt;, &lt;Nume server&gt;) - Aceast&#259; comand&#259; conecteaz&#259; la cadrul de lucru specificat.
 
 Bundle-uri de control:
 
     start(&lt;ID bundle&gt;) - Aceast&#259; comand&#259; porne&#351;te bundle-ul solicitat.
     stop(&lt;ID bundle&gt;)   - Aceast&#259; comand&#259; opre&#351;te bundle-ul solicitat.
  </MsgText>
  <Explanation>
    Nimic.
  </Explanation>
  <UserResponse>
    Nimic.
  </UserResponse>
</Message>
<Message ID="CWSAJ0064E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0064E" varFormat="Java">
    EBAADMIN0064E=CWSAJ0064E: Fi&#351;ierul specificat {0} nu este un JAR sau un Composite Bundle Archive.
  </MsgText>
  <Explanation>
    Numele fi&#351;ierului specificat nu se termin&#259; cu extensiile fi&#351;ierelor .jar sau .cba.
  </Explanation>
  <UserResponse>
    Verifica&#355;i &#351;i corecta&#355;i numele fi&#351;ierului livrat. Fi&#351;ierul livrat trebuie s&#259; fie un JAR valid sau un CBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0044E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0044E" varFormat="Java">
    EBAADMIN0044E=CWSAJ0044E: Nu poate s&#259; g&#259;seasc&#259; pachetul cu ID-ul pachet {0}.
  </MsgText>
  <Explanation>
    ID-ul pachetului care a fost livrat comenzii nu se potrive&#351;te cu nici un pachet din cadrul de lucru.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; ID-ul pachetului este valid &#351;i re&#238;ncerca&#355;i comanda.
  </UserResponse>
</Message>
<Message ID="CWSAJ0024E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0024E" varFormat="Java">
    EBAADMIN0024E=CWSAJ0024E: Antetul CompositeBundle-Content din Composite Bundle Archive {0} trebuie s&#259; con&#355;in&#259; doar bundle-uri cu o versiune exact&#259;. Urm&#259;toarele intr&#259;ri nu sunt valide: {1}.
  </MsgText>
  <Explanation>
    O intrare CompositeBundle-Content trebuie s&#259; foloseasc&#259; un format similar cu &apos;bundle.nume;versiune=&quot;[1.0.0,1.0.0]&quot;&apos;.
  </Explanation>
  <UserResponse>
    Asigura&#355;i-v&#259; c&#259; intr&#259;rile din antetul CompositeBundle-Content &#238;n fi&#351;ierul manifest bundle compus specific&#259; o versiune exact&#259; &#351;i folosesc formatul corect.
  </UserResponse>
</Message>
<Message ID="CWSAJ0063E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0063E" varFormat="Java">
    EBAADMIN0063E=CWSAJ0063E: Nu poate s&#259; instaleze Composite Bundle Archive, {0} deoarece urm&#259;toarele pachete de exportat difer&#259; de acelea con&#355;inute  de Composite Bundle Archive: {1}
  </MsgText>
  <Explanation>
    Un Composite Bundle Archive (CBA) poate exporta doar pachete pe care bundle-urile pe care le con&#355;ine le export&#259;, de asemenea. Atributele &#351;i directivele trebuie, de asemenea, s&#259; se potriveasc&#259;.
  </Explanation>
  <UserResponse>
    Corecta&#355;i manifestul compus, COMPOSITEBUNDLE.MF, astfel &#238;nc&#226;t s&#259; exporte pachete pe care bundle-urile con&#355;inute de CBA le export&#259;, de asemenea.
  </UserResponse>
</Message>
<Message ID="CWSAJ0082W" severity="W" prefix="yes">
  <MsgText pgmKey="EBAADMIN0082W" varFormat="Java">
    EBAADMIN0082W=CWSAJ0082W: Func&#355;ionalitatea extensie de aplica&#355;ie nu este disponibil&#259; pentru aceast&#259; unitate de compozi&#355;ie deoarece unitatea de compozi&#355;ie este implementat&#259; pe &#355;intele urm&#259;toare, care nu suport&#259; extensie de aplica&#355;ie: {0}
  </MsgText>
  <Explanation>
    &#354;intele pe care este implementat&#259; unitatea de compozi&#355;ie nu suport&#259; toate func&#355;ionalitatea extensie de aplica&#355;ie.
  </Explanation>
  <UserResponse>
    Asigura&#355;i-v&#259; c&#259; unitatea de compozi&#355;ia la care dori&#355;i s&#259; ad&#259;uga&#355;i extensii este implementat&#259; pe &#355;inte care suport&#259; func&#355;ionalitatea extensie de aplica&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAJ0043E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0043E" varFormat="Java">
    EBAADMIN0043E=CWSAJ0043E: Bundle-ul {0} nu poate fi oprit. Este momentan &#238;n starea {1}.
  </MsgText>
  <Explanation>
    Bundle-ul nu poate fi oprit.
  </Explanation>
  <UserResponse>
    Referi&#355;i-v&#259; la mesajul de eroare &#238;nso&#355;itor pentru mai multe informa&#355;ii despre de ce nu poate fi oprit acest bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0059E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0059E" varFormat="Java">
    EBAADMIN0059E=CWSAJ0059E: Parametrul {0} nu a fost specificat &#351;i este cerut pentru comanda {1}.
  </MsgText>
  <Explanation>
    Aceast&#259; comand&#259; necesit&#259; parametrul specificat.
  </Explanation>
  <UserResponse>
    Re&#238;ncerca&#355;i comanda &#351;i specifica&#355;i parametrul solicitat.
  </UserResponse>
</Message>
<Message ID="CWSAJ0039I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0039I" varFormat="Java">
    EBAADMIN0039I=CWSAJ0039I: Cadrele de lucru valide sunt:
  </MsgText>
  <Explanation>
    Acest mesaj este doar cu scop informativ.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0023E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0023E" varFormat="Java">
    EBAADMIN0023E=CWSAJ0023E: Urm&#259;toarele bundle-uri pe care Composite Bundle Archive, {0} le solicit&#259; nu pot fi g&#259;site &#238;n magazia intern&#259; de bundle-uri: {1}.
  </MsgText>
  <Explanation>
    Un Composite Bundle Archive poate fi implementat doar dac&#259; toate dependen&#355;ele pot fi g&#259;site &#238;n magazia bundle intern&#259;.
  </Explanation>
  <UserResponse>
    Asigura&#355;i-v&#259; c&#259; dependen&#355;ele Composite Bundle Archive listate sunt fie &#238;n Composite Bundle Archive, fie instalate &#238;n magazia bundle intern&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAJ0078E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_RESOLVE_FAILED" varFormat="Java">
    ADD_RESOLVE_FAILED=CWSAJ0078E: A ap&#259;rut o problem&#259; de rezolu&#355;ie &#238;n timpul ad&#259;ug&#259;rii unei extensii la unitatea de compozi&#355;ie {0}. Excep&#355;ia este: {1}
  </MsgText>
  <Explanation>
    Sistemul nu poate rezolva extensia selectat&#259; &#238;n leg&#259;tur&#259; cu implementarea curent&#259; a asetului. Bundle-urile ar putea avea dependen&#355;e lips&#259;, ar putea fi incompatibile sau ar putea s&#259; nu existe.
  </Explanation>
  <UserResponse>
    Inspecta&#355;i eroarea. Face&#355;i orice modific&#259;ri necesare asetului &#351;i extensiei, apoi reaplica&#355;i extensia.
  </UserResponse>
</Message>
<Message ID="CWSAJ0003E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0003E" varFormat="Java">
    EBAADMIN0003E=CWSAJ0003E: Magazia de bundle-uri de la {0} este definit&#259; deja cu numele {1}.
  </MsgText>
  <Explanation>
    O &#238;ncercare de a defini o nou&#259; magazie bundle a fost f&#259;cut&#259;, dar o alt&#259; magazie bundle folose&#351;te URL-ul specificat.
  </Explanation>
  <UserResponse>
    Specifica&#355;i un alt URL.
  </UserResponse>
</Message>
<Message ID="CWSAJ0019E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0019E" varFormat="Java">
    EBAADMIN0019E=CWSAJ0019E: S-a produs o eroare intern&#259;. &#206;ncercare de generare a unui obiect AriesApplicationModel dintr-un URL non-fi&#351;ier {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0062E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0062E" varFormat="Java">
    EBAADMIN0062E=CWSAJ0062E: Nu poate s&#259; g&#259;seasc&#259; asetul EBA {0}.
  </MsgText>
  <Explanation>
    A&#355;i importat un manifest de implementare c&#259;tre un aset, dar asetul EBA nu exist&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; asetul EBA este instalat.
  </UserResponse>
</Message>
<Message ID="CWSAJ0042I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0042I" varFormat="Java">
    EBAADMIN0042I=CWSAJ0042I: Oprire bundle {0}.
  </MsgText>
  <Explanation>
    Acest mesaj este doar cu scop informativ.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0079E" severity="E" prefix="yes">
  <MsgText pgmKey="REMOVE_RESOLVE_FAILED" varFormat="Java">
    REMOVE_RESOLVE_FAILED=CWSAJ0079E: A ap&#259;rut o problem&#259; de rezolu&#355;ie &#238;n timpul &#238;nl&#259;tur&#259;rii unei extensii din unitatea de compozi&#355;ie {0}. Excep&#355;ia este: {1}
  </MsgText>
  <Explanation>
    Sistemul nu poate rezolva extensia selectat&#259; &#238;n leg&#259;tur&#259; cu implementarea curent&#259; a asetului. Bundle-urile ar putea avea dependen&#355;e lips&#259;, ar putea fi incompatibile sau ar putea s&#259; nu existe.
  </Explanation>
  <UserResponse>
    Inspecta&#355;i eroarea. Face&#355;i orice modific&#259;ri necesare asetului apoi &#238;nl&#259;tura&#355;i, ca set, extensia &#351;i orice alte extensii interdependente.
  </UserResponse>
</Message>
<Message ID="CWSAJ0058E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0058E" varFormat="Java">
    EBAADMIN0058E=CWSAJ0058E: Manifestul de implementare de importat nu este valid pentru asetul {0} deoarece nu &#238;ndepline&#351;te cerin&#355;ele din manifestul aplica&#355;iei.
  </MsgText>
  <Explanation>
    Manifestul de implementare, DEPLOYMENT.MF, nu este compatibil cu manifestul de aplica&#355;ie, APPLICATION.MF, al asetului.
  </Explanation>
  <UserResponse>
    Verifica&#355;i noul manifest de implementare pentru urm&#259;toarele:
   1. Application-SymbolicName &#351;i Application-Version din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; se potriveasc&#259; cu intr&#259;rile din fi&#351;ierul APPLICATION.MF.
   2. Bundle-urile listate &#238;n antetul Deployed-Content din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; se potriveasc&#259; cu bundle-urile listate &#238;n antetulApplication-Content din fi&#351;ierul APPLICATION.MF.
   3. Versiunea bundle-ului din antetul Deployed-Content al fi&#351;ierului DEPLOYMENT.MF trebuie s&#259; fie &#238;n gama versiunii corespunz&#259;toare bundle-ului din fi&#351;ierul APPLICATION.MF.
   4. Bundle-urile listate &#238;n antetul Deployed-Use-Bundle din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; fie, de asemenea, listate &#238;n antetul Use-Bundle din fi&#351;ierul APPLICATION.MF.
   5. Versiunea bundle-ului din antetul Deployed-Use-Bundle al fi&#351;ierului DEPLOYMENT.MF trebuie s&#259; fie &#238;n gama versiunii corespunz&#259;toare bundle-ului din antetul Use-Bundle al fi&#351;ieruli APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0022E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0022E" varFormat="Java">
    EBAADMIN0022E=CWSAJ0022E: Composite Bundle Archive, {0} are o dependen&#355;&#259; de implementare de alt&#259; Composite Bundle Archive, {1}.
  </MsgText>
  <Explanation>
    Imbricarea Composite Bundle Archives nu este suportat&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; Composite Bundle Archive depinde doar de bundle-urile din antetul CompositeBundle-Content al Composite Bundle Archive.
  </UserResponse>
</Message>
<Message ID="CWSAJ0038E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0038E" varFormat="Java">
    EBAADMIN0038E=CWSAJ0038E: Nu poate s&#259; se conecteze la un cadru de lucru cu numele cadru de lucru {0}, nume nod {1} &#351;i nume server {2}.
  </MsgText>
  <Explanation>
    Un cadru de lucru cu atributele specificate nu poate fi g&#259;sit.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; atributele cadrului de lucru sunt valide &#351;i re&#238;ncerca&#355;i comanda.
  </UserResponse>
</Message>
<Message ID="CWSAJ0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0002E" varFormat="Java">
    EBAADMIN0002E=CWSAJ0002E: O magazie de bundle-uri cu numele {0} exist&#259; deja.
  </MsgText>
  <Explanation>
    O &#238;ncercare de a defini o nou&#259; magazie bundle a fost f&#259;cut&#259;, dar numele specificat este deja utilizat.
  </Explanation>
  <UserResponse>
    Specifica&#355;i un alt nume.
  </UserResponse>
</Message>
<Message ID="CWSAJ0018E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0018E" varFormat="Java">
    EBAADMIN0018E=CWSAJ0018E: Nu este posibil s&#259; modela&#355;i Aries application {0} deoarece unele dintre componentele sale cerute &#238;nc&#259; sunt descarcate.
  </MsgText>
  <Explanation>
    Unul sau mai multe bundle-uri pe care aplica&#355;ia le necesit&#259; se descarc&#259;. Aplica&#355;ia nu poate fi modelat&#259; p&#226;n&#259; c&#226;nd nu s-au finalizat toate desc&#259;rc&#259;rile.
  </Explanation>
  <UserResponse>
    A&#351;tepta&#355;i p&#226;n&#259; c&#226;nd bundle-urile necesare sunt desc&#259;rcate, apoi &#238;ncerca&#355;i din nou.
  </UserResponse>
</Message>
<Message ID="CWSAJ0081E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0081E" varFormat="Java">
    EBAADMIN0081E=CWSAJ0081E: Nu se poate ad&#259;uga extensie(ii) deoarece unitatea de compozi&#355;ie este implementat&#259; pe urm&#259;toarele &#355;inte, care nu suport&#259; extensie de aplica&#355;ie: {0}
  </MsgText>
  <Explanation>
    &#354;intele pe care este implementat&#259; unitatea de compozi&#355;ie nu suport&#259; toate func&#355;ionalitatea extensie de aplica&#355;ie.
  </Explanation>
  <UserResponse>
    Asigura&#355;i-v&#259; c&#259; unitatea de compozi&#355;ia la care dori&#355;i s&#259; ad&#259;uga&#355;i extensii este implementat&#259; pe &#355;inte care suport&#259; func&#355;ionalitatea extensie de aplica&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAJ0061E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0061E" varFormat="Java">
    EBAADMIN0061E=CWSAJ0061E: Nu poate s&#259; creeze structura directorului {0}.
  </MsgText>
  <Explanation>
    Directorul nu poate fi creat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; exist&#259; spa&#355;iu de stocare &#351;i c&#259; produsul are permisiunile necesare cre&#259;rii directorului.
  </UserResponse>
</Message>
<Message ID="CWSAJ0077E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0077E" varFormat="Java">
    EBAADMIN0077E=CWSAJ0077E: Numele simbolic {0} &#351;i versiunea {1} nu se potrivesc cu nici o extensie existent&#259;.
  </MsgText>
  <Explanation>
    Nu exist&#259; extensii pe unitatea de compozi&#355;ie care s&#259; se potriveasc&#259; cu numele simbolic &#351;i versiunea specificate.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0041E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0041E" varFormat="Java">
    EBAADMIN0041E=CWSAJ0041E: Bundle-ul {0} nu poate fi pornit. Este momentan &#238;n starea {1}.
  </MsgText>
  <Explanation>
    Bundle-ul nu poate fi pornit.
  </Explanation>
  <UserResponse>
    Referi&#355;i-v&#259; la mesajul de eroare &#238;nso&#355;itor pentru mai multe informa&#355;ii despre de ce nu poate porni acest bundle.
  </UserResponse>
</Message>
<Message ID="CWSAJ0057E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0057E" varFormat="Java">
    EBAADMIN0057E=CWSAJ0057E: Manifestul de implementare de importat nu poate fi rezolvat. Cerin&#355;ele nesatisf&#259;cute sunt {0}.
  </MsgText>
  <Explanation>
    Manifestul de implementare, DEPLOYMENT.MF, care trebuie importat are o cerin&#355;&#259; ce nu poate fi satisf&#259;cut&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; noul manifest de implementare este complet &#351;i include bundle-urile necesare pentru rezolvarea asetului EBA.
  </UserResponse>
</Message>
<Message ID="CWSAJ0021E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0021E" varFormat="Java">
    EBAADMIN0021E=CWSAJ0021E: A ap&#259;rut o problem&#259; la procesarea manifestului pentru Composite Bundle Archive, {0}.
  </MsgText>
  <Explanation>
    Fie manifestul nu este prezent, fie numele sau formatul nu sunt corecte.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; manifestul este prezent &#351;i formatat &#351;i numit corect.
  </UserResponse>
</Message>
<Message ID="CWSAJ0037E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0037E" varFormat="Java">
    EBAADMIN0037E=CWSAJ0037E: Nu poate s&#259; se conecteze la un cadru de lucru cu ID-ul {0}.
  </MsgText>
  <Explanation>
    Un cadru de lucru cu ID-ul specificat nu poate fi g&#259;sit.
  </Explanation>
  <UserResponse>
    Verfica&#355;i dac&#259; ID-ul cadrului de lucru este valid &#351;i re&#238;ncerca&#355;i comanda.
  </UserResponse>
</Message>
<Message ID="CWSAJ0083W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAJ0083W: Arhiva CBA (Composite Bundle Archive) {0} export&#259; servicii care nu sunt furnizate de bundle-urile con&#355;inute &#238;n CBA. Aceste servicii nu vor fi disponibile pentru folosire &#238;nafara arhivei CBA. Urm&#259;toarele probleme au fost raportate {1}
  </MsgText>
  <Explanation>
    O arhiv&#259; CBA nu poate exporta servicii pentru care nu exist&#259; declara&#355;ie Blueprint sau antetul Bundle-ExportService: pe unul din bundle-urile din CBA.
  </Explanation>
  <UserResponse>
    Fie ad&#259;uga&#355;i declara&#355;iile de servicii Blueprint lips&#259; la con&#355;inutul CBA, fie &#238;nl&#259;tura&#355;i detaliile exporturilor nesatisf&#259;cute din manifestul compozi&#355;iei, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAJ0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0001E" varFormat="Java">
    EBAADMIN0001E=CWSAJ0001E: Parametrul nume nu a fost specificat &#351;i este cerut.
  </MsgText>
  <Explanation>
    Comanda necesit&#259; ca numele parametrului s&#259; fie specificat.
  </Explanation>
  <UserResponse>
    Relansa&#355;i comanda specific&#226;nd numele.
  </UserResponse>
</Message>
<Message ID="CWSAJ0017E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0017E" varFormat="Java">
    EBAADMIN0017E=CWSAJ0017E: Parametrul URL nu a fost specificat &#351;i este cerut.
  </MsgText>
  <Explanation>
    Parametrul URL este necesar pentru comanda addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    Relansa&#355;i comanda &#351;i specifica&#355;i URL-ul magaziei bundle externe.
  </UserResponse>
</Message>
<Message ID="CWSAJ0060E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0060E" varFormat="Java">
    EBAADMIN0060E=CWSAJ0060E: Nu poate s&#259; creeze structura directorului {0}.
  </MsgText>
  <Explanation>
    A&#355;i &#238;ncercat s&#259; exporta&#355;i un manifest de implementare c&#259;tre un director care nu exist&#259;, iar structura directorului nu poate fi creat&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; exist&#259; spa&#355;iu de stocare &#351;i c&#259; produsul are permisiunile necesare cre&#259;rii directorului.
  </UserResponse>
</Message>
<Message ID="CWSAJ0076E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0076E" varFormat="Java">
    EBAADMIN0076E=CWSAJ0076E: Numele simbolic {0} &#351;i versiunea {1} nu se potrivesc extensiilor disponibile &#238;n oricare magazie bundle disponibil&#259;.
  </MsgText>
  <Explanation>
    Nu exist&#259; nici un bundle compus cu numele simbolic &#351;i versiunea specificate &#238;n nici o  magazie disponibil&#259; mediului.
  </Explanation>
  <UserResponse>
    Fie ad&#259;uga&#355;i bundle-ul compus la o magazie disponibil&#259;, fie selecta&#355;i un bundle compus diferit pentru ad&#259;ugare ca extensie.
  </UserResponse>
</Message>
<Message ID="CWSAJ0040I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0040I" varFormat="Java">
    EBAADMIN0040I=CWSAJ0040I: Pornire bundle {0}.
  </MsgText>
  <Explanation>
    Acest mesaj este doar cu scop informativ.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0056E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0056E" varFormat="Java">
    EBAADMIN0056E=CWSAJ0056E: S-a produs o eroare intern&#259;. Procesul de rezolvare nu genereaz&#259; o list&#259; de bundle-uri care s&#259; fie instalate.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0036I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0036I" varFormat="Java">
    EBAADMIN0036I=CWSAJ0036I: S-a conectat cu succes la cadrul de lucru {0}.
  </MsgText>
  <Explanation>
    Acest mesaj este doar cu scop informativ.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0020E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0020E" varFormat="Java">
    EBAADMIN0020E=CWSAJ0020E: A ap&#259;rut o eroare intern&#259; la extragerea bundle-ului {0} din Composite Bundle Archive, {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0016E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0016E" varFormat="Java">
    EBAADMIN0016E=CWSAJ0016E: Parametrul nume nu a fost specificat &#351;i este cerut.
  </MsgText>
  <Explanation>
    Numele parametrului este necesar pentru comanda addExternalBundleRepository.
  </Explanation>
  <UserResponse>
    Relansa&#355;i comanda &#351;i specifica&#355;i numele magaziei bundle externe.
  </UserResponse>
</Message>
<Message ID="CWSAJ0075E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0075E" varFormat="Java">
    EBAADMIN0075E=CWSAJ0075E: Extensia cu numele simbolic {0} &#351;i versiunea {1} au fost deja ad&#259;ugate la unitatea de compozi&#355;ie.
  </MsgText>
  <Explanation>
    Aceast&#259; extensie este inclus&#259; &#238;n unitatea de compozi&#355;ie.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0055E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0055E" varFormat="Java">
    EBAADMIN0055E=CWSAJ0055E: Con&#355;inutul manifestului de implementare nu este corect. Urm&#259;toarele bundle-uri sunt redundante: {0}.
  </MsgText>
  <Explanation>
    Manifestul de implementare, DEPLOYMENT.MF, care trebuie importat include bundle-uri care nu sunt necesare s&#259; rezolve asetul EBA.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; noul manifest de implementare nu include bundle-urile care sunt listate &#238;n mesaj.
  </UserResponse>
</Message>
<Message ID="CWSAJ0035I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0035I" varFormat="Java">
    EBAADMIN0035I=CWSAJ0035I: Conectarea la cadrul de lucru {0} &#238;n nodul {1} &#351;i serverul {2}.
  </MsgText>
  <Explanation>
    Sunte&#355;i deja conectat la cadrul de lucru.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0015E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0015E" varFormat="Java">
    EBAADMIN0015E=CWSAJ0015E: S-a produs o eroare intern&#259;. &#206;ncercare de generare a unui obiect AriesApplicationModel dintr-un manifest nul de implementare.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAJ0074E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0074E" varFormat="Java">
    EBAADMIN0074E=CWSAJ0074E: Versiunea parametrului nu a fost specificat&#259; &#351;i este cerut&#259;.
  </MsgText>
  <Explanation>
    Comanda necesit&#259; ca versiunea parametrului s&#259; fie specificat&#259;.
  </Explanation>
  <UserResponse>
    Relansa&#355;i comanda specific&#226;nd versiunea.
  </UserResponse>
</Message>
<Message ID="CWSAJ0054E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0054E" varFormat="Java">
    EBAADMIN0054E=CWSAJ0054E: Con&#355;inutul manifestului de implementare nu este corect. Urm&#259;toarele bundle-uri suplimentare sunt necesare {0}.
  </MsgText>
  <Explanation>
    Manifestul de implementare, DEPLOYMENT.MF, care trebuie importat nu include toate bundle-urile necesare rezolv&#259;rii asetului EBA.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; noul manifest de implementare include toate bundle-urile care sunt listate &#238;n mesaj.
  </UserResponse>
</Message>
<Message ID="CWSAJ0034I" severity="I" prefix="yes">
  <MsgText pgmKey="EBAADMIN0034I" varFormat="Java">
    EBAADMIN0034I=CWSAJ0034I: Bundle-ul {0} s-a oprit cu succes.
  </MsgText>
  <Explanation>
    Acest mesaj este doar cu scop informativ.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune.
  </UserResponse>
</Message>
<Message ID="CWSAJ0014E" severity="E" prefix="yes">
  <MsgText pgmKey="EBAADMIN0014E" varFormat="Java">
    EBAADMIN0014E=CWSAJ0014E: S-a produs o eroare intern&#259;. &#206;ncercare de generare a unui obiect AriesApplicationModel dintr-un manifest nul de aplica&#355;ie.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
