<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.jpa.wab.integration/src/com/ibm/ws/eba/jpa/wab/integration/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAF2005E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EMF" varFormat="Java">
    INVALID_FILTER_EMF=CWSAF2005E: S-a produs o eroare intern&#259;. Un filtru serviciu nu poate fi parsat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    -CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_WAB_BUNDLE_CONTEXT" varFormat="Java">
    NO_WAB_BUNDLE_CONTEXT=CWSAF2003E: S-a produs o eroare intern&#259;. Aplica&#355;ia OSGi {0} la versiunea {1} nu este &#238;ntr-o stare valid&#259; pentru a cere resurse.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    -CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2004E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_FILTER_EM" varFormat="Java">
    INVALID_FILTER_EM=CWSAF2004E: S-a produs o eroare intern&#259;. Un filtru serviciu nu poate fi parsat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    -CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2007W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_CONTEXTS" varFormat="Java">
    MULTIPLE_PERSISTENCE_CONTEXTS=CWSAF2007W: Multiple contexturi de persisten&#355;&#259; cu numele {0} au fost g&#259;site de c&#259;tre bundle-ul web {1} la versiune {2}.
  </MsgText>
  <Explanation>
    Containerul OSGi JPA a g&#259;sit mai multe contexturi de persisten&#355;&#259; cu acela&#351;i nume. Aceasta nu este o configura&#355;ie valid&#259; &#351;i ar putea conduce la rezultate incompatibile.
  </Explanation>
  <UserResponse>
    Modifica&#355;i aplica&#355;ia OSGi astfel &#238;nc&#226;t s&#259; nu mai con&#355;in&#259; bundle-uri care definesc mai multe contexturi de persisten&#355;&#259; cu acela&#351;i nume.
  </UserResponse>
</Message>
<Message ID="CWSAF2001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXTENDED_SCOPE_UNSUPPORTED" varFormat="Java">
    EXTENDED_SCOPE_UNSUPPORTED=CWSAF2001E: Un bundle web OSGi {0} la versiune {1} define&#351;te o dependen&#355;&#259; de contextul de persisten&#355;&#259; JPA gestionat {2} cu domeniu extins. Contextele de persisten&#355;&#259; cu scop extins nu sunt suportate de containerul OSGi JPA.
  </MsgText>
  <Explanation>
    O aplica&#355;ie a declarat o dependen&#355;&#259; pe un context de dependen&#355;&#259; cu scop extins JPA, dar contextele de persisten&#355;&#259; cu scop extins nu sunt suportate &#238;n containerul OSGi JPA.
  </Explanation>
  <UserResponse>
    Modifica&#355;i aplica&#355;ia pentru a utiliza fie aplica&#355;ia gestionat&#259; sau contextele de persisten&#355;&#259; cu scop de tranzac&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAF2002E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_PCP" varFormat="Java">
    UNABLE_TO_LOCATE_PCP=CWSAF2002E: S-a produs o eroare intern&#259;. Mediul runtime de aplica&#355;ii OSGi nu a putut ini&#355;ializa suportul de context de persisten&#355;&#259;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    -CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAF2006W" severity="W" prefix="yes">
  <MsgText pgmKey="MULTIPLE_PERSISTENCE_UNITS" varFormat="Java">
    MULTIPLE_PERSISTENCE_UNITS=CWSAF2006W: Mai multe unit&#259;&#355;i de persisten&#355;&#259; cu numele {0} au fost g&#259;site de bundle-ul web {1} la versiunea {2}.
  </MsgText>
  <Explanation>
    Containerul OSGi JPA a g&#259;sit mai multe unit&#259;&#355;i de persisten&#355;&#259; cu acela&#351;i nume. Aceasta nu este o configura&#355;ie valid&#259; &#351;i ar putea conduce la rezultate incompatibile.
  </Explanation>
  <UserResponse>
    Modifica&#355;i aplica&#355;ia OSGi ca ea s&#259; nu mai con&#355;in&#259; bundle-uricare definesc mai multe unit&#259;&#355;i de persisten&#355;&#259; cu acela&#351;i nume.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
