<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/css" href="../../resources/stylesheets/wasmsgxml.css"?>
<TMSSource name="TivoliMessages" tmsVersion="1.0" xml:lang="en">
<!-- CMVC MSG File Name = /com.ibm.ws.eba.bla/src/com/ibm/ws/eba/bla/nls/Messages.nlsprops -->
<!-- DO NOT EDIT THIS FILE - This file was generated by the XML/Html & Property emitter -->
<!-- BEGIN MESSAGES -->
<Message ID="CWSAL0063E" severity="E" prefix="yes">
  <MsgText pgmKey="SUSPECTED_CIRCULAR_DEPENDENCIES" varFormat="Java">
    SUSPECTED_CIRCULAR_DEPENDENCIES=CWSAL0063E: Rezolu&#355;ia asetului {0} indic&#259; dependen&#355;e nevalide de con&#355;inutul partajat &#238;n con&#355;inutul aplica&#355;iei: {1}
  </MsgText>
  <Explanation>
    Bundle-urile aplica&#355;ie nu pot furniza pachete sau servicii la bundle-urile partajate. Mai mult, bundle-urile nu au voie s&#259; fie implementate at&#226;t ca bundle-uri partajate &#351;i ca bundle-uri de aplica&#355;ii. Orice implementare care necesit&#259; bundle-uri partajate care depind de bundle-uri aplica&#355;ie nu este valid&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; toate bundle-urile partajate invalide sunt necesare de aplica&#355;ie. Dac&#259; e a&#351;a, asigura&#355;i-v&#259; c&#259; nu depind de con&#355;inutul aplica&#355;iei.
  </UserResponse>
</Message>
<Message ID="CWSAL0006E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_JAR_RESOURCE" varFormat="Java">
    EXCEPTION_READING_JAR_RESOURCE=CWSAL0006E: Nu poate citi manifestul bundle-ului pentru fi&#351;ierul JAR {0} din fi&#351;ierul EBA {1}.
  </MsgText>
  <Explanation>
    O excep&#355;ie IOException a ap&#259;rut c&#226;nd se localiza manifestul unui fi&#351;ier JAR dintr-un fi&#351;ier EBA. Fi&#351;ierul poate fi corupt sau ilizibil.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; fi&#351;ierul are permisiunile corespunz&#259;toare &#351;i c&#259; este &#238;n formatul corect.
  </UserResponse>
</Message>
<Message ID="CWSAL0017E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONER_SERVICE_UNAVAILABLE" varFormat="Java">
    PROVISIONER_SERVICE_UNAVAILABLE=CWSAL0017E: A survenit o eroare intern&#259;. Serviciul de provizioner {0} nu este disponibil.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0078E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_START_FAILED" varFormat="Java">
    APP_START_FAILED=CWSAL0078E: Aplica&#355;ia OSGi implementat&#259; &#238;ntr-o unitate de compozi&#355;ie {0} din aplica&#355;ia de nivel opera&#355;ional {1} nu a pornit.
  </MsgText>
  <Explanation>
    A ap&#259;rut o excep&#355;ie &#238;n timpul opera&#355;iei de pornire.
  </Explanation>
  <UserResponse>
    Inspecta&#355;i &#238;nregistr&#259;rile &#238;n istoric ale serverului anterioare acestei excep&#355;ii pentru diagnoze problem&#259; mai exacte.
  </UserResponse>
</Message>
<Message ID="CWSAL0061E" severity="E" prefix="yes">
  <MsgText pgmKey="FORBIDDEN_ROOT_ENTRY" varFormat="Java">
    FORBIDDEN_ROOT_ENTRY=CWSAL0061E: Fi&#351;ierul EBA (enterprise bundle archive) {1} con&#355;ine directorul {0}, care nu este suportat.
  </MsgText>
  <Explanation>
    Fi&#351;ierul EBA specificat con&#355;ine un director denumit byValue sau byReference. Nici unul dintre aceste nume de directoare nu este suportat &#238;n directorul r&#259;d&#259;cin&#259; al unui fi&#351;ier EBA.
  </Explanation>
  <UserResponse>
    &#206;nl&#259;tura&#355;i sau redenumi&#355;i directorul relevant.
  </UserResponse>
</Message>
<Message ID="CWSAL0040E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_ROLE" varFormat="Java">
    INVALID_ROLE=CWSAL0040E: Rolul specificat {0} nu exist&#259;.
  </MsgText>
  <Explanation>
    &#206;ncercare de mapare a utilizatorilor sau grupurilor c&#259;tre un rol de securitate care nu exist&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; rolul de securitate specificat exist&#259; sau crea&#355;i rolul &#238;n aplica&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAL0067E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_DOES_NOT_MEET_REQS" varFormat="Java">
    DEPLOYMENT_MF_DOES_NOT_MEET_REQS=CWSAL0067E: Manifestul de implementare de importat nu este valid pentru asetul {0} deoarece nu &#238;ndepline&#351;te cerin&#355;ele din manifestul aplica&#355;iei.
  </MsgText>
  <Explanation>
    Manifestul de implementare, DEPLOYMENT.MF, nu este compatibil cu manifestul de aplica&#355;ie, APPLICATION.MF, al asetului.
  </Explanation>
  <UserResponse>
    Verifica&#355;i noul manifest de implementare pentru urm&#259;toarele:
   1. Application-SymbolicName &#351;i Application-Version din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; se potriveasc&#259; cu intr&#259;rile din fi&#351;ierul APPLICATION.MF.
   2. Bundle-urile listate &#238;n antetul Deployed-Content din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; se potriveasc&#259; cu bundle-urile listate &#238;n antetulApplication-Content din fi&#351;ierul APPLICATION.MF.
   3. Versiunea bundle-ului din antetul Deployed-Content al fi&#351;ierului DEPLOYMENT.MF trebuie s&#259; fie &#238;n gama versiunii corespunz&#259;toare bundle-ului din fi&#351;ierul APPLICATION.MF.
   4. Bundle-urile listate &#238;n antetul Deployed-Use-Bundle din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; fie, de asemenea, listate &#238;n antetul Use-Bundle din fi&#351;ierul APPLICATION.MF.
   5. Versiunea bundle-ului din antetul Deployed-Use-Bundle din fi&#351;ierul DEPLOYMENT.MF trebuie s&#259; fie din intervalul de versiuni pentru bundle-ul corespunz&#259;tor din antetul Use-Bundle din fi&#351;ierul APPLICATION.MF.
 Nu edita&#355;i manual manifestul de implementare. Dac&#259; este necesar, &#238;nl&#259;tura&#355;i manifestul de implementare din EBA. Aceasta va cauza generarea unui fi&#351;ier manifest de implementare nou c&#226;nd EBA este importat.
  </UserResponse>
</Message>
<Message ID="CWSAL0031E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_RESOLVE_FAILED" varFormat="Java">
    UPDATE_RESOLVE_FAILED=CWSAL0031E: Versiunile selectate ale bundle-ului nu pot fi rezolvate &#351;i nu sunt compatibile.
  </MsgText>
  <Explanation>
    Sistemul nu poate rezolva versiunile selectate ale bundle-ului. Bundle-urile pot avea dependen&#355;e lips&#259;, pot fi incompatibile sau nu exist&#259;.
  </Explanation>
  <UserResponse>
    Modifica&#355;i setul selectat de bundle-uri de intrare &#351;i &#238;ncerca&#355;i din nou. Pute&#355;i folosi consola administrativ&#259; pentru vizualizarea sau previzualizarea st&#259;rii patrimoniului.
  </UserResponse>
</Message>
<Message ID="CWSAL0084E" severity="E" prefix="yes">
  <MsgText pgmKey="USER_NOT_IN_ROLE" varFormat="Java">
    USER_NOT_IN_ROLE=CWSAL0084E: Utilizatorul {0}, nu este un utilizator mapat sau un membru al unui grup mapat pentru rolul {1}.
  </MsgText>
  <Explanation>
    Orice utilizator specificat trebuie ori s&#259; fie un utilizator mapat pe un rol de securitate ori s&#259; fie un membru al unui grup mapat pe un rol de securitate. Utilizatorul specificat nu a &#238;ndeplinit nici una dintre aceste cerin&#355;e.
  </Explanation>
  <UserResponse>
    Fie configura&#355;i rolul de securitate la map&#259;ri utilizator/grup s&#259; permit&#259; utilizatorului specificat s&#259; ac&#355;ioneze &#238;n rolul specificat, fie specifica&#355;i un utilizator diferit care are deja permisiunile necesare.
  </UserResponse>
</Message>
<Message ID="CWSAL0097W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_IN_APP_CONTENT_MIXED_VERSION" varFormat="Java">
    CBA_IN_APP_CONTENT_MIXED_VERSION=CWSAL0097W: Aplica&#355;ia {0} con&#355;ine unul sau mai multe CBA-uri (composite bundle archives) {1} &#238;n Application-Content-ul s&#259;u. Aceasta nu este suportat&#259; pe pe WebSphere Application Server Versiune 7 OSGi Applications Feature Pack.
  </MsgText>
  <Explanation>
    CBA-urile sunt suportate &#238;n Application-Content pentru WebSphere Application Server Versiune 8 &#351;i versiuni ulterioare.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune. Dac&#259; aplica&#355;ia trebuie s&#259; ruleze pe WebSphere Application Server Versiune 7 OSGi Applications Feature Pack, rescrie&#355;i aplica&#355;ia astfel &#238;nc&#226;t s&#259; nu existe CBA-uri &#238;n Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0002E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APP_MANIFEST" varFormat="Java">
    EXCEPTION_READING_APP_MANIFEST=CWSAL0002E: A ap&#259;rut IOException la citirea fi&#351;ierului manifest de aplica&#355;ie din arhiva de bundle de &#238;ntreprindere (EBA) {0}. Fi&#351;ierul ar putea fi invalid, deteriorat sau nu se poate citi.
  </MsgText>
  <Explanation>
    O excep&#355;ie IOException a ap&#259;rut c&#226;nd se citea fi&#351;ierul manifest de aplica&#355;ie EBA. Fi&#351;ierul ar putea fi invalid, deteriorat sau nu se poate citi.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; fi&#351;ierul manifest de aplica&#355;ie, APPLICATION.MF, urmeaz&#259; specifica&#355;ia pentru fi&#351;ierele manifest.
  </UserResponse>
</Message>
<Message ID="CWSAL0033E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PLUGIN_CONFIG_FILE_URI" varFormat="Java">
    INVALID_PLUGIN_CONFIG_FILE_URI=CWSAL0033E: A survenit o eroare intern&#259;. Plug-in-ul Config File URI nu este &#238;n formatul a&#351;teptat {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0016E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_WRONG_VERSION_EXCEPTION" varFormat="Java">
    PROVISIONING_WRONG_VERSION_EXCEPTION=CWSAL0016E: A survenit o eroare intern&#259;. Un rezultat incorect a fost returnat &#238;n timpul provizion&#259;rii fi&#351;ierului EBA{0}, era de a&#351;teptat ca versiunea maxim&#259; {1} s&#259; fie aceea&#351;i cu versiunea minim&#259; {2}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0095W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_V8_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_V8_MIXED_VERSION=CWSAL0095W: Aplica&#355;ia {0} nu a putut fi provizionat&#259; pentru toate nodurile din celul&#259;. Aplica&#355;ia poate fi implementat&#259; doar pe noduri Versiune 7 care ruleaz&#259; OSGi Applications Feature Pack. Eroarea de rezolu&#355;ie a fost {1}.
  </MsgText>
  <Explanation>
    Aplica&#355;ia care este importat&#259; a fost provizionat&#259; cu succes &#238;mpotriva WebSphere Application Server Version 7 OSGi Applications Feature Pack, dar nu a putut fi provizionat&#259; &#238;mpotriva  WebSphere Application Server Versiune 8.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune. Totu&#351;i, acest avertisment indic&#259; faptul c&#259; aplica&#355;ia ar putea con&#355;ine o cerin&#355;&#259; de versiune prea strict&#259;. Pute&#355;i utiliza informa&#355;iile din eroare de rezolu&#355;ie pentru a v&#259; ajuta modifica aplica&#355;ia astfel &#238;nc&#226;t s&#259; poat&#259; fi implementat&#259; nodurilor Versiune 8.
  </UserResponse>
</Message>
<Message ID="CWSAL0101E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_RUN_AS_ROLE_MIXED_VERSION=CWSAL0101E: Un membru cluster nu poate fi creat pe nodul {0} deoarece aplica&#355;ia(ile) OSGi {1} define&#351;te Rulare ca roluri.
  </MsgText>
  <Explanation>
    To&#355;i membrii clusterului trebuie s&#259; fie capabili s&#259; ruleze acelea&#351;i aplica&#355;ii, &#238;ns&#259; noul membru cluster nu poate suporta aplica&#355;ii OSGi cu Rulare ca roluri definit.
  </Explanation>
  <UserResponse>
    Selecta&#355;i un nod Versiune 8 care s&#259; g&#259;zduiasc&#259; membrul clusterului sau modifica&#355;i configura&#355;ia aplica&#355;iei(ilor) astfel &#238;nc&#226;t s&#259; nu mai defineasc&#259; Rulare ca roluri.
  </UserResponse>
</Message>
<Message ID="CWSAL0082E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_NAME_MATCHES_CONTENT" varFormat="Java">
    APP_NAME_MATCHES_CONTENT=CWSAL0082E: Manifestul de implementare pentru aplica&#355;ia {0} la versiunea {1} listeaz&#259; con&#355;inut cu acela&#351;i nume simbolic &#351;i versiune ca aplica&#355;ia.
  </MsgText>
  <Explanation>
    Aplica&#355;iile, bundle-urile &#351;i bundle-urile compuse &#238;mpart toate acela&#351;i spa&#355;iu de nume, astfel c&#259; trebuie s&#259; aib&#259; identificatori unici &#238;n interiorul spa&#355;iului de nume. La validarea implement&#259;rii aplica&#355;ie, mediul runtime a g&#259;sit o referin&#355;&#259; la un bundle cu acela&#351;i nume simbolic &#351;i versiune ca &#351;i aplica&#355;ia.
  </Explanation>
  <UserResponse>
    Corecta&#355;i numele simbolic al bundle-ului, al bundle-ului compus sau al aplica&#355;iei astfel &#238;nc&#226;t s&#259; nu mai existe un conflict &#238;n spa&#355;iul nume.
  </UserResponse>
</Message>
<Message ID="CWSAL0048E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES" varFormat="Java">
    INVALID_PACKAGE_REQUIREMENT_ATTRIBUTES=CWSAL0048E: Asetul {0} nu poate fi rezolvat. Atributul {1} pentru import al pachetului {2} nu poate fi satisf&#259;cut la implementare.
  </MsgText>
  <Explanation>
    Pentru bundle-urile listate &#238;n antetul Application-Content din APPLICATION.MF, toate importurile de pachete trebuie s&#259; aibe atribute care s&#259; poat&#259; fi satisf&#259;cute la implementare.
  </Explanation>
  <UserResponse>
    Schimba&#355;i &#238;mpachetarea configura&#355;iei aplica&#355;iei astfel &#238;nc&#226;t bundle-urile care sunt listate &#238;n antetulApplication-Content s&#259; aibe importuri de pachete care s&#259; fie satisf&#259;cute la implementare.
  </UserResponse>
</Message>
<Message ID="CWSAL0056E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_EXPANSION_LOCATION" varFormat="Java">
    UNABLE_TO_LOCATE_EXPANSION_LOCATION=CWSAL0056E: S-a produs o eroare intern&#259;. Nu se pot localiza datele de configurare necesare pentru a expanda {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0126E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLER_EXCEPTION_DEPLOYING_BUNDLE" varFormat="Java">
    MODELLER_EXCEPTION_DEPLOYING_BUNDLE=CWSAL0126E: O excep&#355;ie a survenit &#238;n timpul model&#259;rii bundle-ului {0}: {1}
  </MsgText>
  <Explanation>
    Excep&#355;ia specificat&#259; a survenit &#238;n timpul model&#259;rii bundle-ului specificat.
  </Explanation>
  <UserResponse>
    Studia&#355;i excep&#355;ia specificat&#259; pentru detalii ale problemei &#351;i rezolva&#355;i problema.
  </UserResponse>
</Message>
<Message ID="CWSAL0034E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_READ_WEB_XML" varFormat="Java">
    UNABLE_TO_READ_WEB_XML=CWSAL0034E: A survenit o eroare intern&#259;. Nu se poate g&#259;si fluxul InputStream pentru arhivarea web.xml Entry din War {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0124W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE" varFormat="Java">
    INVALID_MDB_LISTENER_AUTHALIAS_REFERENCE=CWSAL0124W: Niciun MDB Listener Auth Alias care s&#259; se potriveasc&#259; cu numele {0} nu a putut fi g&#259;sit la &#355;inta {1} pentru resursa utilizat&#259;de bean-ul {2} &#238;n bundle-ul {3} la versiunea {4}.
  </MsgText>
  <Explanation>
    Auth Alias specificat nu exist&#259;, sau nu este vizibil acestei aplica&#355;ii.
  </Explanation>
  <UserResponse>
    Configura&#355;i valoarea Alias autentificare necesar&#259; sau asigura&#355;i-v&#259; c&#259; este configurat&#259; &#238;n domeniul corect pentru aplica&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAL0044E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_SERVICE_DEPENDENCY=CWSAL0044E: Asetul {0} nu poate fi rezolvat. Necesit&#259; bundle-ul {1}, care nu este listat &#238;n antetul Application-Content din manifestul de aplica&#355;ie, APPLICATION.MF. Acest bundle consum&#259; serviciul {2} din bundle-ul {3}, care este listat &#238;n antetulApplication-Content.
  </MsgText>
  <Explanation>
    Aplica&#355;ia nu este configurat&#259; corect. Un bundle partajat nu poate consuma un serviciu dintr-un bundle izolat. Bundle-urile care sunt listate &#238;n antetul Application-Content sunt izolate &#351;i pot exporta servicii doar altor aplica&#355;ii prin mecanismul Application-ExportService.
  </Explanation>
  <UserResponse>
    Schimba&#355;i &#238;mpachetarea configura&#355;iei aplica&#355;iei astfel &#238;nc&#226;t bundle-urile care sunt listate &#238;n antetulUse-Bundle sau ad&#259;ugate de rezolver s&#259; nu necesite servicii furnizate de bundle-uri care sunt listate &#238;n antetul Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0037W" severity="W" prefix="yes">
  <MsgText pgmKey="BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    BUNDLE_DOWNLOAD_REQUESTED=CWSAL0037W: Asetul {0} necesit&#259; desc&#259;rc&#259;ri externe &#238;nainte s&#259; poat&#259; fi implementat la o unitate de compozi&#355;ie.
  </MsgText>
  <Explanation>
    Asetul nou sau actualizat necesit&#259; ca unul sau mai multe bundle-uri s&#259; fie desc&#259;rcate de la o magazie &#238;nainte s&#259; poat&#259; fi ad&#259;ugat la o unitate de compozi&#355;ie sau actualizat &#238;ntr-o unitate de compozi&#355;ie.
  </Explanation>
  <UserResponse>
    Pentru a porni procesl de desc&#259;rcare al bundle-ului, salva&#355;i-v&#259; modific&#259;rile la configura&#355;ia master. Pute&#355;i vizualiza status-ul de desc&#259;rcare a bundle-ului din patrimoniu de la panoul detaliat al patrimoniului din consola administrativ&#259;. Dup&#259; ce desc&#259;rc&#259;rile bundle-ului sunt finalizate, &#238;ncerca&#355;i din nou s&#259; ad&#259;uga&#355;i sau s&#259; actualiza&#355;i asetul &#238;ntr-o unitate de compozi&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAL0010E" severity="E" prefix="yes">
  <MsgText pgmKey="COULD_NOT_CONVERT_WAR" varFormat="Java">
    COULD_NOT_CONVERT_WAR=CWSAL0010E: Conversia fi&#351;ierului WAR {0} din fi&#351;ierul EBA {1} &#238;ntr-un fi&#351;ier WAB nu s-a finalizat cu succes.
  </MsgText>
  <Explanation>
    Fi&#351;ierele WAR (Web application archive) dintr-o un EBA (enterprise bundle archive) trebuie s&#259; fie convertite la WAB-uri (web application bundle-uri) &#238;nainte s&#259; poat&#259; fi implementate. Procesul de conversie nu s-a finalizat cu succes.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; fi&#351;ierul WAR este valid.
  </UserResponse>
</Message>
<Message ID="CWSAL0076E" severity="E" prefix="yes">
  <MsgText pgmKey="REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE" varFormat="Java">
    REPOSITORY_ADMIN_SUPPORT_UNAVAILABLE=CWSAL0076E: S-a produs o eroare intern&#259;. Serviciul RepositoryAdminSupport nu este disponibil din registrul serviciului OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0024E" severity="E" prefix="yes">
  <MsgText pgmKey="ALIAS_IN_INVALID_DOMAIN" varFormat="Java">
    ALIAS_IN_INVALID_DOMAIN=CWSAL0024E: Aliasul de autentificare {0} nu exist&#259; &#238;n domeniul de securitate {2} al &#355;intei {1}.
  </MsgText>
  <Explanation>
    Un alias de autentificare trebuie s&#259; existe &#238;n domeniul de securitate global sau destina&#355;ie atunci c&#226;nd referin&#355;ele resurs&#259; Blueprint sunt legate.
  </Explanation>
  <UserResponse>
    Selecta&#355;i un alias de autentificare ce exist&#259; &#238;n domeniul de securitate global sau destina&#355;ie sau crea&#355;i aliasul de autentificare dorit.
  </UserResponse>
</Message>
<Message ID="CWSAL0100E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_CBA_FAILURE_MIXED_VERSION=CWSAL0100E: Un membru cluster nu poate fi creat pe nodul {0} deoarece aplica&#355;ia(ile) OSGi {1} con&#355;in CBA-uri (composite bundle archives) &#238;n Application-Content.
  </MsgText>
  <Explanation>
    To&#355;i membrii clusterului trebuie s&#259; fie capabili s&#259; ruleze acelea&#351;i aplica&#355;ii, &#238;ns&#259; noul membru cluster nu poate suporta aplica&#355;ii OSGi cu CBA-uri &#238;n Application-Content.
  </Explanation>
  <UserResponse>
    Selecta&#355;i un nod Versiune 8 care s&#259; g&#259;zduiasc&#259; membrul clusterului sau modifica&#355;i aplica&#355;ia(ile) astfel &#238;nc&#226;t s&#259; nu mai con&#355;in&#259; CBA-uri &#238;n Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0091E" severity="E" prefix="yes">
  <MsgText pgmKey="NOT_AN_EBA_CU" varFormat="Java">
    NOT_AN_EBA_CU=CWSAL0091E: Unitatea de compozi&#355;ie {0} nu corespunde unei aplica&#355;ii OSGi.
  </MsgText>
  <Explanation>
    Opera&#355;ia invocat&#259; func&#355;ioneaz&#259; pe o unitate de compozi&#355;ie pentru o aplica&#355;ie OSGi. Unitatea de compozi&#355;ie selectat&#259; nu con&#355;ine o aplica&#355;ie OSGi.
  </Explanation>
  <UserResponse>
    Verifica&#355;i faptul c&#259; unitatea de compozi&#355;ie selectat&#259; este sus&#355;inut&#259; de un aset cu tipul aspect &quot;EBA,version=1.0&quot;.
  </UserResponse>
</Message>
<Message ID="CWSAL0032E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MISSING" varFormat="Java">
    DEPLOYMENT_MANIFEST_MISSING=CWSAL0032E: S-a produs o eroare intern&#259;. Nu s-a putut extrage manifestul de implementare din patrimoniul binar {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0074E" severity="E" prefix="yes">
  <MsgText pgmKey="MODELLED_RESOURCE_MANAGER_UNAVAILABLE" varFormat="Java">
    MODELLED_RESOURCE_MANAGER_UNAVAILABLE=CWSAL0074E: S-a produs o eroare intern&#259;. Serviciul ModelledResourceManager nu este disponibil din registrul serviciului OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_BUNDLE_ASSET_NOT_SUPPORTED" varFormat="Java">
    CBA_BUNDLE_ASSET_NOT_SUPPORTED=CWSAL0125E: A survenit o eroare intern&#259;. Bundle-ul CBA {0} la versiunea {1} nu poate fi modelat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    -CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0008W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_XML" varFormat="Java">
    NO_APPLICATION_XML=CWSAL0008W: Fi&#351;ierul descriptor al aplica&#355;iei Java EE nu a fost g&#259;sit &#238;n fi&#351;ierul EBA {0}. F&#259;r&#259; acest fi&#351;ier descriptor, r&#259;d&#259;cinile context pentru fi&#351;ierele WAR sunt setate la valorile implicite.
  </MsgText>
  <Explanation>
    Sistemul a procesat un WAR (web application archive) f&#259;r&#259; un fi&#351;ier descriptor de aplica&#355;ie asociat, application.xml, care define&#351;te r&#259;d&#259;cinile context. R&#259;d&#259;cinile context pentru fi&#351;ierul migrat WAR vor fi setate la valorile implicite.
  </Explanation>
  <UserResponse>
    Dac&#259; este necesar un fi&#351;ier descriptor de aplica&#355;ie, verifica&#355;i c&#259; este furnizat &#351;i &#238;mpachetat corect &#238;n fi&#351;ierul EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0064E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST" varFormat="Java">
    UNABLE_TO_OPEN_DEPLOYMENT_MANIFEST=CWSAL0064E: Nu poate s&#259; proceseze fi&#351;ierul manifest de implementare care a fost furnizat de aplica&#355;ia din aceast&#259; loca&#355;ie {0}.
  </MsgText>
  <Explanation>
    A fost f&#259;cut&#259; o &#238;ncercare de importare a unui EBA care con&#355;ine un fi&#351;ier manifest de implementare. Procesarea acestui fi&#351;ier nu a avut succes.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; serverul de aplica&#355;ii are permisiunea de a accesa fi&#351;ierul &#351;i verifica&#355;i dac&#259; fi&#351;ierul nu este corupt. Nu edita&#355;i manual manifestul de implementare. Dac&#259; este necesar, &#238;nl&#259;tura&#355;i manifestul de implementare din EBA. Aceasta cauzeaz&#259; ca un fi&#351;ier manifest de implementare &#238;mprosp&#259;tat s&#259; fie generat c&#226;nd este importat EBA-ul.
  </UserResponse>
</Message>
<Message ID="CWSAL0093E" severity="E" prefix="yes">
  <MsgText pgmKey="SERVICE_UNAVAILABLE" varFormat="Java">
    SERVICE_UNAVAILABLE=CWSAL0093E: S-a produs o eroare intern&#259;. Serviciul {0} nu este disponibil de la registrul de servicii OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0030E" severity="E" prefix="yes">
  <MsgText pgmKey="AJPS_COULD_NOT_CREATE_DIR" varFormat="Java">
    AJPS_COULD_NOT_CREATE_DIR=CWSAL0030E: Nu poate crea directorul {0}.
  </MsgText>
  <Explanation>
    Directorul specificat nu poate fi creat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; exist&#259; spa&#355;iu de stocare &#351;i dac&#259; produsul are permisiunile necesare cre&#259;rii directorului.
  </UserResponse>
</Message>
<Message ID="CWSAL0115E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_MODULE_TYPE" varFormat="Java">
    INVALID_MODULE_TYPE=CWSAL0115E: S-a produs o eroare intern&#259;. Modulul {0} a fost de tip nea&#351;teptat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0014E" severity="E" prefix="yes">
  <MsgText pgmKey="ERRORS_DURING_TRANSFORMATION" varFormat="Java">
    ERRORS_DURING_TRANSFORMATION=CWSAL0014E: Fi&#351;ier EBA {0} instalat cu erori.
  </MsgText>
  <Explanation>
    Validarea &#351;i instalarea fi&#351;ierului EBA (enterprise bundle archive) s-a finalizat cu erori.
  </Explanation>
  <UserResponse>
    Vede&#355;i mesajul de eroare &#238;nso&#355;itor din fi&#351;ierul SystemOut.log pentru informa&#355;ii ulterioare.
  </UserResponse>
</Message>
<Message ID="CWSAL0116E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_IMPOSSIBLE" varFormat="Java">
    EJB_DEFAULT_BINDING_IMPOSSIBLE=CWSAL0116E: Nicio legare implicit&#259; nu a putut fi creat&#259; pentru referin&#355;aEJB {0} &#238;n bundle-ul {1} la versiunea {2} cu interfa&#355;&#259; {3} din moment ce niciun bean de &#238;ntreprindere nu exist&#259; &#238;n aplica&#355;ie.
  </MsgText>
  <Explanation>
    Leg&#259;turile implicite trebuie create pentru referin&#355;e EJB nelegate. Niciun bean de &#238;ntreprindere nu a putut fi g&#259;sit la care s&#259; se lege aceast&#259; referin&#355;&#259;.
  </Explanation>
  <UserResponse>
    Fie lega&#355;i referin&#355;a la o loca&#355;ie JNDI cunoscut&#259;, fie corecta&#355;i aplica&#355;ia.
  </UserResponse>
</Message>
<Message ID="CWSAL0083E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_IN_NOT_FOUND" varFormat="Java">
    ASSET_IN_NOT_FOUND=CWSAL0083E: A survenit o eroare intern&#259;. Nu se poate g&#259;si obiectul aset de configurare pentru asetul {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0114E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_RESOURCE_REFERENCE" varFormat="Java">
    NO_EJB_RESOURCE_REFERENCE=CWSAL0114E: Nu poate g&#259;si referin&#355;a resurs&#259; cu nume JNDI {0} &#351;i tip {1} pe &#355;inta {2} pentru referin&#355;a resurs&#259; EJB {3} definit&#259; &#238;n bundle-ul {4} cu   versiunea {5}.
  </MsgText>
  <Explanation>
    O arhiv&#259; bundle de &#238;ntreprindere (EBA) care include referin&#355;e resurs&#259;&#238;ntr-un modul EJB specific&#259; un nume JNDI pentru o referin&#355;&#259; resurs&#259; care nu exist&#259;   &#238;n spa&#355;iul de nume JNDI.
  </Explanation>
  <UserResponse>
    &#206;n cazul &#238;n care referin&#355;a resurs&#259; trebuie s&#259; fie &#238;n spa&#355;iul de nume JNDI, fie lega&#355;i un obiect de nume, fie corecta&#355;i referin&#355;a resurs&#259; &#351;i actualiza&#355;i EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0079E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_STOP_FAILED" varFormat="Java">
    APP_STOP_FAILED=CWSAL0079E: Aplica&#355;ia OSGi implementat&#259; &#238;ntr-o unitate de compozi&#355;ie {0} din aplica&#355;ia de nivel opera&#355;ional {1} nu s-a oprit.
  </MsgText>
  <Explanation>
    A ap&#259;rut o excep&#355;ie &#238;n timpul opera&#355;iei de oprire.
  </Explanation>
  <UserResponse>
    Inspecta&#355;i &#238;nregistr&#259;rile &#238;n istoric ale serverului anterioare acestei excep&#355;ii pentru diagnoze problem&#259; mai exacte.
  </UserResponse>
</Message>
<Message ID="CWSAL0085E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_RUNAS_ROLE" varFormat="Java">
    INVALID_RUNAS_ROLE=CWSAL0085E: Rolul {0}, nu este un rol valid.
  </MsgText>
  <Explanation>
    Rolul specificat nu a fost configurat.
  </Explanation>
  <UserResponse>
    Configura&#355;i rolul specificat.
  </UserResponse>
</Message>
<Message ID="CWSAL0052E" severity="E" prefix="yes">
  <MsgText pgmKey="UNAUGMENTED_CLUSTER_MEMBER" varFormat="Java">
    UNAUGMENTED_CLUSTER_MEMBER=CWSAL0052E: Membrul clusterului {0} nu este completat cu caracteristicile, {2} cerute de aplica&#355;ia OSGi {1}.
  </MsgText>
  <Explanation>
    Pentru ca o aplica&#355;ie OSGi s&#259; fie instalat&#259; pe un cluster, fiecare membru trebuie s&#259; aib&#259; toate caracteristicile necesare ale aplica&#355;iei. La ad&#259;ugarea unui membru cluster nou, acel membru trebuie de asemenea s&#259; aib&#259; toate caracteristicile cerute de toatie aplica&#355;iile OSGi care sunt instalate pe cluster.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; membrul propus al cluster-ului are toate caracteristicile necesare pentru aplica&#355;ia OSGi listate &#238;n mesajul de eroare.
  </UserResponse>
</Message>
<Message ID="CWSAL0028E" severity="E" prefix="yes">
  <MsgText pgmKey="BPRRBS_COULD_NOT_CREATE_DIR" varFormat="Java">
    BPRRBS_COULD_NOT_CREATE_DIR=CWSAL0028E: Nu poate crea directorul {0}.
  </MsgText>
  <Explanation>
    Directorul specificat nu poate fi creat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; exist&#259; spa&#355;iu de stocare &#351;i dac&#259; produsul are permisiunile necesare cre&#259;rii directoruli.
  </UserResponse>
</Message>
<Message ID="CWSAL0068E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_CONTAINS_REDUNDANCY" varFormat="Java">
    DEPLOYMENT_MF_CONTAINS_REDUNDANCY=CWSAL0068E: Con&#355;inutul manifestului de implementare nu este corect. Urm&#259;toarele bundle-uri sunt redundante: {0}.
  </MsgText>
  <Explanation>
    Manifestul de implementare de importat include bundle-uri care nu sunt necesare pentru rezolvarea asetului EBA (enterprise bundle archive).
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; manifestul de implementare nou, DEPLOYMENT.MF, nu include bundle-urile care sunt listate &#238;n mesajul de excep&#355;ie. Nu edita&#355;i manual manifestul de implementare. Dac&#259; este necesar, &#238;nl&#259;tura&#355;i manifestul de implementare din EBA. Aceasta va cauza generarea unui fi&#351;ier manifest de implementare nou c&#226;nd EBA este importat.
  </UserResponse>
</Message>
<Message ID="CWSAL0042E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_GROUP" varFormat="Java">
    INVALID_GROUP=CWSAL0042E: Grupul specificat {0} nu este valid.
  </MsgText>
  <Explanation>
    &#206;ncercare de mapare a rolului de securitate c&#259;tre un grup care nu este valid.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; grupul specificat exist&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAL0088E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_SERVICE" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_SERVICE=CWSAL0088E: A survenit o eroare intern&#259;. Admin Service nu a fost &#238;nregistrat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0089W" severity="W" prefix="yes">
  <MsgText pgmKey="CU_BUNDLE_DOWNLOAD_REQUESTED" varFormat="Java">
    CU_BUNDLE_DOWNLOAD_REQUESTED=CWSAL0089W: O extensie la unitatea de compozi&#355;ie {0} necesit&#259; desc&#259;rc&#259;ri externe.
  </MsgText>
  <Explanation>
    A&#355;i creat sau actualizat un CBA (composite bundle archive) pentru a-l utiliza ca extensie la o unitate de compozi&#355;ie. Aceast&#259; extensie necesit&#259; ca unul sau mai multe bundle-uri s&#259; fie desc&#259;rcate de la o magazia &#238;nainte s&#259; pute&#355;i ad&#259;uga extensia la unitatea de compozi&#355;ie.
  </Explanation>
  <UserResponse>
    Pentru a porni procesul de desc&#259;rcare, salva&#355;i-v&#259; modific&#259;rile &#238;n configura&#355;ia master.  Pute&#355;i vizualiza starea de desc&#259;rcare a bundle-ului din panoul de detalii al unit&#259;&#355;ii de compozi&#355;ie din consola administrativ&#259;. A&#351;tepta&#355;i s&#259; se finalizeze desc&#259;rcarea bundle-ului, apoi ad&#259;uga&#355;i extensia la unitatea de compozi&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAL0049E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SERVERS_AVAIL" varFormat="Java">
    NO_SERVERS_AVAIL=CWSAL0049E: Nici unul dintre servere sau clustere nu are caracteristica cerut&#259; {0} implementat&#259; pentru asetul {1}.
  </MsgText>
  <Explanation>
    Caracteristica necesar&#259; nu a putut fi g&#259;sit&#259; la nici unul dintre servicii.
  </Explanation>
  <UserResponse>
    Instala&#355;i caracteristica necesar&#259; pe cel pu&#355;in unul din servere.
  </UserResponse>
</Message>
<Message ID="CWSAL0026E" severity="E" prefix="yes">
  <MsgText pgmKey="MISSING_BUNDLES" varFormat="Java">
    MISSING_BUNDLES=CWSAL0026E: A survenit o eroare intern&#259;. Fi&#351;ierul EBA {0} lipse&#351;te din urm&#259;toarele bundle-uri: {1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0039E" severity="E" prefix="yes">
  <MsgText pgmKey="MULTIPLE_CUS_WITH_THE_SAME_ASSET" varFormat="Java">
    MULTIPLE_CUS_WITH_THE_SAME_ASSET=CWSAL0039E: Nu poate ad&#259;uga asetul {0} la aceast&#259; aplica&#355;ie de nivel business deoarece este deja ad&#259;ugat&#259; aplica&#355;iei de nivel business: {1}
  </MsgText>
  <Explanation>
    Un patrimoniu EBA poate fi doar &#238;ntr-o singur&#259; aplica&#355;ie la nivel de &#238;ntreprindere.
  </Explanation>
  <UserResponse>
    Crea&#355;i o nou&#259; aplica&#355;ie cu acela&#351;i con&#355;inut, dar cu un nume simbolic diferit. Importa&#355;i noua aplica&#355;ie ca patrimoniu EBA, &#351;i ad&#259;uga&#355;i-o la acest BLA.
  </UserResponse>
</Message>
<Message ID="CWSAL0096W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_INCONSISTENT_MIXED_VERSION" varFormat="Java">
    RESOLUTION_INCONSISTENT_MIXED_VERSION=CWSAL0096W: Provizionarea aplica&#355;iei {0} a produs rezultate diferite pentru WebSphere Application Server Versiune 8 &#351;i WebSphere Application Server Versiune 7 OSGi Applications Feature Pack. Rezultatul  Versiune 8 va fi utilizat.
  </MsgText>
  <Explanation>
    Aplica&#355;ia care este importat&#259; a fost provizionat&#259; cu succes &#238;mpotriva WebSphere Application Server Versiune 8 &#351;i WebSphere Application Server Versiune 7 OSGi Applications Feature Pack. Totu&#351;i, au fost ob&#355;inute rezultate diferite pentru cele dou&#259; opera&#355;ii de provizionare. Nu pute&#355;i rula aceea&#351;i aplica&#355;ie cu implement&#259;ri diferite.
  </Explanation>
  <UserResponse>
    Nicio ac&#355;iune nu este necesar&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAL0054I" severity="I" prefix="yes">
  <MsgText pgmKey="NEW_DIRECTORY_MAPPING" varFormat="Java">
    NEW_DIRECTORY_MAPPING=CWSAL0054I: {1} a fost asignat directorului {0}.
  </MsgText>
  <Explanation>
    Un bun arhiv&#259; bundle &#238;ntreprindere (EBA) este ad&#259;ugat la o unitate de compozi&#355;ie. Pentru a seta aplica&#355;ia web con&#355;inut&#259; &#238;n EBA, a fost alocat un director aplica&#355;iei web.
  </Explanation>
  <UserResponse>
    Nimic
  </UserResponse>
</Message>
<Message ID="CWSAL0004E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_RESOLVE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_RESOLVE=CWSAL0004E: A survenit o eroare intern&#259;. Nu se poate citi manifestul de aplica&#355;ie sau manifestul de implementare pentru fi&#351;ierul EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0020E" severity="E" prefix="yes">
  <MsgText pgmKey="STEP_NOT_FOUND" varFormat="Java">
    STEP_NOT_FOUND=CWSAL0020E: A survenit o eroare intern&#259;. Pasul {0} nu poate fi g&#259;sit.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0038W" severity="W" prefix="yes">
  <MsgText pgmKey="UNCONVERTIBLE_JAR_FILE" varFormat="Java">
    UNCONVERTIBLE_JAR_FILE=CWSAL0038W: Asetul {0} con&#355;ine un fi&#351;ier JAR {1} care nu este un bundle &#351;i care nu va fi convertit. Dac&#259; alte p&#259;r&#355;i ale aplica&#355;iei depind de acest fi&#351;ier, aplica&#355;ia va e&#351;ua la rulare.
  </MsgText>
  <Explanation>
    Conversia fi&#351;ierelor utilit&#259;&#355;ii arhivei Java (JAR) &#351;i a fi&#351;ierelor Enterprise JavaBeans (EJB) JAR nu este suportat&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; nici un bundle sau WAB (web application bundle) nu depinde de clasele din fi&#351;ierul JAR. Pentru a evita mesajul de avertizare, &#238;nl&#259;tura&#355;i fi&#351;ierul JAR din EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0005E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_DETAILS" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_DETAILS=CWSAL0005E: A survenit o eroare intern&#259;. Nu se poate citi manifestul de aplica&#355;ie sau manifestul de implementare pentru fi&#351;ierul EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0110E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_MAPPING_NAMESPACE_ERROR" varFormat="Java">
    EJB_MAPPING_NAMESPACE_ERROR=CWSAL0110E: Interfa&#355;a EJB {0} pentru bean de &#238;ntreprindere {1} &#238;n Bundle {2} la versiunea {3} nu poate fi legat de loca&#355;ie {4}. Interfe&#355;ele accesibile local EJB trebuie s&#259; fie legate &#238;n ejblocal: spa&#355;iu de nume.
  </MsgText>
  <Explanation>
    Vizualiz&#259;rile Local, &quot;No Interface&quot; &#351;i &quot;Local Home&quot; ale unui bean de &#238;ntreprindere pot fi legate doar &#238;n JNDI accesibil local. Aceasta &#238;nseamn&#259; c&#259; numele lor de leg&#259;tur&#259; trebuie s&#259; &#238;nceap&#259; cu &quot;ejblocal:&quot;.
  </Explanation>
  <UserResponse>
    Ajusta&#355;i numele de leg&#259;tur&#259; pentru toate vizualiz&#259;rile EJB accesibile local astfel &#238;nc&#226;t acestea s&#259; utilizeze ejblocal: prefix spa&#355;iu de nume.
  </UserResponse>
</Message>
<Message ID="CWSAL0077E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICABLE_UPDATES_AVAILABLE" varFormat="Java">
    NO_APPLICABLE_UPDATES_AVAILABLE=CWSAL0077E: CompUnitStatusStep-ul indic&#259; faptul c&#259; unitatea de compozi&#355;ie {0} ar trebui modernizat&#259; la ultima versiune de implementare disponibil&#259; de la asetul {1}. Totu&#351;i, unitatea de compozi&#355;ie {0} este la zi.
  </MsgText>
  <Explanation>
    &#206;nainte s&#259; pute&#355;i moderniza asetul implementat &#238;ntr-o unitate de compozi&#355;ie, trebuie s&#259; fie disponibil&#259; o versiune actualizat&#259; a asetului &#351;i toate bundle-urile necesitate de asetul actualizat trebuie s&#259; fi terminat desc&#259;rcarea.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; este disponibil&#259; o versiune ulterioar&#259; a asetului &#351;i dac&#259; toate desc&#259;rc&#259;rile de bundle pentru aset s-au finalizat.
  </UserResponse>
</Message>
<Message ID="CWSAL0055E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_OBTAIN_CU" varFormat="Java">
    UNABLE_TO_OBTAIN_CU=CWSAL0055E: S-a produs o eroare intern&#259;. Nu se poate ob&#355;ine unitatea de compozi&#355;ie pentru bunul {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0099E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_EXTENSION_FAILURE_MIXED_VERSION=CWSAL0099E: Un membru cluster nu poate fi creat pe nodul {0} deoarece aplica&#355;ia(ile) OSGi {1} a fost extins&#259;.
  </MsgText>
  <Explanation>
    To&#355;i membrii clusterului trebuie s&#259; fie capabili s&#259; ruleze acelea&#351;i aplica&#355;ii, &#238;ns&#259; noul membru cluster nu poate suporta extensiile aplica&#355;iei OSGi.
  </Explanation>
  <UserResponse>
    Selecta&#355;i un nod Versiune 8 care s&#259; g&#259;zduiasc&#259; membrul clusterului sau &#238;nl&#259;tura&#355;i extensia(ile) din aplica&#355;ie(i) astfel &#238;nc&#226;t s&#259; poat&#259; fi rulate utiliz&#226;nd nodul selectat.
  </UserResponse>
</Message>
<Message ID="CWSAL0109E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_EXTENSION_CONFLICT" varFormat="Java">
    UPDATE_EXTENSION_CONFLICT=CWSAL0109E: Bundle-ul {0} din Composition Unit {1} nu a putut fi actualizat&#259; deoarece exist&#259; o extensie &#238;n conflict cu acela&#351;i nume simbolic.
  </MsgText>
  <Explanation>
    Nu este posibil&#259; actualizarea unui bundle cba la versiunea cerut&#259; deoarece exist&#259; deja o extensie prezent&#259; cu acela&#351;i nume simbolic la acea versiune.
  </Explanation>
  <UserResponse>
    Fie &#238;nl&#259;tura&#355;i extensia, fie modifica&#355;i versiunea de bundle la care &#238;ncerca&#355;i s&#259; o actualiza&#355;i.
  </UserResponse>
</Message>
<Message ID="CWSAL0121W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    INVALID_MDB_ACTSPEC_REFERENCE=CWSAL0121W: Nicio MDB Activation Spec care se potrive&#351;te numeluiJNDI {0} nu a putut fi g&#259;sit&#259; la &#355;int&#259; {1} pentru resursa utilizat&#259; de bean-ul {2} &#238;n bundle-ul {3} laversiunea {4}.
  </MsgText>
  <Explanation>
    Nu exist&#259; numele JNDI de referin&#355;&#259; Specifica&#355;ie de activare specificat pentru legarea Ascult&#259;tor MDB.
  </Explanation>
  <UserResponse>
    Dac&#259; referin&#355;a trebuie s&#259; fie &#238;n spa&#355;iul de nume JNDI, fie lega&#355;i un obiect la nume, fie corecta&#355;i referin&#355;a &#351;i actualiza&#355;i EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0092E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOCATE_TYPE" varFormat="Java">
    UNABLE_TO_LOCATE_TYPE=CWSAL0092E: S-a produs o eroare intern&#259;. Asetul {0} nu a putut fi interogat pentru con&#355;inut.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0073E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_IN_APPLICATION_CONTENT" varFormat="Java">
    CBA_IN_APPLICATION_CONTENT=CWSAL0073E: Aplica&#355;ia {0} include un bundle compus {1} &#238;n con&#355;inutul aplica&#355;iei sale. Aceasta este suportat&#259;.
  </MsgText>
  <Explanation>
    nu pute&#355;i utiliza antetul Application-Content pentru a include arhiva bundle compus&#259; direct &#238;n EBA.
  </Explanation>
  <UserResponse>
    &#206;nl&#259;tura&#355;i bundle-ul compus din con&#355;inutul aplica&#355;iei. Pute&#355;i fie s&#259; include&#355;i bundle-urile individuale din Application-Content, fie s&#259; instala&#355;i bundle-ul compus &#238;ntr-o magazie de bundle-uri pentru partajare.
  </UserResponse>
</Message>
<Message ID="CWSAL0027E" severity="E" prefix="yes">
  <MsgText pgmKey="INCORRECT_BUNDLE_IN_CACHE" varFormat="Java">
    INCORRECT_BUNDLE_IN_CACHE=CWSAL0027E: A survenit o eroare intern&#259;. Un fi&#351;ier cu numele corect exist&#259; &#238;n memoria cache a bundle-ului, dar nu con&#355;ine bundle-ul a&#351;teptat {0}/{1}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0113E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_EJB_MSG_DEST_REFERENCE" varFormat="Java">
    NO_EJB_MSG_DEST_REFERENCE=CWSAL0113E: Nu poate g&#259;si referin&#355;a destina&#355;ie de mesaj sau referin&#355;a mediu de resurs&#259; cu numele JNDI {0} &#351;i tipul {1} pe &#355;inta {2} pentru referin&#355;a destina&#355;ie de esaje EJBsau referin&#355;&#259; mediu de resurs&#259; {3} definit &#238;n bundle-ul {4} cu versiunea {5}.
  </MsgText>
  <Explanation>
    O arhiv&#259; bundle de &#238;ntreprindere (EBA) care include referin&#355;e destina&#355;ie de mesaje sau referin&#355;&#259; mediu de resurs&#259; care nu exist&#259; &#238;n spa&#355;iul de nume JNDI.
  </Explanation>
  <UserResponse>
    Dac&#259; referin&#355;a de destina&#355;ie mesaje sau referin&#355;a de mediu resurse ar trebui s&#259; fie &#238;n spa&#355;iul de nume JNDI, fie lega&#355;i un obiect la nume, fie corecta&#355;i referin&#355;a de destina&#355;ie mesaje sau referin&#355;a de mediu resurse &#351;i actualiza&#355;i EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0119E" severity="E" prefix="yes">
  <MsgText pgmKey="DOTDOT_ILLEGAL_IN_APP_NAME" varFormat="Java">
    DOTDOT_ILLEGAL_IN_APP_NAME=CWSAL0119E: Aplica&#355;ia OSGi {0} nu este valid&#259; deoarecenumele s&#259;u simbolic con&#355;ine dou&#259; caractere perioad&#259; consecutive.
  </MsgText>
  <Explanation>
    Un nume simbolic de aplica&#355;ie OSGi nu poate con&#355;ine &#351;irul &quot;..&quot;; care este, de dou&#259; caractere perioad&#259; consecutive.
  </Explanation>
  <UserResponse>
    Modifica&#355;i numele simbolic al aplica&#355;iei OSGi.
  </UserResponse>
</Message>
<Message ID="CWSAL0007E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_ZIP" varFormat="Java">
    EXCEPTION_READING_ZIP=CWSAL0007E: Nu poate citi fi&#351;ierul EBA {0}.
  </MsgText>
  <Explanation>
    O excep&#355;ie IOException a ap&#259;rut c&#226;nd se citea fi&#351;ierul EBA. Fi&#351;ierul poate fi corupt sau ilizibil.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; fi&#351;ierul are permisiunile corespunz&#259;toare &#351;i c&#259; este &#238;n formatul corect.
  </UserResponse>
</Message>
<Message ID="CWSAL0087E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_LOOKUP_ADMIN_MBEAN" varFormat="Java">
    UNABLE_TO_LOOKUP_ADMIN_MBEAN=CWSAL0087E: A survenit o eroare intern&#259;. SecurityAdmin MBean nu a fost &#238;nregistrat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0105W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_SERVICE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_SERVICE_IMPORTS=CWSAL0105W: Referin&#355;ele de servicii din con&#355;inutul arhivei CBA (Composite Bundle Archive) {0} nu pot fi rezolvate. Dac&#259; aceste servicii sunt furnizate de bundle-uri care nu sunt incluse &#238;n CBA, atunci CBA trebuie s&#259; le importe. Urm&#259;toarele dependen&#355;e de servicii nu au fost rezolvate: {1}
  </MsgText>
  <Explanation>
    Dac&#259; un bundle dintr-o arhiv&#259; CBA (Composite Bundle Archive) folose&#351;te un serviciu care nu este con&#355;inut &#238;n bundle sau nu este exportat de alt bundle &#238;n CBA, atunci CBA trebuie s&#259; importe serviciul.
  </Explanation>
  <UserResponse>
    Corecta&#355;i manifestul compozi&#355;iei, COMPOSITEBUNDLE.MF, astfel &#238;nc&#226;t CBA s&#259; importe toate serviciile care sunt folosite de bundle-uri &#238;n CBA &#351;i care nu sunt &#238;n alt fel disponibile &#238;n CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0001E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_WHILE_WRITING_EBA" varFormat="Java">
    EXCEPTION_WHILE_WRITING_EBA=CWSAL0001E: Nu poate scrie fi&#351;ierul EBA migrat {0}.
  </MsgText>
  <Explanation>
    O excep&#355;ie IOException a ap&#259;rut c&#226;nd se scria fi&#351;ierul EBA.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; produsul are permisiunile necesare pentru a scrie &#238;n directorul relevant, c&#259; fi&#351;ierul &#355;int&#259; nu este blocat &#351;i c&#259; exist&#259; spa&#355;iu de stocare disponibil.
  </UserResponse>
</Message>
<Message ID="CWSAL0094W" severity="W" prefix="yes">
  <MsgText pgmKey="RESOLUTION_FAILURE_FEP_MIXED_VERSION" varFormat="Java">
    RESOLUTION_FAILURE_FEP_MIXED_VERSION=CWSAL0094W: Aplica&#355;ia {0} nu a putut fi provizionat&#259; pentru toate nodurile din celul&#259;. Aplica&#355;ia poate fi implementat&#259; doar pe noduri Versiune 8. Eroarea de rezolu&#355;ie a fost {1}.
  </MsgText>
  <Explanation>
    Aplica&#355;ia care este importat&#259; a fost provizionat&#259; cu succes &#238;mpotriva WebSphere Application Server Versiune 8, dar nu a putut fi provizionat&#259; &#238;mpotriva OSGi Applications Feature Pack din WebSphere Application Server Versiune 7.
  </Explanation>
  <UserResponse>
    Nu este necesar&#259; nici o ac&#355;iune. Totu&#351;i, pute&#355;i utiliza informa&#355;iile din eroare de rezolu&#355;ie pentru a modifica aplica&#355;ia astfel &#238;nc&#226;t s&#259; poat&#259; fi implementat&#259; &#238;mpotriva WebSphere Application Server Versiune 7 OSGi Applications Feature Pack.
  </UserResponse>
</Message>
<Message ID="CWSAL0072W" severity="W" prefix="yes">
  <MsgText pgmKey="USING_LOCALHOST_AS_HOST_NAME" varFormat="Java">
    USING_LOCALHOST_AS_HOST_NAME=CWSAL0072W: Utilizarea localhost ca nume gazd&#259; pentru transportul pentru server {0}.{1}. Rutarea cerut&#259; va merge at&#226;t timp c&#226;t serverul web &#351;i serverul de aplica&#355;ii sunt pe acela&#351;i nod.
  </MsgText>
  <Explanation>
    Numele gazdei serverului de aplica&#355;ii specificat pe transport a fost rezolvat ca localhost.
  </Explanation>
  <UserResponse>
    Dac&#259; serverul web &#351;i serverul de aplica&#355;ii sunt pe noduri diferite, investiga&#355;i de ce numele gazdei serverului de aplica&#355;ii a fost rezolvat ca localhost.
  </UserResponse>
</Message>
<Message ID="CWSAL0053E" severity="E" prefix="yes">
  <MsgText pgmKey="SYMBOLIC_NAME_ALREADY_IN_USE" varFormat="Java">
    SYMBOLIC_NAME_ALREADY_IN_USE=CWSAL0053E: Fi&#351;ierul EBA {0} nu poate fi instalat. Application-SymbolicName-ul {1} al EBA-ului este utilizat deja de c&#259;tre aset {2}.
  </MsgText>
  <Explanation>
    &#206;ncerca&#355;i s&#259; instala&#355;i un fi&#351;ier EBA &#238;ns&#259; exist&#259; un aset care are acela&#351;i nume simbolic.
  </Explanation>
  <UserResponse>
    Modifica&#355;i numele simbolic al EBA pe care &#238;l instala&#355;i sau dezinstala&#355;i bunul existent.
  </UserResponse>
</Message>
<Message ID="CWSAL0098E" severity="E" prefix="yes">
  <MsgText pgmKey="ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION" varFormat="Java">
    ADD_CLUSTER_MEMBER_PROVISIONING_FAILURE_MIXED_VERSION=CWSAL0098E: Un membru cluster nu poate fi creat pe nodul {0} deoarece aplica&#355;ia(ile) OSGi {1} nu poate fi provizionat&#259; &#238;mpotriva acestuia. Eroarea de rezolu&#355;ie a fost {2}.
  </MsgText>
  <Explanation>
    To&#355;i membrii clusterului trebuie s&#259; fie capabili s&#259; ruleze acelea&#351;i aplica&#355;ii, &#238;ns&#259; noul membru cluster nu poate rula aplica&#355;iile OSGi numite.
  </Explanation>
  <UserResponse>
    Selecta&#355;i alt nod, compatibil, care s&#259; g&#259;zduiasc&#259; membrul clusterului sau modifica&#355;i aplica&#355;iile astfel &#238;nc&#226;t s&#259; poat&#259; fi rulate utiliz&#226;nd nodul selectat.
  </UserResponse>
</Message>
<Message ID="CWSAL0047E" severity="E" prefix="yes">
  <MsgText pgmKey="SECURITY_PERMISSIONS_PARSEREXCEPTION" varFormat="Java">
    SECURITY_PERMISSIONS_PARSEREXCEPTION=CWSAL0047E: Nu poate parsa fi&#351;ierul {0} pentru fi&#351;ierul EBA (enterprise bundle archive) {1}.
  </MsgText>
  <Explanation>
    Fi&#351;ierul specificat nu poate fi parsat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; fi&#351;ierul este formatat corect &#351;i c&#259; nu este corupt.
  </UserResponse>
</Message>
<Message ID="CWSAL0003E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_MANIFEST_DURING_UPDATE" varFormat="Java">
    NO_APPLICATION_MANIFEST_DURING_UPDATE=CWSAL0003E: A survenit o eroare intern&#259;. Nu se poate citi manifestul de aplica&#355;ie sau manifestul de implementare pentru fi&#351;ierul EBA {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0071E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_FILE" varFormat="Java">
    UNABLE_TO_CREATE_FILE=CWSAL0071E: Nu poate crea fi&#351;ierul: {0}
  </MsgText>
  <Explanation>
    A fost o problem&#259; la crearea numelui c&#259;ii cerut &#238;n timpul export&#259;rii asetului.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; serverul de aplica&#355;ii are permisiunea de a crea acest nume de cale.
  </UserResponse>
</Message>
<Message ID="CWSAL0107E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_APP_CONTENT_VERSION_STEP_CHANGED" varFormat="Java">
    UPDATE_APP_CONTENT_VERSION_STEP_CHANGED=CWSAL0107E: Comanda UpdateAppContentVersionStep din WAS V7 a fost &#238;nlocuit&#259; cu comanda UpdateAppContentVersions &#238;n WAS V8.
  </MsgText>
  <Explanation>
    Comanda WAS V7 UpdateAppContentVersionStep a fost &#238;nlocuit&#259; cu comanda UpdateAppContentVersions &#238;n WAS V8. V&#259; rug&#259;m s&#259; consulta&#355;i InfoCenter pentru mai multe informa&#355;ii.
  </Explanation>
  <UserResponse>
    Modifica&#355;i scriptul astfel &#238;nc&#226;t s&#259; utiliza&#355;i comanda UpdateAppContentVersions.
  </UserResponse>
</Message>
<Message ID="CWSAL0013E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_DEPLOYMENT_CONTENT" varFormat="Java">
    EMPTY_DEPLOYMENT_CONTENT=CWSAL0013E: A survenit o eroare intern&#259;. Fi&#351;ierul EBA {0}, c&#226;nd este rezolvat, nu are nici un con&#355;inut ce poate fi implementat.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0015E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION" varFormat="Java">
    PROVISIONING_EXCEPTION=CWSAL0015E: Nu poate rezolva fi&#351;ierul EBA. Excep&#355;ie: {0}.
  </MsgText>
  <Explanation>
    Sistemul nu poate rezolva loca&#355;iile bundle-urilor de aplica&#355;ie componente la versiunea corespunz&#259;toare a fi&#351;ierului EBA.
  </Explanation>
  <UserResponse>
    Vede&#355;i excep&#355;ia pentru informa&#355;ii ulterioare.
  </UserResponse>
</Message>
<Message ID="CWSAL0018E" severity="E" prefix="yes">
  <MsgText pgmKey="RESOLVER_SERVICE_UNAVAILABLE" varFormat="Java">
    RESOLVER_SERVICE_UNAVAILABLE=CWSAL0018E: A survenit o eroare intern&#259;. Nu se poate rezolva fi&#351;ierul EBA {0} pentru c&#259; serviciul {1} nu este disponibil.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0041E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USER" varFormat="Java">
    INVALID_USER=CWSAL0041E: Utilizatorul specificat {0} nu este valid.
  </MsgText>
  <Explanation>
    &#206;ncercare de mapare a rolului de securitate c&#259;tre un utilizator care nu este valid.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; utilizatorul specificat exist&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAL0062E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_BUNDLECACHEMANAGER_FOUND" varFormat="Java">
    NO_BUNDLECACHEMANAGER_FOUND=CWSAL0062E: S-a produs o eroare intern&#259;. Nu se poate g&#259;si un MBean pentru BundleCacheManager pentru profilul {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0125W" severity="W" prefix="yes">
  <MsgText pgmKey="JAVAGLOBAL_JAVAAPP_WARNING" varFormat="Java">
    JAVAGLOBAL_JAVAAPP_WARNING=CWSAL0125W: Legarea {0} pentru referin&#355;a EJB {1} din bundle-ul {2} la versiunea {3} cu interfa&#355;a {4} poate cauza func&#355;ionarea incorect&#259; a aplica&#355;iei dup&#259; o actualizare.
  </MsgText>
  <Explanation>
    Referin&#355;ele de c&#259;utare ale p&#259;r&#355;ilor constituente java:global/application_name/module_name/ejb_name sau java:app/module_name/ejb_name se pot modifica dup&#259; ce este actualizat&#259; o aplica&#355;ie OSGi, a&#351;a c&#259; referin&#355;ele trebuie s&#259; fie modificate corespunz&#259;tor, ceea ce face ca aceast&#259; abordare s&#259; nu fie practic&#259;.
  </Explanation>
  <UserResponse>
    Utiliza&#355;i serviciile OSGi pentru configurarea dependen&#355;elor EJB sau declara&#355;i o referin&#355;&#259; EJB &#351;i mapa&#355;i-o la numele JNDI EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0057E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_CREATE_DIRECTORY=CWSAL0057E: Nu poate expanda fi&#351;ierul EBA (enterprise bundle archive) {0}, nu poate crea directorul {1}.
  </MsgText>
  <Explanation>
    &#206;n timpul &#238;ncerc&#259;rii de expandare a fi&#351;ierului EBA specificat, nu a putut fi creat un director cerut.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; serverul de aplica&#355;ii are permisiunea de a crea directorul specificat.
  </UserResponse>
</Message>
<Message ID="CWSAL0045E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS" varFormat="Java">
    INCOMPATIBLE_PACKAGE_VERSION_REQUIREMENTS=CWSAL0045E: Asetul {0} nu poate fi rezolvat. Are cerin&#355;e ale versiunii incompatibile cu urm&#259;toarele pachete: {1}.
  </MsgText>
  <Explanation>
    Pentru bundle-urile care sunt listate &#238;n antetul Application-Content din APPLICATION.MF, toate importurile pentru un pachet dat trebuie s&#259; aibe cerin&#355;ele versiunii compatibile.
  </Explanation>
  <UserResponse>
    Schimba&#355;i &#238;mpachetarea configura&#355;iei astfel &#238;nc&#226;t toate bundle-urile care sunt listate &#238;n antetul Application-Content s&#259; aibe cerin&#355;ele versiunii compatibile.
  </UserResponse>
</Message>
<Message ID="CWSAL0102W" severity="W" prefix="yes">
  <MsgText pgmKey="RUN_AS_ROLE_MIXED_VERSION" varFormat="Java">
    RUN_AS_ROLE_MIXED_VERSION=CWSAL0102W: Rulare ca roluri nu poate fi configurat pentru noduri anterioare WebSphere Application Server Versiune 8. Orice configura&#355;ie va fi ignorat&#259;.
  </MsgText>
  <Explanation>
    Rulare ca roluri poate fi configurat doar pentru WebSphere Application Server Versiune 8 &#351;i versiuni ulterioare. Nu pot fi configurate pentru o unitate de compozi&#355;ie care este implementat&#259; la &#355;inte WebSphere Application Server Versiune 7 OSGi Applications Feature Pack.
  </Explanation>
  <UserResponse>
    Nicio ac&#355;iune nu este necesar&#259;. Dac&#259; Rulare ca roluri trebuie s&#259; fie configurat atunci &#238;nl&#259;tura&#355;i orice map&#259;ri &#355;int&#259; pentru noduri WebSphere Application Server Versiune 7 OSGi Applications Feature Pack.
  </UserResponse>
</Message>
<Message ID="CWSAL0086E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_USERID_OR_PASSWD" varFormat="Java">
    INVALID_USERID_OR_PASSWD=CWSAL0086E: ID-ul de utilizator sau parola este incorect&#259;.
  </MsgText>
  <Explanation>
    A fost livrat un ID de utilizator sau o parol&#259; incorect&#259;.
  </Explanation>
  <UserResponse>
    Re&#238;ncerca&#355;i ac&#355;iunea utiliz&#226;nd ID-ul de utilizator &#351;i parola corect&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAL0080E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_UPDATE_FAILED" varFormat="Java">
    APP_UPDATE_FAILED=CWSAL0080E: Opera&#355;ia de actualizare nu a reu&#351;it pentru aplica&#355;ia OSGi implementat&#259; &#238;ntr-o unitate de compozi&#355;ie {0} din aplica&#355;ia de nivel opera&#355;ional {1}.
  </MsgText>
  <Explanation>
    A ap&#259;rut o excep&#355;ie &#238;n timpul opera&#355;iei de actualizare.
  </Explanation>
  <UserResponse>
    Inspecta&#355;i &#238;nregistr&#259;rile &#238;n istoric ale serverului anterioare acestei excep&#355;ii pentru diagnoze problem&#259; mai exacte.
  </UserResponse>
</Message>
<Message ID="CWSAL0019E" severity="E" prefix="yes">
  <MsgText pgmKey="APPLICATION_CONTENT_EMPTY" varFormat="Java">
    APPLICATION_CONTENT_EMPTY=CWSAL0019E: S-a produs o eroare intern&#259;. Intrarea Application-Content a manifestului de aplica&#355;ie din fi&#351;ierul EBA {0} este goal&#259;, deci nu va fi instalat nici un bundle.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0009E" severity="E" prefix="yes">
  <MsgText pgmKey="EXCEPTION_READING_APPLICATION_XML" varFormat="Java">
    EXCEPTION_READING_APPLICATION_XML=CWSAL0009E: Nu poate citi fi&#351;ierul descriptor al aplica&#355;iei Java EE din fi&#351;ierul EBA {0}.
  </MsgText>
  <Explanation>
    O excep&#355;ie IOException a ap&#259;rut c&#226;nd se citea fi&#351;ierul descriptor al aplica&#355;iei Java EE dintr-un fi&#351;ier EBA.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; fi&#351;ierul descriptor al aplica&#355;iei nu este corupt, adic&#259; este lizibil &#351;i are mul&#355;imea de permisiuni corespunz&#259;toare.
  </UserResponse>
</Message>
<Message ID="CWSAL0035E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_RESOURCE_REFERENCE" varFormat="Java">
    NO_RESOURCE_REFERENCE=CWSAL0035E: Nu poate g&#259;si referin&#355;a resursei cu numele JNDI {0} &#351;i tipul {1} &#238;n &#355;inta {2} pentru referin&#355;a resursei modulului web {3} definit&#259; &#238;n bundle-ul {4} cu versiunea {5}.
  </MsgText>
  <Explanation>
    Un EBA (enterprise bundle archive) care include referin&#355;e resurs&#259; &#238;ntr-un WAR (web application archive) specific&#259; un nume JNDI pentru o referin&#355;&#259; resurs&#259; care nu exist&#259; &#238;n spa&#355;iul de nume JNDI.
  </Explanation>
  <UserResponse>
    &#206;n cazul &#238;n care referin&#355;a resurs&#259; trebuie s&#259; fie &#238;n spa&#355;iul de nume JNDI, fie lega&#355;i un obiect de nume, fie corecta&#355;i referin&#355;a resurs&#259; &#351;i actualiza&#355;i EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0117E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DEFAULT_BINDING_AMBIGUOUS" varFormat="Java">
    EJB_DEFAULT_BINDING_AMBIGUOUS=CWSAL0117E: Nicio legare implicit&#259; nu a putut fi creat&#259; pentru referin&#355;a EJB {0} &#238;n bundle-ul {1} la versiunea {2} cu interfa&#355;a {3} deoarece exist&#259; dou&#259; mai mai multe leg&#259;ri posibile. Referin&#355;a nu a putut fi legat&#259; de oricare dintre urm&#259;toarele bean-uri de &#238;ntreprindere: {4}.
  </MsgText>
  <Explanation>
    Leg&#259;turile implicite trebuie create pentru referin&#355;e EJB nelegate. Mai mult dec&#226;t o &#238;ntreprindere posibil&#259; a fost g&#259;sit&#259; la care a putut fi legat&#259; aceast&#259; referin&#355;&#259;.
  </Explanation>
  <UserResponse>
    Fie lega&#355;i referin&#355;a la un anumit bean de &#238;ntreprindere, fie corecta&#355;i aplica&#355;ia.
  </UserResponse>
</Message>
<Message ID="CWSAL0025E" severity="E" prefix="yes">
  <MsgText pgmKey="AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE" varFormat="Java">
    AUTH_ALIAS_SET_FOR_APPLICATION_AUTHTYPE=CWSAL0025E: Aliasul de autentificare {0} este configurat incorect. Nu este valabil&#259; legarea la referin&#355;e a unui alias cu tipul de autentificare Aplica&#355;ie.
  </MsgText>
  <Explanation>
    Aliasurile de autentificare cu un tip de autentificare Aplica&#355;ie nu pot fi legate la referin&#355;ele resurs&#259; Blueprint.
  </Explanation>
  <UserResponse>
    &#206;nl&#259;tura&#355;i aliasul de autentificare din referin&#355;ele resurs&#259; relevante.
  </UserResponse>
</Message>
<Message ID="CWSAL0021E" severity="E" prefix="yes">
  <MsgText pgmKey="INVALID_VIRTUAL_HOST" varFormat="Java">
    INVALID_VIRTUAL_HOST=CWSAL0021E: Gazda virtual&#259; {0} specificat&#259; pentru bundle-ul {1} nu exist&#259;.
  </MsgText>
  <Explanation>
    S-a &#238;ncercat maparea unui WAB (web application bundle) la o gazd&#259; virtual&#259; care nu este valid&#259;.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; gazda virtual&#259; specificat&#259; exist&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAL0046E" severity="E" prefix="yes">
  <MsgText pgmKey="APP_CONTENT_USE_BUNDLE_DUPLICATE" varFormat="Java">
    APP_CONTENT_USE_BUNDLE_DUPLICATE=CWSAL0046E: Manifestul aplica&#355;ie al fi&#351;ierului EBA {0} listeaz&#259; bundle-uri din antetul Con&#355;inut aplica&#355;ie care sunt de asemenea listate &#238;n antetul Bundle utilizare.
  </MsgText>
  <Explanation>
    Numele bundle-urilor care sunt listate &#238;n antetul Application-Content al APPLICATION.MF nu pot fi listate &#351;i &#238;n antetul Use-Bundle, &#238;n ciuda versiunilor bundle-ului.
  </Explanation>
  <UserResponse>
    Schimba&#355;i &#238;mpachetarea EBA astfel &#238;nc&#226;t numele bundle-urilor s&#259; nu fie duplicate &#238;n anteturile Application-Content &#351;i Use-Bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0103E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_MISSING_PACKAGE_IMPORTS" varFormat="Java">
    CBA_WITH_MISSING_PACKAGE_IMPORTS=CWSAL0103E: Arhiva CBA (Composite Bundle Archive) {0} nu este valid&#259;. Pachete importate de bundle-uri &#238;n CBA lipsesc din antetul Import-Pachete al fi&#351;ierului manifest CBA. Urm&#259;toarele probleme au fost raportate {1}
  </MsgText>
  <Explanation>
    Dac&#259; un bundle dintr-o arhiv&#259; CBA (Composite Bundle Archive) folose&#351;te un pachet care nu este con&#355;inut &#238;n bundle sau nu este exportat de alt bundle &#238;n CBA, atunci CBA trebuie s&#259; importe pachetul.
  </Explanation>
  <UserResponse>
    Corecta&#355;i manifestul compozi&#355;iei, COMPOSITEBUNDLE.MF, astfel &#238;nc&#226;t CBA s&#259; importe toate pachetele care sunt folosite de bundle-uri &#238;n CBA &#351;i care nu sunt &#238;n alt fel disponibile &#238;n CBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0111E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_DUPLICATE_MAPPING_ERROR" varFormat="Java">
    EJB_DUPLICATE_MAPPING_ERROR=CWSAL0111E: Bean-ul &#238;ntreprindere {0} &#238;n bundle-ul {1} la versiunea {2} are mai multe map&#259;ri pentru interfa&#355;&#259; {3} &#238;n fi&#351;ierul s&#259;u de leg&#259;turi. Map&#259;rile au fost {4} &#351;i {5}.
  </MsgText>
  <Explanation>
    Fi&#351;ierul de leg&#259;turi EJB  inclus &#238;n bundle con&#355;ine informa&#355;ii de mapare ambigue pentru o interfa&#355;&#259; EJB
  </Explanation>
  <UserResponse>
    Corecta&#355;i fi&#351;ierul de leg&#259;turi astfel &#238;nc&#226;t s&#259; existe numai o mapare configurat&#259; pentru fiecare interfa&#355;&#259; EJB.
  </UserResponse>
</Message>
<Message ID="CWSAL0090E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_SUCH_CU" varFormat="Java">
    NO_SUCH_CU=CWSAL0090E: Nu poate fi g&#259;sit&#259; nicio unitate de compozi&#355;ie {0} &#238;n celula actual&#259;.
  </MsgText>
  <Explanation>
    Numele dat nu se potrive&#351;te cu niciun nume existent de unitate de compozi&#355;ie.
  </Explanation>
  <UserResponse>
    Verifica&#355;i numele unit&#259;&#355;ii de compozi&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAL0050W" severity="W" prefix="yes">
  <MsgText pgmKey="EXTENSION_LIST_NOT_SUPPORTED" varFormat="Java">
    EXTENSION_LIST_NOT_SUPPORTED=CWSAL0050W: Fi&#351;ierul EBA {0} con&#355;ine un MANIFEST.MF cu antetul Extension-List. Conversia acestui antet nu este suportat&#259;.
  </MsgText>
  <Explanation>
    A&#355;i &#238;ncercat convertirea unui fi&#351;ier enterprise archive (EAR) &#238;ntr-un fi&#351;ier EBA c&#226;nd EAR con&#355;ine un MANIFEST.MF cu un antet Extension-List, dar conversia acestui antet nu este suportat&#259;. Un fi&#351;ier EAR folose&#351;te antetul Extension-List pentru a identifica JAR-urile externe pe care aplica&#355;ia le necesit&#259; la rulare.
  </Explanation>
  <UserResponse>
    Asigura&#355;i-v&#259; c&#259; JAR-urile externe care sunt listate &#238;n antetul Extension-List sunt disponibile ca bundle-uri &#238;n magazia bundle.
  </UserResponse>
</Message>
<Message ID="CWSAL0043E" severity="E" prefix="yes">
  <MsgText pgmKey="UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY" varFormat="Java">
    UNSATISFIED_CIRCULAR_PACKAGE_DEPENDENCY=CWSAL0043E: Asetul {0} nu poate fi rezolvat. Necesit&#259; bundle-ul {1}, care nu este listat &#238;n antetul Application-Content din manifestul de aplica&#355;ie, APPLICATION.MF. Acest bundle import&#259; pachetul {2} din bundle-ul {3}, care este antetul Application-Content.
  </MsgText>
  <Explanation>
    Aplica&#355;ia nu este configurat&#259; corect. Un bunlde partajat nu poate importa pachete dintr-un bunlde izolat. Bundle-urile care sunt listate &#238;n antetul Application-Content sunt izolate &#351;i pot furniza pachete doar altor bundle-uri care sunt listate &#238;n acel antet.
  </Explanation>
  <UserResponse>
    Schimba&#355;i &#238;mpachetarea configura&#355;iei aplica&#355;iei astfel &#238;nc&#226;t bundle-urile care sunt listate &#238;n antetul Use-Bundle sau ad&#259;ugate de rezolver s&#259; nu necesite pachete din bundle-uri care sunt listate &#238;n antetul Application-Content.
  </UserResponse>
</Message>
<Message ID="CWSAL0118E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_REF_STEP_NO_MAPPINGS" varFormat="Java">
    EJB_REF_STEP_NO_MAPPINGS=CWSAL0118E: EJBRefStep.validateTable(): EJBMappingsStep nu a rulat &#351;i ar fi trebuit s&#259; o fac&#259;.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0036E" severity="E" prefix="yes">
  <MsgText pgmKey="MORE_THAN_ONE_SECURITY_DOMAIN" varFormat="Java">
    MORE_THAN_ONE_SECURITY_DOMAIN=CWSAL0036E: Asetul {0} nu poate fi implementat at&#226;t &#238;n &#355;inta {1} din domeniul de securitate {2} c&#226;t &#351;i &#238;n &#355;inta {3} din domeniul de securitate {4}.
  </MsgText>
  <Explanation>
    Pentru implementarea unui patrimoniu &#238;n mai mult de o destina&#355;ie, toate destina&#355;iile trebuie s&#259; fie &#238;n acela&#351;i domeniu de securitate.
  </Explanation>
  <UserResponse>
    Schimba&#355;i destina&#355;iile patrimoniului pentru a alege setul care s&#259; fie &#238;ntr-un singur domeniu de securitate.
  </UserResponse>
</Message>
<Message ID="CWSAL0104W" severity="W" prefix="yes">
  <MsgText pgmKey="CBA_WITH_EXTRA_SERVICE_EXPORTS" varFormat="Java">
    CBA_WITH_EXTRA_SERVICE_EXPORTS=CWSAL0104W: Manifestul compus din Composite Bundle Archive (CBA) {0} con&#355;ine un antet CompositeBundle-ExportService dar nu a fost definit niciun serviciu &#238;n CBA care se potrive&#351;te cu acest filtru.
  </MsgText>
  <Explanation>
    Manifestul de bundle Composite define&#351;te un antet CompositeBundle-ExportService dar nicio declara&#355;ie schi&#355;&#259; detaliat&#259; de serviciu nu se potrive&#351;te cu acest filtru.
  </Explanation>
  <UserResponse>
    Fie ad&#259;uga&#355;i declara&#355;iile Blueprint de serviciu care lipsesc la con&#355;inuturile CBA sau corecta&#355;i antetul CompositeBundle-ExportService din manifestul compus, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0112E" severity="E" prefix="yes">
  <MsgText pgmKey="EJB_SIMPLE_NAME_AND_MAPPING_ERROR" varFormat="Java">
    EJB_SIMPLE_NAME_AND_MAPPING_ERROR=CWSAL0112E: Bean-ul de &#238;ntreprindere {0} din bundle {1} la versiunea {2} are un nume de mapare simplu definit, dar de asemenea are map&#259;ri specifice &#238;n fi&#351;ierul s&#259;u de leg&#259;turi.
  </MsgText>
  <Explanation>
    FI&#351;ierul de leg&#259;turi EJB  inclus &#238;n bundle con&#355;ine configura&#355;ie de mapare invalid&#259; pentru un bean de &#238;ntreprindere.
  </Explanation>
  <UserResponse>
    Corecta&#355;i fi&#351;ierul leg&#259;turi astfel &#238;nc&#226;t s&#259; existe un nume de mapare simplu, sau anumite informa&#355;ii de configura&#355;ie de mapare, dar nu ambele.
  </UserResponse>
</Message>
<Message ID="CWSAL0059E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_CANNOT_DELETE_LAST_DIRECTORY=CWSAL0059E: S-a produs o eroare intern&#259;. Nu poate s&#259; &#351;tearg&#259; directorul frunz&#259; al {0} astfel &#238;nc&#226;t s&#259; poat&#259; continua o redenumire de director.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0058E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY" varFormat="Java">
    UNABLE_TO_EXPAND_EBA_NO_EXPANSION_DIRECTORY=CWSAL0058E: S-a produs o eroare intern&#259;. Nu se poate expanda arhiva bundle &#238;ntreprindere (EBA), niciun director de expansiune specificat &#238;n configurare pentru {0}.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0051E" severity="E" prefix="yes">
  <MsgText pgmKey="UPDATE_ASSET_NOT_SUPPORTED" varFormat="Java">
    UPDATE_ASSET_NOT_SUPPORTED=CWSAL0051E: A fost f&#259;cut&#259; o &#238;ncercare de actualizare a unui aset aplica&#355;ie OSGi. Aceasta este suportat&#259;. Actualizarea aseturilor aplica&#355;ie OSGi poate fi realizat&#259; utiliz&#226;nd panoul &quot;Actualizare versiuni bundle din aceast&#259; aplica&#355;ie&quot; din pagina de configurare a asetului aplica&#355;ie OSGi.
  </MsgText>
  <Explanation>
    Actualizarea unui aset de aplica&#355;ie OSGi cu un binar nou nu este suportat&#259;.
  </Explanation>
  <UserResponse>
    Dac&#259; trebuie s&#259; mai mult dec&#226;t s&#259; actualiza&#355;i versiunile de bundle din asetul existent, trebuie s&#259; dezinstala&#355;i asetul &#238;nainte de a-i importa &#238;nlocuitorul. Alternativ, pute&#355;i ad&#259;uga bundle-uri noi la o aplica&#355;ie existent&#259; prin &#238;mpachetarea acestora &#238;ntr-un CBA (composite bundle archive) &#351;i ad&#259;ugarea CBA-ului ca extensie la unitatea de compozi&#355;ie.
  </UserResponse>
</Message>
<Message ID="CWSAL0120W" severity="W" prefix="yes">
  <MsgText pgmKey="NO_MDB_ACTSPEC_REFERENCE" varFormat="Java">
    NO_MDB_ACTSPEC_REFERENCE=CWSAL0120W: Nu a fost configurat niciun nume JNDI Specifica&#355;ie de activare MDB pentru bean-ul {0} &#238;n bundle-ul {1} la versiunea {2}, pentru &#355;inta {3}.
  </MsgText>
  <Explanation>
    A fost configurat numele JNDI Specifica&#355;ie de activare pentru legarea Ascult&#259;tor MDB.
  </Explanation>
  <UserResponse>
    Trebuie s&#259; configura&#355;i o referin&#355;&#259; JNDI Specifica&#355;ie de activare pentru MDB.
  </UserResponse>
</Message>
<Message ID="CWSAL0060E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_RENAME" varFormat="Java">
    UNABLE_TO_RENAME=CWSAL0060E: Nu poate s&#259; redenumeasc&#259; fi&#351;ierul {0} ca {1} ca parte component&#259; a expand&#259;rii fi&#351;ierului EBA (enterprise bundle archive) {2}.
  </MsgText>
  <Explanation>
    Pentru a finaliza expansiunea fi&#351;ierului EBA specificat, trebuie s&#259; fie redenumit un  fi&#351;ier. Aceast&#259; redenumire nu a avut succes.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; serverul de aplica&#355;ii are permisiunea de a redenumi fi&#351;ierul.
  </UserResponse>
</Message>
<Message ID="CWSAL0106E" severity="E" prefix="yes">
  <MsgText pgmKey="CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS" varFormat="Java">
    CBA_WITH_IMPOSSIBLE_PACKAGE_EXPORTS=CWSAL0106E: Arhiva CBA (Composite Bundle Archive) {0} nu este valid&#259;. Urm&#259;toarele pachete exportate &#238;n manifestul compozi&#355;iei nu sunt exportate de bundle-uri &#238;n CBA: {1}
  </MsgText>
  <Explanation>
    O arhiv&#259; CBA poate exporta doar pachetele care sunt exportate de bundle-uri &#238;n CBA.
  </Explanation>
  <UserResponse>
    Fie ad&#259;uga&#355;i pachetele lips&#259; de la export la CBA, fie &#238;nl&#259;tura&#355;i detaliile exporturilor nesatisf&#259;cute din manifestul compozi&#355;iei, COMPOSITEBUNDLE.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0022E" severity="E" prefix="yes">
  <MsgText pgmKey="BUNDLE_DEPENDENCIES_UNAVAILABLE" varFormat="Java">
    BUNDLE_DEPENDENCIES_UNAVAILABLE=CWSAL0022E: Nu poate ad&#259;uga asetul {0} deoarece bundle-urile pe care le solicit&#259; nu sunt desc&#259;rcate. Pentru a porni desc&#259;rcarea bundle-ului, salva&#355;i modific&#259;rile &#238;n configura&#355;ia master dup&#259; importarea patrimoniului.
  </MsgText>
  <Explanation>
    A&#355;i &#238;ncercat s&#259; ad&#259;uga&#355;i un patrimoniu ce necesit&#259; ca unul sau mai multe bundle-uri s&#259; fie desc&#259;rcate din magazie. Fie desc&#259;rcarea nu a pornit, fie nu este &#238;nc&#259; finalizat&#259;.
  </Explanation>
  <UserResponse>
    Dac&#259; nu a&#355;i salvat modific&#259;rile dup&#259; ce a&#355;i importat patrimoniul, salva&#355;i-le acum. A&#351;tepta&#355;i ca bundle-ul s&#259; fie desc&#259;rcat complet &#351;i &#238;ncerca&#355;i din nou s&#259; ad&#259;uga&#355;i patrimoniul la business-level application (BLA). Pute&#355;i vizualiza status-ul de desc&#259;rcare a bundle-ului din patrimoniu de la panoul detaliat al patrimoniului din consola administrativ&#259;.
  </UserResponse>
</Message>
<Message ID="CWSAL0066E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCORRECT" varFormat="Java">
    DEPLOYMENT_MF_INCORRECT=CWSAL0066E: Con&#355;inutul manifestului de implementare nu este corect. Urm&#259;toarele bundle-uri suplimentare sunt necesare {0}.
  </MsgText>
  <Explanation>
    Manifestul de implementare de importat nu include toate bundle-urile necesare pentru rezolvarea asetului EBA (enterprise bundle archive).
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; manifestul de implementare nou, DEPLOYMENT.MF, include toate bundle-urile care sunt listate &#238;n mesajul de excep&#355;ie. Nu edita&#355;i manual manifestul de implementare. Dac&#259; este necesar, &#238;nl&#259;tura&#355;i manifestul de implementare din EBA. Aceasta cauzeaz&#259; ca un fi&#351;ier manifest de implementare &#238;mprosp&#259;tat s&#259; fie generat c&#226;nd este importat EBA-ul.
  </UserResponse>
</Message>
<Message ID="CWSAL0029E" severity="E" prefix="yes">
  <MsgText pgmKey="ECES_COULD_NOT_CREATE_DIR" varFormat="Java">
    ECES_COULD_NOT_CREATE_DIR=CWSAL0029E: Nu poate crea directorul {0}.
  </MsgText>
  <Explanation>
    Directorul specificat nu poate fi creat.
  </Explanation>
  <UserResponse>
    Verifica&#355;i dac&#259; exist&#259; spa&#355;iu de stocare &#351;i dac&#259; produsul are permisiunile necesare cre&#259;rii directoruli.
  </UserResponse>
</Message>
<Message ID="CWSAL0069E" severity="E" prefix="yes">
  <MsgText pgmKey="ASSET_BUNDLES_UNAVAILABLE" varFormat="Java">
    ASSET_BUNDLES_UNAVAILABLE=CWSAL0069E: Nu poate exporta asetul {0} deoarece bundle-ul {1} care este cerut nu este desc&#259;rcat complet.
  </MsgText>
  <Explanation>
    A&#355;i &#238;ncercat s&#259; exporta&#355;i un aset care cere unul sau mai multe bundle-uri s&#259; fie desc&#259;rcate dintr-un depozit. Fie desc&#259;rcarea nu a pornit, fie nu este &#238;nc&#259; finalizat&#259;.
  </Explanation>
  <UserResponse>
    Dac&#259; nu a&#355;i salvat modific&#259;rile dup&#259; ce a&#355;i importat asetul, salva&#355;i modific&#259;rile acum. A&#351;tepta&#355;i ca desc&#259;rcarea bundle-ului s&#259; se termine, atunci &#238;ncerca&#355;i s&#259; exporta&#355;i asetul.
  </UserResponse>
</Message>
<Message ID="CWSAL0075E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE" varFormat="Java">
    DEPLOYMENT_MANIFEST_MANAGER_UNAVAILABLE=CWSAL0075E: S-a produs o eroare intern&#259;. Serviciul DeploymentManifestManager nu este disponibil din registrul serviciului OSGi.
  </MsgText>
  <Explanation>
    CMSG0001
  </Explanation>
  <UserResponse>
    CMSG0002
  </UserResponse>
</Message>
<Message ID="CWSAL0081E" severity="E" prefix="yes">
  <MsgText pgmKey="PROVISIONING_EXCEPTION_WITH_DEP_MF" varFormat="Java">
    PROVISIONING_EXCEPTION_WITH_DEP_MF=CWSAL0081E: Nu poate rezolva fi&#351;ierul EBA. Manifestul de implementare inclus nu este valid &#238;n acest sistem. Excep&#355;ie: {0}.
  </MsgText>
  <Explanation>
    Manifestul de implementare listeaz&#259; versiunile specifice ale bundle-urilor cerute. Sistemul nu poate rezolva aceste versiuni ale bundle-ului. C&#226;nd un manifest de implementare este inclus &#238;ntr-un fi&#351;ier EBA, rezolverul utilizeaz&#259; doar versiunile bundle-ului care sunt specificate &#238;n manifest. Alte versiuni valide ale bundle-ului pot fi disponibile &#238;n sistem, dar ele nu sunt utilizate deoarece nu sunt specificate &#238;n manifestul de implementare.
  </Explanation>
  <UserResponse>
    Dac&#259; este nevoie ca aplica&#355;ia dumneavoastr&#259; s&#259; utilizeze un manifest de implementare, de exemplu s&#259; asigure c&#259; exact aceea&#351;i configura&#355;ie a bundle-ului ruleaz&#259; &#238;n mai multe medii diferite, utiliza&#355;i informa&#355;iile date &#238;n excep&#355;ie pentru a identifica versiunile de bundle care sunt cerute, apoi face&#355;i-le disponibile pentru sistem. Dac&#259; aplica&#355;ia dumneavoastr&#259; nu are nevoie de acest nivel suplimentar  de control, &#238;nl&#259;tura&#355;i manifestul de implementare. Nu edita&#355;i manual manifestul de implementare.
  </UserResponse>
</Message>
<Message ID="CWSAL0108E" severity="E" prefix="yes">
  <MsgText pgmKey="INCOMPATIBLE_APP_MF_VERSION" varFormat="Java">
    INCOMPATIBLE_APP_MF_VERSION=CWSAL0108E: Valoarea specificat&#259; pentru versiunea de manifest de aplica&#355;ie {0} nu este suportat&#259;. Versiunea suportat&#259; este {1}.
  </MsgText>
  <Explanation>
    Valoarea specificat&#259; pentru antetul Application-ManifestVersion din APPLICATION.MF este incorect.
  </Explanation>
  <UserResponse>
    Corecta&#355;i valoarea Application-ManifestVersion &#238;n APPLICATION.MF.
  </UserResponse>
</Message>
<Message ID="CWSAL0065E" severity="E" prefix="yes">
  <MsgText pgmKey="DEPLOYMENT_MF_INCOMPATIBLE" varFormat="Java">
    DEPLOYMENT_MF_INCOMPATIBLE=CWSAL0065E: Cerin&#355;ele specificate de c&#259;tre manifestul de implementare din EBA nu pot fi satisf&#259;cute. Excep&#355;ia generat&#259; este {0}.
  </MsgText>
  <Explanation>
    A fost f&#259;cut&#259; o &#238;ncercare de importare a unui EBA care con&#355;ine un fi&#351;ier manifest de implementare. Cerin&#355;ele specificate de acest fi&#351;ier nu au putut fi satisf&#259;cute.
  </Explanation>
  <UserResponse>
    Verifica&#355;i con&#355;inutul fi&#351;ierului manifest de implementare &#351;i verifica&#355;i c&#259; sistemul pe care este implementat acest EBA este compatibil. Verifica&#355;i c&#259; orice depozite de bundle interne &#351;i externe sunt configurate. Nu edita&#355;i manual manifestul de implementare. Dac&#259; este necesar, &#238;nl&#259;tura&#355;i manifestul de implementare din EBA. Aceasta cauzeaz&#259; ca un fi&#351;ier manifest de implementare &#238;mprosp&#259;tat s&#259; fie generat c&#226;nd este importat EBA-ul.
  </UserResponse>
</Message>
<Message ID="CWSAL0012E" severity="E" prefix="yes">
  <MsgText pgmKey="EMPTY_APPLICATION_CONTENT" varFormat="Java">
    EMPTY_APPLICATION_CONTENT=CWSAL0012E: Fi&#351;ierul EBA {0} specific&#259; Con&#355;inut aplica&#355;ie &#238;n manifestul aplica&#355;ie, dar intrarea este goal&#259;.
  </MsgText>
  <Explanation>
    Un fi&#351;ier EBA con&#355;ine un antet Application-Content gol &#238;n manifestul propriu de aplica&#355;ie, application.mf. Dac&#259; este furnizat&#259;, aceast&#259; intrare trebuie s&#259; listeze cel pu&#355;in un bundle valid.
  </Explanation>
  <UserResponse>
    Modifica&#355;i antetul Application-Content din fi&#351;ierul application.mf.
  </UserResponse>
</Message>
<Message ID="CWSAL0123W" severity="W" prefix="yes">
  <MsgText pgmKey="INVALID_MDB_DESTINATION_REFERENCE" varFormat="Java">
    INVALID_MDB_DESTINATION_REFERENCE=CWSAL0123W: Nicio Destina&#355;ie MDB care se potrive&#351;te cu numeleJNDI {0} nu a putut fi g&#259;sit&#259; la &#355;int&#259; {1} pentru resursa utilizat&#259; de bean-ul {2} &#238;n bundle-ul {3} la versiunea {4}.
  </MsgText>
  <Explanation>
    Numele JNDI referin&#355;&#259; &#355;int&#259; de legare ascult&#259;tor MDB specificat nu exist&#259;.
  </Explanation>
  <UserResponse>
    Dac&#259; referin&#355;a trebuie s&#259; fie &#238;n spa&#355;iul de nume JNDI, fie lega&#355;i un obiect la nume, fie corecta&#355;i referin&#355;a &#351;i actualiza&#355;i EBA.
  </UserResponse>
</Message>
<Message ID="CWSAL0011E" severity="E" prefix="yes">
  <MsgText pgmKey="NO_APPLICATION_CONTENT" varFormat="Java">
    NO_APPLICATION_CONTENT=CWSAL0011E: Fi&#351;ierul EBA {0} nu specific&#259; Con&#355;inut aplica&#355;ie &#351;i nu con&#355;ine bundle-uri valide.
  </MsgText>
  <Explanation>
    Un fi&#351;ier EBA (enterprise bundle archive) trebuie s&#259; con&#355;in&#259; cel pu&#355;in un bundle OSGi sau fi&#351;ier WAR (web application archive) valid sau s&#259; listeze cel pu&#355;in un bundle OSGi &#238;n antetul Application-Content al fi&#351;ierului sau manifest de aplica&#355;ie.
  </Explanation>
  <UserResponse>
    Modifica&#355;i fi&#351;ierul EBA s&#259; con&#355;in&#259; cel pu&#355;in un bundle valid sau un WAR (inclus prin valoare) sau lista&#355;i cel pu&#355;in un bundle din antetul Application-Content al fi&#351;ierului manifest de aplica&#355;ie propriu, application.mf (inclus prin referin&#355;&#259;).
  </UserResponse>
</Message>
<Message ID="CWSAL0070E" severity="E" prefix="yes">
  <MsgText pgmKey="UNABLE_TO_CREATE_PATH" varFormat="Java">
    UNABLE_TO_CREATE_PATH=CWSAL0070E: Nu poate crea directorul: {0}
  </MsgText>
  <Explanation>
    A fost o problem&#259; la crearea numelui c&#259;ii cerut &#238;n timpul export&#259;rii asetului.
  </Explanation>
  <UserResponse>
    Verifica&#355;i c&#259; serverul de aplica&#355;ii are permisiunea de a crea acest nume de cale.
  </UserResponse>
</Message>
<!-- END MESSAGES -->
</TMSSource>
